{
  "employee_name": "Abbie Burton",
  "accomplishments": "- **Trailblazer on Warp Core**\n   - I served as an early pathfinder for WarpCore, helping establish clarity and processes that enabled our team and ultimately other teams to succeed. Malibu created the initial P2P process for WC so we had a functional starting point but it wasn't perfect. We finalized the WC Marketplace P2P using the traditional ARR process, collaborating with the platform team, to optimize the process, which included a comprehensive P2P guide for other teams to follow. Once additional teams adopt this new WC P2P process, we will be able to submit a strong supporting outcome.\n   - As part of our delivery milestones, Malibu completed Vue \"Milestone 1\", which is everything leading up to running the algorithm (matching the SCCs with sites) and successfully deployed the WC Marketplace app from IL4 to IL6. We connected to two new data sources that are now automated and reliable, significantly improving the user experience by eliminating their previously manual process for retrieving this data. We also cataloged the full Vue algorithm to ensure we had a complete understanding before re-writing it on WC. Through this analysis, we identified two viable approaches for rewriting the algorithm (Polars-based Python Transforms vs. Compute Modules) and presented them to Anthony. Pending a successful Polars proof of concept, this approach will not only allow us to migrate the algorithm, but also significantly improve its performance.\n- **Product Leader in S31**\n   - As Malibu's product manager I iterated on our outcome oriented roadmap, VSM and impact maps up to meet Rise8's standards. I shared our VSM with the other S31 teams, walking them through how we successfully approached the process, including best practices and lessons learned, so they could replicate and adapt it for their own products.\n   - I conducted an in-person site visit to NSDC in September, where we gathered baseline metrics on the current Vue experience on the KM platform and demoed the future state of Vue on WC. I reviewed and updated the VSM with our customer's input. Based on insights from that visit, I also refined Malibu's Impact Map, and Roadmap and gathered the context needed to craft a more meaningful mission impact statement. I also secured user-driven prioritization for upcoming features, ensuring our roadmap reflects real operational needs.\n   - Additionally, I prepared Frank and Alex for a second site visit in October which focused on validating Vue’s \"Milestone 1\" implementation on WC and meeting with Maj Matt Holland to better understand organizational measures of success. Because of the structure, content, and context I provided, they were able to confidently conduct all necessary research on our behalf. The insights from this visit allowed me to thoughtfully de-scope several items from the MVP based on direct user feedback, keeping the product focused, deliverable, and aligned with mission impact.\n   - In addition to driving Vue’s migration from KM to Warp Core, we also delivered meaningful enhancements based on the pain points uncovered during our first site visit. We resolved the issue with the “Load TLE” button on Vue in KM and successfully transitioned the backend data connection from the failing UDL source to a reliable data source on WC. Users have validated that the updated functionality works as intended, and we will be submitting an outcome in production for this enhancement.\n- **PM/PD Offsite Planning**\n   - I was selected to join the planning team for the PM/PD Offsite and played a key role in ensuring the event’s success. I helped determine the location, researched and selected the optimal hotel, and contributed to shaping the agenda, organizing speakers, coordinating meals and arranging networking events. The offsite, which hosted 38 Risers, went off without a hitch. We received significant positive feedback on the curated learning sessions and the value of collaborating in person, reflecting the impact of our thorough preparation and thoughtful design.",
  "enps_comments": "**Damon Redding:**\n**1. Strategic Alignment and Communication:** Abbie excels in aligning strategy, she has a keen ability to identify and address communication gaps within the team. When communication from key team members is lacking, Abbie effectively translates complex ideas into clear, understandable language for everyone. This skill has been instrumental in ensuring team cohesion and understanding.\n**2. Collaboration and Influence:** Since I've joined, Abbie has demonstrated strong performance by focusing on collaboration, pairing, and alignment. Abbie frequently engages with leadership and extends her expertise to other teams at Rise8, showcasing her willingness to share knowledge and foster a collaborative environment.\n**3. Leadership and Engagement:** Abbie's proactive engagement with leadership and her ability to lend support to other teams highlight her leadership potential. Her willingness to communicate and collaborate across the organization is commendable and sets a positive example for others.\n\n**Alex Berner:**\nAbbie is the portfolio's most trustworthy and reliable PM who consistently spearheads portfolio initiatives while ensuring her team delivers on their responsibilities in an organized and timely fashion. I especially commend her ability to grow the sense of urgency and engagement among the SPA developers on her team - I have noticed a visible improvement over the past year and I know it has been a focus of hers and not the easiest undertaking. She keeps a cool calm head about unexpected changes and approaches every new challenge with a smile.\n\n**Erica Chang:**\nAbbie has continued to do a great job of breaking down work in a way that keeps the team focused and empowered to keep continuously delivering, despite the ambiguous nature of the Warp Core migration. Setting up a site visit with the NSDC users must have been an incredibly insightful experience for the team, especially since they were also dealing with onboarding a new designer at the time. The timing would've hopefully allowed the designer to onboard even quicker onto the team. Abbie also collaborated on important artifacts with the users, like the value stream map, which allowed the team to understand the bigger picture of their work directly with the users. Abbie keeps the team moving even during times of uncertainty and is integral leader to them.\n\n**Riya Patel:**\nAbbie is dependable, consistently does the hard work and institutes Rise8 practices in her work. It's been a tough year for the Section 31 teams and I'm always impressed with how Abbie takes it in stride and still works to make Vue an even better application for users while we are in the midst of refactoring. She's an A player through and through!\n",
  "start_stop_keep": "**Damon Redding:**\n- Start:\n   - Structured Project Management: Adopt a more structured approach to project management. This includes setting clear milestones, deadlines, and deliverables. \n- Stop:\n   - Less Flexibility: Shift towards a more decisive and structured approach to ensure that the team remains focused and productive.\n- Continue:\n   - Balancing PM and Project Management Roles: Continue to balance the roles of product manager and project manager. This dual focus will help ensure that both the strategic vision and the day-to-day execution are aligned and progressing smoothly.\n   - Attention to Detail: Maintain a strong focus on details\n   - Encouraging Team Collaboration: Keep fostering a collaborative team environment where open communication and idea sharing are encouraged.\n\n**Alex Berner:**\nKeep working on growing your understanding of your product's domain in regard to the impact it provides to the broader mission of Space C2. I know it has been somewhat of a difficult rewiring process for you to really try to understand the \"why\" vs the \"what\" and you have done a great job putting in the time and effort to broaden your understanding. I would love to see over the next year this new mission focused mindset become your default when approaching any product or conversation, since I think that will really level you up as a master of the domain versus a manager of the process to which you have been assigned.\n\n\n\n\nAs a follow on to that, one suggestion is to start focusing more on storytelling when presenting your product or meeting with users and stakeholders. Being able to evangelize your product, an experiment, or an outcome - big or small, internal or external - is a superpower when it comes to building trust with users, stakeholders, and team members. I know I have given some feedback on this in the past, but some of your demos and presentations can feel a little too much like a rehash of the content on the screen which can come across as somebody having put words in your mouth versus you speaking directly from your knowledge with passion and enthusiasm. I'd love to see more of a cohesive narrative that can reference the content being presented but expands upon it instead of relying on it (if that distinction makes sense). I think the first step is to deeply understand and believe the content (which you're working on), and by doing so your confidence and understanding will come across more clearly and make all types of presentations and conversations more engaging, believable, and trust-building. I hope that feedback makes sense since it's a little tricky to articulate, but for an actionable first step maybe practicing demos of your app or VSM or recent learnings without any visual aids could force you to rely more on your personal narrative. This is a tricky but IMO enormously valuable skill, so I'm happy to pair on it more and provide feedback where I can\n\n**Erica Chang:**\n- **Keep** continuing to spread your influence within Section31, especially as the more experienced product manager and with non-Rise8 members. If the Malibu team is still the furthest ahead on the migration effort, it's a great opportunity to share learnings with other teams we well.\n\n**Riya Patel:**\nHopefully, Abbie gets the opportunity to work on an application that isn't just being refactored and has the chance to manage a product from 0 to prod!\n",
  "generation_timestamp": "2025-12-04 17:12:01"
}