{
  "employee_name": "Alex Berner",
  "accomplishments": "1. Figured out and codified a path to production for Warp Core applications that allows Section 31 to preserve its core values of pair programming and unclassified development while delivering software to production. Without this path, teams would either have to rebuild everything in the prod environment, or rely on a single developer with classified access (which many teams don't even have) to build everything on their own, thus sacrificing peer code reviews, version control, and collective ownership of software. Not only was this effort critical to keeping Section 31 alive as a program, but also reinforced Rise8's mission of outcomes in prod, grit and creativity in the face of challenges and ambiguity, and relentless focus on delivery. This was of course a team effort, but I feel proud of my ownership of the process and recognition that this was something I had to make my mission to figure out and stop at nothing to get there since there really was no other viable alternative\n2. Introduced a VSM initiative among S31 teams (we're calling them Domain Maps) to help teams (especially non Riser teams) understand their mission impact better and identify product opportunities within their mission areas once the Warp Core rebuild is complete. This has been a big mindset shift for most teams so has required a bunch of coaching, but we're making good progress. This serves to impact the mission in two major ways: 1) identify the highest value product opportunities within a mission area instead of continually optimizing lower value workflows and 2) take the drivers seat for Section 31's future by having longer term roadmaps for feature work that we can present to the government and prove the need to keep us around moving forward\n3. Addressed and (mostly) resolved a difficult personnel situation on the Surefire team involving contractors from different companies and a challenging contractual relationship. Put a system in place to gather feedback from multiple channels, worked with the team and CS to synthesize the feedback, and then took action from two fronts both at the portfolio and team level. Ultimately it resulted in a performance plan of sorts for SPA to work with their employee, and a Rise8 designer installed on the team to alleviate some of the burden of product work falling on the Riser devs. For me personally this got me out of my comfort zone and required me to have some difficult conversations and feedback session with the individual himself as well as his teammates and managers. I think this was a good exercise for me in doing hard things (these conversations really do not come easily to me) while also approaching the situation with respect and empathy in the name of bias for action while also doing the right thing",
  "enps_comments": "**Abbie Burton:**\nAlex is an indispensable member of the S31 portfolio team, the glue that keeps our operations running smoothly. He consistently anticipates team needs and takes proactive steps to enable clarity, alignment, and momentum across the portfolio.\n\n\n\n\nHe encouraged each team to develop their own product roadmap and provided a well-structured template to simplify implementation, clearly outlining desired outcomes, success metrics, and potential risks or blockers. He also created a DORA metrics sheet to track WC deployments, giving us visibility into the time from initial release to deployment and enabling data-driven improvements to our delivery speed.\n\n\n\n\nWhen we unexpectedly lost access to Lucid, Alex immediately took the initiative to identify and implement an interim solution while simultaneously working to restore our access. He has also been effectively managing the Google-to-Microsoft migration, coordinating conversations and facilitating meetings to ensure concerns are addressed and teams remain informed.\n\n\n\n\nTo improve efficiency and reduce meeting overhead, Alex consolidated each team’s weekly portfolio meeting into a single S31 Weekly Sync, streamlining communication without sacrificing visibility.\n\n\n\n\nHe is consistently supportive of Malibu, frequently pairing with us when we need assistance. He joined our site visit to help validate the VSM in person and later conducted an additional site visit with Frank on our behalf to perform user research with NSDC collection managers and leadership, work that has been extremely valuable for our team.\n\n\n\n\nAlex prompted each team to think beyond the Warp Core migration and consider the future of S31 and our applications. He created a compelling presentation outlining the value of this forward-looking work, helping non-Rise8 PMs understand and align. He also developed a reusable template to guide each team’s planning.\n\n\n\n\nOverall, Alex’s leadership, initiative, and collaborative spirit have had a significant and positive impact on the S31 portfolio.\n\n**Damon Redding:**\nAlex consistently demonstrates an exceptional 'do whatever it takes' mindset, volunteering his time for user research and independently conducting sessions with teammates. This proactive approach is incredibly encouraging and sets a high standard for the team.\nAlex is not only a great listener but also excels in navigating complex situations, from securing funding to managing bureaucratic challenges with OA. His decisions are always sound, and he has a remarkable ability to maintain calm and reduce anxiety in high-pressure environments.\nDuring my time on the Quake team, Alex was an invaluable sounding board, offering support and wisdom when we needed it most. His involvement and engagement have continued on my new team, Malibu, where his graciousness with time and commitment to the team are evident.\nAlex is a connector, motivator, and encourager, consistently affirming and uplifting those around him. His leadership style is a model for others, and his contributions are deeply appreciated.\n\n**Darius DeSpain:**\nAlex is a trusting and thoughtful leader who embraces giving teams autonomy all while emphasizing Rise8 values. He is always doing the right thing and is transparent about what needs to be done and how he can help anyone else's efforts. He's a pillar of his portfolio and the company would not be the same without him.\n\n**Riya Patel:**\nAlex has truly been the rock for Section 31. Cool, calm, collected, but knows when to fight for what matters to Rise8, Alex is one of the best examples of a Riser who understands how to balance bias for action with strategic patience. Leading a portfolio that has just been refactoring for a year is not typical at Rise8 nor is it particularly stimulating work, and Alex has been rolling with the punches/I don't think I've ever heard him complain. I would be remiss to not highlight the grit and commitment to sticking by the users that entails.\n\n**Jennifer Van Hove:**\nEven though I've worked with him for a relatively short time, I already have plenty of examples of the way Alex is an effective collaborator and team leader.  He has endless context in a complicated space, and he uses that background to influence stakeholders, define Rise 8 strategy, and position the Section 31 portfolio for success.  In addition to the stakeholder management and strategy work, Alex is also working with the Section 31 teams to better define their strategy, pairing with them on value stream work, handling some of the more challenging partner personalities, handling bureaucratic snafus like missing CTFs, etc.  He's doing his best to unblock the teams at every level and the portfolio as a whole is better positioned to succeed due to his unfailing effort.\n",
  "start_stop_keep": "**Abbie Burton:**\n- With the S31 contract up for renewal after Q1 2026, it will be important to continue guiding teams to dive deeper into their VSMs to identify future opportunities and clearly articulate the work needed to secure continued funding. \n- Continue hosting quarterly S31 retros to assess organizational health and identify opportunities for continued improvement and forward momentum.\n- Continue providing ongoing support and pairing with Malibu and leveraging your proximity to users to enable meaningful, timely collaboration that drives impact.\n\n**Damon Redding:**\n- Start:\n   - Mentorship Program: Initiate a mentorship program where you can share your leadership insights and experiences with others in similar roles. This will help codify your approach and allow others to benefit from your expertise.\n   - Documenting Best Practices: Begin documenting your successful strategies and decision-making processes. This could be in the form of a playbook or a series of workshops, making it easier for others to learn from your methods.\n- Stop: \n   - Nothing\n- Continue:\n   - Leading by Example: Keep demonstrating the qualities that make you a standout leader. Your ability to inspire and motivate others is invaluable, and continuing to lead by example will reinforce your influence across the organization.\n\n**Darius DeSpain:**\n- start\n   - giving more frequent feedback (individual or team level or both)\n   - asking more questions to teams\n   - a bit more of communicating expectations for teams and how they align with portfolio strategy\n- stop\n   - Nothing I can think of\n- keep doing\n   - providing candid constructive feedback (more is always welcome)\n   - Having high trust with teams and individuals (unless an individual or team has proven otherwise)\n   - showing the portfolio the way by example (e.g. portfolio retros and strategic share-outs)\n   - being incredibly supportive\n\n**Riya Patel:**\nHopefully, we're nearing the end of refactoring/ Alex has the opportunity to lead a portfolio that can consistently produce outcomes. At the same time, I think he has been such a key leader for Section 31 and built such a strong relationship with CAPT Laurio, that I hope he has the willpower to help us keep pushing SYD85 to be better and continue the work Section 31 has started!\n\n**Jennifer Van Hove:**\nContinue: Supporting your teams, setting them up for success, and coaching them as needed.  I get the feeling that the teams are so lightly staffed that Abbie and Darius probably need help occasionally - but it takes a unique skill set to be able to be able to collaborate effectively with them and then turn around and help Carlo with the portfolio strategy as well.\n",
  "generation_timestamp": "2025-12-04 17:27:59"
}