{
  "employee_name": "Ann Kung",
  "accomplishments": "1. Derisked Program Licensing\n   1. I took the lead in managing high-risk licensing issues, procuring quotes, and getting SciTec up to speed on our software needs. I've delved into complex vendor enterprise agreements & facilitated sizing discussions to help lower costs of quotes for the customer. I've also navigated testy vendor relations and maintained the continuity of NFRs in the absence of government funding for licenses to help ensure development in our internal environment is not impeded.\n2. Drove Progress on Metrics and Performance Measurement\n   1. I helped lead the effort to define key IT Services metrics (e.g.,Time to Onboard, Average Ticket Resolution Time, NPS/CSAT) and collaborated with Chase on the visualization of metrics. I created NPS and CSAT surveys to quantitatively measure team performance and identify systemic pain points & paired with Enablement/Design on a feedback loop framework. This establishes the data-driven foundation for the IT team, enabling the identification of issues and providing verifiable evidence to the customer and leadership to showcase the team's impact and guide future feature development.\n3. Established the Initial Scope and Strategy Framework for the IT Services Team\n   1. As the PM, I am responsible for the foundational work of helping define the team's direction and ensure visibility of progress to leadership & the customer. I've worked to define the team's charter and one-pager vision statement, seeking to clarify the blurred scope between IT Services and other teams like Enablement, and leveraging that to drive our roadmaps, backlogs, and define our responsibilities more clearly. I've also established IPM & sprint rituals for a team that did not have experience with it before. I've provided the essential structure and transparency required for a complex project, ensuring that IT Services' contributions were documented, prioritized, and aligned with overall program milestones, which is critical for accountability and strategic alignment with leadership",
  "enps_comments": "**Chase Cast:**\nAnn is an **outstanding Project Manager** who consistently demonstrates a deep commitment to the team's success. She effectively **guides and aligns** team efforts, ensuring we remain focused on key objectives and successfully achieve high-quality project outcomes.\n\n**Dave Blotter:**\nI've rated you highly in areas like \"Grit,\" \"Do What Works,\" and \"Outcomes\" because your passion for the objectives of the project and your drive to deliver customer centric outcomes along with the best possible customer experience are clear and valuable. Your focus on the big-picture goals is a huge asset to the team.\n\n\n\n\nTo make our collaboration even stronger, I am eager to partner with you to help translate that mission-focus into a clear, prioritized, and predictable backlog for the engineering team.\n\n\n\n\nLike all engineers, we do our best work when we have a clear vision of *why* we're building something (the customer problem) and *what* the priorities are (the backlog). The recent start of the IPM has been a good step, I'm looking forward to working with you to continue building on that momentum and improving our team's alignment and velocity.\n\n**Eric Whitman:**\nIn an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year\n\n**Joshua Pritchett:**\nAnn has excelled at proactively identifying and addressing portfolio-level practice gaps, such as tracking risks and blockers. She has skillfully managed complex, cross-team dependencies, demonstrated by her work handling intricate funding and licensing requirements across six teams. Ann also consistently seeks feedback and has taken the initiative to lead process and discovery refinements, resulting in tangible improvements to team performance.\n\n**Jeremy Steinbeck:**\nAnn embodies the A player mindset in all my direct interactions with her and from what I've observed from her performing her PM duties.\n",
  "start_stop_keep": "**Chase Cast:**\n**Keep Doing:**\n- **Maintaining the drumbeats and BSR inputs:** You have been key in presenting our team's involvement on the FORGE project. Without your exceptional writing abilities, key highlights of our team's accomplishments and work would not be expressed. \n- **Running the IT Service Team:** As the Product Manager for ITS you have shown great efforts in running the team and organizing the meetings that enables the team to ship out comes to not only the other teams but to the client at the end of each day! **** \n\n\n\n\n**Stop Doing:**\n-  **Holding back critical, constructive comments during team meetings or reviews:**  Your unique perspective as Product Manager is essential for course correction. Use your voice assertively to challenge assumptions and ensure the team is meeting its high standards.\n\n\n\n\n**Start Doing:**\n- **Establishing regular touchpoint meetings with key dependent teams (e.g., bi-weekly or as appropriate).** Use this dedicated time to communicate ITS updates, proactively identify potential areas of collaboration, and gather feedback on service needs before they become urgent requirements.\n\n**Dave Blotter:**\n- **START:** I recommend you **start** championing the \"why\" *more consistently* for the team. While this is often clear on our smaller, more simply defined tickets, the team would find it invaluable if you could **start** *every new, complex issue and epic* by clearly articulating the customer problem or strategic priority it addresses. This context is essential for us to build the right solution and is most critical on large, undefined tasks where the \"why\" helps guide our discovery.\n- **START:** I also recommend that you **start** taking a more active role in *owning the backlog* and defining our weekly/sprint objectives. The team would benefit greatly from your leadership in grooming, prioritizing, and clearly defining the \"definition of done\" for our upcoming work.\n- **STOP:** I recommend that you **stop** assigning tickets that are still in a \"discovery\" or \"undefined\" state. When the team receives large, complex work (like the Automation Script) or tasks with unknown requirements (like the Cyber Policy ticket), it forces us to stop development or delivery to do the work of discovery. To fix this, a spike may be used for independant discovery or maybe we can use the IPM to *collaboratively* break down these issues and do that discovery *together* before the work is assigned, prioritized, and scheduled to work.\n- **KEEP:** Please **keep** bringing your \"Grit\" and passion for the program's success. Your relentless focus on the mission is valuable for our team and the customer. The recommendations above are all intended to help us harness that passion and translate it into a clearer, more sustainable, and higher-velocity process that will benefit all involved.\n\n**Eric Whitman:**\nIn an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year\n\n**Joshua Pritchett:**\n- Keep proactively identifying and addressing practice gaps. Your initiative in managing risks and blockers for the portfolio shows you are already thinking beyond your immediate team, which is a key leadership behavior.\n- Keep leading and facilitating sessions on process and discovery refinement. your commitment to seeking feedback from other senior practitioners, and ensuring the team is hitting its practice needs, is a perfect example of advocating for PM practices and directly improves the team's operating performance.\n- Start shaping the strategic** direction of your team based on evolving requirements and what the portfolio needs. You have done a great job managing complex tactical work (like the licenses); the next step is to use those insights to proactively define what the team should focus on next to best align with the portfolio's larger goals.\n- Consider shifting your stakeholder engagement model from 'reporting' to 'guiding.' Instead of just presenting updates on complex work, start proactively shaping the team's work to influence overall project priorities. When you engage stakeholders, use your team's insights to frame strategic trade-offs or recommend mitigation plans. This approach demonstrates how your team's work connects to the bigger picture and positions you as a key leader in driving the project's direction.\n- Consider how you can leverage your balanced team more to \"define and communicate strategy\". You've done a great job refining processes with them. The next step is to use that same collaborative power to co-create and broadcast your product's vision.\n\n**Jeremy Steinbeck:**\nI recommend you keep asking the hard questions when it comes to seeking alignment from internal and external stakeholders. The path is often challenging and fuzzy on FORGE but I think you're doing a great job trying to seek and drive clarity. You have grit to keep on delivering even if the path to success is frought with obstacles.\n\n\n\n\nI do think you could take on additional roles and responsibilities within the company.  You are wicked smart and I want to see you reach your potential and share your talent outside of project work. 😀\n",
  "generation_timestamp": "2025-12-04 17:26:53"
}