{
  "employee_name": "Becca James",
  "accomplishments": "1. In the 4 months I have been on the CFC account, I have built strong relationships with my customers that aren't just friendly, but strategically effective. I have garnered trust in my own competence enough that I am asked to influence shaping how the CFE organization works, vet which projects we should take on, and have been appointed responsibility to ensure that the government's strategy is represented on our product team's roadmaps. These responsibilities have positioned Rise8 in a position of increased trust wherein we can influence which projects we take on and how we build those products to maximize our mission impact.\n   1. JP: \"Thanks, Becca! I really appreciate your ability to tease the process out of the words and create a professional product that makes sense. It forces us to think deeply about how things work vs how we sometimes think they work. There are always hidden or implied assumptions that when not addressed become alligators in the pond 😊\"\n2. CFC is a portfolio again! Identifying, researching, scoping, and eventually getting that project approved was a huge win for our presence at CFE. Not only did it demonstrate to our customer the value we can provide in shaping our work, but it puts us in a position where we can justify our staffing going into renewal season. It has also provided a mechanism that we can iterate and refine upon to create more opportunities for more teams.\n   1. JJ: \"I've never seen so much thought put into an effort as this.\"\n   2. Paul: \"We're closer than we've even been to being a high-functioning software delivery organization; we're outpacing our peers.\"\n3. While it appears small, facilitating the process to re-allocate a WINDAR-S machine was a huge win for our account. This effort required laying a foundation to get the customer to understand the importance of daily SIPR access and managing the bureaucratic processes (in the middle of the shutdown). This re-allocated of a SIPR resource increased our delivery and release cadence from a pace of approximately 1-2 releases/month to 1-3 releases/week. Additionally, I've kept pressure on the customer and the government on many fronts to get additional SIPR/JWICS access with regards to tokens, SCI indocs, and WINDAR-S machines. While we haven't seen big movement here, I feel accomplishment that the customer now understands and values that our team's need this kind of access to be a high-performing organization deploying to classified systems.\n   1. JJ: \"Team, primarily the good work of Maj Dong and Becca, but after WAYYYYYY too much emails, chats and phone calls with DISA, they helped successfully get Sagar up and running on a WINDAR-S. These are the types of daily battles that no one rarely sees, but are critical to making ops better. Thank you!\"",
  "enps_comments": "**Lambo Lamberson:**\nBecca is doing a great job. She has quickly been able to spin up on the platform and domain space. She has been able to identify new opportunities for the team to work and map them out.\n\n**Riya Patel:**\nIn a world pre-Becca, I probably spent about 50% of my time dealing with SpOC shenanigans, both customer feedback or internal feedback. It felt like the team was always on the brink of another big fire. Since Becca has been brought on as the Product Lead and now the Delivery lead, I spend about 10% of my week on SpOC and the difference of the conversations happening, cadences, and activities taking place within the team is night and day. Of course, that's not all because of Becca (a lot of work went into changing the trajectory of the account and continues to go into that), but I don't think we would be in such a positive state compared to where we were without Becca's leadership, resilience, and ability to cut through all the noise and focus on what matters to produce outcomes and enable the government team to protect their mission and budget.\n\n**Evan Mladinov:**\nBecca has been an outstanding Delivery Lead for the CFC contract. She has been exemplary in her role in starting our new effort on the contract. She has gotten us a ton of information that has made our inception meeting with our customer a breeze. She is not afraid to have conversations on feedback. I really love how she is open about what is going on in her world as a Delivery Lead. I believe in the past (before Becca), the separation between portfolio and the product team discussions has caused miscommunications with the customer and rifts between Risers internally. With Becca we really feel like one team. I have all the information she has to help me ramp up with the new product.\nShe is also very clear when she expects something which is important in a team leader. Everything moving forward is very clear, and if it isn't, we quickly do whats necessary to disambiguate. \nBecca has clearly developed great relationships with the customers and manages expectations with them very well. She is an epitome of Rise8 values and software team leadership.\n\n**Abel A A Hernandez:**\nBecca came into a very damaged team dynamic and challenging customer situation, quickly gain the trust and confidence of not just our team, but the customer. Her ability to get caught up on a year worth of messy clutter to provide us a path forward and focus was nothing short of amazing.\n\n**Kevan Mordan:**\nBecca inherited a problematic account with internal and external relationship issues. Her calm, direct stewardship has corrected course and the account is significantly healthier and more performant because of it.\n\n**Coby Almond:**\nI would rehire Becca immediately because she possesses the rare ability to walk into a chaotic, high-pressure client environment and stabilize it through structure and integrity. She consistently embodies the value of \"Keep It Real\" by refusing to let the team and customer overpromise on low-value efforts.\n\n\n\n\n- **She protects the team and the mission:** When we faced significant pressure from leadership to commit to unrealistic timelines for a tracking tool, Becca did not buckle. She validated the stakeholders' anxiety but firmly rejected a delivery schedule that would have set the team up for failure. This move prevented us from falling into a trap of \"anticipatory obedience\" and allowed us to pivot toward more meaningful work.\n- **She Does What Works**: Becca does not just talk about theory; she executes the hard work required to create alignment. Even when the client’s processes were undefined and messy, she initiated value stream mapping and created foundational documentation to visualize the chaos so we could fix it.\n- **She drives outcomes over outputs:** Her recent success in scoping a new opportunity demonstrates her growth in the Space Domain. Instead of relying on top-down command directives, she traveled to operational sites to validate user needs directly. This customer shift from reactive execution to proactive discovery proves she is operating as a true Delivery Lead focused on outcomes. A huge win!\n\n\n\n\nFinally, Becca is one of the most kind and charitable colleagues I've worked with. It was bittersweet to have to leave her team and our pairing sessions. I greatly look forward to working with Becca again. It was a real privilege.\n",
  "start_stop_keep": "**Lambo Lamberson:**\nKeep searching for opportunities that can be worked and presenting them to the client and team so that the impact to the mission is clear and measurable.\n\n**Riya Patel:**\nStart/Keep Doing: Keep delivering honest feedback to the delivery team and customers. Keep helping us right size risks and potential flags that need addressing vs. distractions that could cause spin for no reason. Keep continuing to kick butt! \nStop: Nothing really comes to mind to stop.\n\n**Evan Mladinov:**\nI have been with Becca since she started on the contract. So far I believe everything we have worked on together has been great. I have no comment on anything to start or stop. She should keep doing what she's doing.\n\n**Abel A A Hernandez:**\nkeep being an influential voice of reason for our customer. Your ability to bring order and structure to what can be a \"messy kitchen drawer\" situation is crucial for the team's stability and execution.\n\n\n\n\nstart finding ways for Product Managers to be more directly and consistently involved with the customer. You established a great rapport, and I believe can encourage the customer to interacting directly with the Product Managers on a regular basis.\n\n**Kevan Mordan:**\nKeep: Showing up professionally and with confidence\n\n**Coby Almond:**\n**START:**\n- **Owning the strategic narrative:** Now that you are the lead, start shifting from facilitating strategy conversations to dictating the strategic options. You have the context and the user data; start telling the client what the strategy is rather than asking them what they want it to be.\n- **Prioritizing your own sustainability:** You have powered through sickness and risked burnout to keep the team moving. Start enforcing your own boundaries more strictly to ensure you can sustain this high level of performance for the long term. You're modeling what we want people to replicate. Let them see what recovery looks like too.\n- **Sharing your wins and vision more publicly:** You recently moved into a role where you need to be the advocate for the account's success alongside your CSM. You two can be a dream team of showing what transformation could be for the customer. Paint that picture!\n\n\n\n\n**STOP:**\n- **Apologizing for your strategic presence:** Early in our work together, you expressed concern about being a distraction or slowing the team down. You must stop viewing your strategic pauses as impediments, even if the customer complains. Your questions and structural checks are the work, and they prevent the team from running in the wrong direction. A calm confidence that your presence brings value is what the customer needs to continue to feel from you.\n- **Doubting your placement:** You have occasionally expressed imposter syndrome regarding your status as a top performer in the Space Domain. You stabilized a flailing portfolio and secured our first true portfolio-scoped opportunity for SpOC. You belong in the room; don't question your authority or expertise.\n- **Doing the heavy lifting on execution:** You have a tendency (and superpower) to handle the minute details of artifacts yourself. As you fully step into the Delivery Lead role, stop personally formatting every document and start delegating (or pairing on) these tasks to your team so you can focus on the high-level work. Teach them how, if required, and scale your impact and influence.\n\n\n\n\n**KEEP:**\n- **Demanding structure in ambiguity:** Keep pushing for artifacts like value stream maps, even when the client environment feels too messy to document. Your ability to create order from chaos is a superpower that anchors the team.\n- **Protective pushback:** Keep protecting the team from urgent but low-impact requests. Your handling of the timeline discussions regarding the OPT tracking feature was masterclass account management; you prevented the team from committing to bad software outcomes.\n- **Going to the source:** Keep prioritizing direct user engagement, such as your recent site visits. Validating needs on the ground rather than accepting assumptions from leadership is the only way to ensure we deliver valuable software users actually love. The PM practice on SpOC needs to continue to see what good looks like here. You're positioned well to show them.\n",
  "generation_timestamp": "2025-12-04 17:26:11"
}