{
  "employee_name": "Clark Pain",
  "accomplishments": "1) Lead the SpOC project from inception to outcome delivery within a few months, demonstrating Rise8's expertise in ops-oriented software delivery.\n2) Coached SpOC senior stakeholders on not only software development best practices but also software delivery organizational concepts that I believe will have very long lasting impacts on the trajectory of SpOC and our work with them.\n3) Helping the Bifrost team persevere through an uncertain path to ATO and (hopefully) finding an optimal path to accreditation. Making the right choices here will set Bifrost up to be an outcome producing powerhouse for a very long time.",
  "enps_comments": "**Coby Almond:**\nClark is hands-down one of the most effective PMs I have worked with. I would rehire him instantly because he possesses the rare combination of high-level strategic patience and the grit to deliver actual, measurable results.\n\n\n\n\n**1. He creates clarity out of chaos.** Clark’s greatest strength is his demeanor. In an environment often plagued by uninformed leadership chasing \"shiny objects\" or budget-spending exercises, Clark is the calm in the storm. He doesn't just take orders; he navigates difficult domains and speaks the client’s language to steer them away from bad ideas and toward real mission impact. He builds trust where others build frustration, acting as the steady hand our clients are desperate for.\n\n\n\n\n**2. He refuses to settle for \"performative\" wins.** Clark is allergic to \"theater.\" He demands that we back up our wins with evidence and measurable changes in user behavior. A perfect example of this is how he established the growth board practice for the **Combat Force Enhancement division inside Space Operations Command**. That wasn’t an easy win; it required calming stakeholder anxiety and proving value every step of the way. If Clark hadn't been there to \"read the room\" and execute, I don't believe that outcome would have happened.\n\n\n\n\n**3. He elevates the entire practice.** Beyond his own delivery, Clark acts as a force multiplier for the team. I’ve watched him step in to coach and mentor struggling PMs, helping them turn their performance around. He is kind, he listens, and he provides the sort of direct, honest feedback that makes the whole PM practice better. He doesn't shift blame when things go wrong; he owns it and fixes it. He is exactly the type of leader we need to retain.\n\n**Kevan Mordan:**\nClark is a standout PM at Rise8 and has a rare ability to communicate with any stakeholder at any time. I believe he can be successful in any project.\n\n**Riya Patel:**\nI've been impressed with how quickly Clark jumped back into work and Bifrost after paternity leave. It was a very smooth transition from Jen and appreciate how quickly he learned the ropes, especially in a pipeline/platform contract.\n\n**Steven Souto:**\nIn the short time I've worked with Clark, I am picking up on a lot of really great skills that I expect of a high performing PM: very comfortable in uncertainty, asks lots of questions often, repeats back complex thoughts and ideas for clarity, interest in organizing a backlog that suits the team rather than just his own style. Clark quickly became a confident spokesperson for the value of the Bifrost team creating a very smooth handoff from our previous PM.\n\n**Chris Johns:**\nClark Pain's performance, particularly following his return to the team after being on paternity leave, strongly supports an \"Strongly agree\" answer to the question: \"I would enthusiastically rehire this Riser for their role on my team.\"\n- Clark immediately stepped into a politically fraught environment and successfully drove strategic alignment, particularly regarding the complex Authority to Operate (ATO) challenges.\n- When the initial approach using the Warp Core ATO hit major roadblocks due to resource limitations and bureaucracy, Clark proactively developed and championed new strategic COAs\n\n**Dan Sanker:**\nClark's contribution to the Bifrost Team has been immediate and impressive. His previous experiences with our customers have been a clear asset, but his most valuable skill is his exceptional communication.\nWhat stands out most is that he was able to build trust and create clarity for our customers *before* he even fully understood the program's design. His ability to handle difficult news and manage relationships at that early stage is a rare skill that has already proven incredibly valuable.\n",
  "start_stop_keep": "**Coby Almond:**\n**Stop**\n- **Stop waiting too long to have the hard conversation.** You have a natural bias for building rapport and trust, which is a huge asset, but I have seen you shield the customer (and sometimes the team) from reality for too long. You're improving a ton here, but keep working on it!\n- \"Always Be Kind\" includes the responsibility to challenge directly. By shielding stakeholders, you inadvertently delay the pivot or solution they need. You have built the capital with these folks—spend it sooner. We need you to be real about risks immediately, even if it feels like it might damage the relationship. It won't; they will trust you more.\n**Start**\n- **Start attacking the Executive Gap.** We have a known issue as a company regarding deep relationships with executive stakeholders. You have the demeanor and the domain fluency to fix this. Don't just solve problems for your immediate POCs; start navigating up the chain to their leadership. You are the right person to help solve this business risk alongside growth.\n- **Start codifying your personal playbook.** You established a successful Growth Board practice this year—now spread it. Document your methods so other teams can replicate your success without you having to be in the room. This moves you from individual contribution to strategic influence.\n- **Start being loud about your wins.** You are humble and take your lumps, but points on the scoreboard determine our growth. Be more aggressive in marketing your team’s outcomes to leadership. We need to know what winning looks like so we can resource it properly. The hard conversations with customers will help here!\n**Keep**\n- **Keep being the calm in the storm.** Your ability to navigate the ambiguity of uninformed leadership without getting rattled is your superpower. It anchors the team and builds massive trust with clients.\n- **Keep mentoring the practice.** I see you coaching struggling PMs and elevating the standard of our delivery. You aren't just shipping your own wins; you are raising the floor for everyone else.\n- **Keep demanding evidence.** Continue to push back on performative wins. Your insistence on measuring actual changes in user behavior is the difference between a simple activity and actually doing what works.\n\n**Kevan Mordan:**\nStart - holding other PMs to higher standards\nStop - \nContinue - being agile and able to pivot without taking it personally\n\n**Riya Patel:**\nKeep Doing: Clark is great PM - reliable, quick to learn, I trust him to be client facing and he has the soft skills to manage complicated stakeholders, he has the right attitude and brings the right energy to the team, big fan! \n\n\n\n\nI would put this in the start/stop bucket and wanted to provide some context as to why I marked solid performer on Keep it Real: It's not that I think Clark is not great at keeping it real with the team about impact, risks, and challenges along the way. He certainly takes ownership of problems. \n\n\n\n\nSometimes Clark can soften his feedback for team members a little too much and that has led to confusion and misalignment on what the customer feedback even was in the first place. I think Clark has the foundational trust with his team members to give clear and direct feedback, so it's more a matter of getting comfortable in striking the balance. I say this but also recognize that this is the hardest skill to have so keep on working on this with the rest of us Risers too!\n\n**Steven Souto:**\nKeep pairing closely with engineering and getting an intimate understanding of their work we are doing. This is such a great skill for a PM and Clark is great at it, using the language of platform engineering himself after just a couple days with little prior experience. Keep providing kind and timely feedback and communicating in a way that creates open conversation and exploration.\n\n\n\n\nPerhaps start having more strong opinions on what artifacts should exist for a product team and a cadence for maintaining their quality. We've started to build up a list of epics, but I'd like to see them tied to clear value statements with at least a discussion for possible measurement in the future. Maybe we should revisit our value stream map as well.\n\n**Chris Johns:**\nKeep Doing:\n- Keep serving as the primary advocate and strategic shield for the team against political and bureaucratic friction.\n- Keep establishing and iterating on clear structures for managing the backlog and product vision.\nStart Doing:\n- Start formalizing and anchoring team knowledge and processes, particularly compensating for the departure of core senior platform expertise.\n- Start resolving long-term contractual and resource constraints.\nStop Doing:\n- Let the engineers handle the spikes and low-level engineering tasks. Your time is best spent leading strategy and managing external relationships.\n- Focus on providing high-level prioritization and scope (the \"what\") and rely on the engineering team to generate the detailed sub-issues and tasks.\n",
  "generation_timestamp": "2025-12-04 17:28:11"
}