{
  "employee_name": "Ian Sperry",
  "accomplishments": "",
  "enps_comments": "**Darla McGraw:**\nIan is an exceptional leader who exemplifies Rise 8 values even beyond the company. He brings the strategic guidance necessary to deliver mission-critical outcomes across organizational boundaries.\n\n\n\n\nIan's ability to drive systemic change and influence ways of working is a prominent factor in the team's success and long-term scalability. He possesses a talent for storytelling truths about current constraints, effectively reframing organizational obstacles and necessary technical investments through a compelling perspective. This mastery of communication has been critical in building the trust and consensus required to successfully push initiatives.\n\n\n\n\nHe manages complexity with ease, expertly balancing internal needs by ensuring all Rise 8 teams within the EMC contract are aligned on a united front, while simultaneously managing all external priorities and demands from the customer. During periods of strategic ambiguity regarding the next direction for the Quake mission, Ian consistently advocated and executed decisions that prioritized the long-term health and success of Rise 8. He is truly an A+ Player whose leadership elevates our entire product function, setting a strong example of our company's core values.\n\n**Cason Brinson:**\nIan consistently demonstrates the values of \"Keep it Real,\" \"Do What is Required,\" and \"Do The Right Thing.\" Although I primarily work with Ian in team meetings, his drive for efficient execution is clear. He is effective at asking the crucial, tough questions needed to quickly get to the heart of problems and find solutions. Importantly, he is excellent at noting action items and ensuring prompt follow-up, which prevents critical items from being dropped. Furthermore, Ian is highly committed to delivering outcomes by taking the lead on presenting results to the company and tracking team outcomes. His mission-oriented focus ensures that he consistently advocates for outcomes for the customer.\n\n**Nick Eissler:**\nI strongly agree that I would enthusiastically rehire this Riser for their role on my team.  Ian has quickly built a strong understanding of the SATCOM space and orgs around us, and this has certainly shaped our decisions for the better.  He does a great job planning outcomes and collaborating on what metrics we should collect to validate them.  He is very open to feedback, consistently incorporating dev input into prioritization.  In meetings with external teams he asks thoughtful, outcome-oriented questions that keep us on the right track.  Ian's abilities have definitely been a huge part of our teams success.\n\n**Peter Duong:**\nIan has been an excellent PM, successfully navigating the bureaucratic process to get Blitzar Operationally Accepted. This included managing stakeholders through a difficult organization transition and aggressively pursuing avenues of funding and policy for Blitzar's capabilities. This is direct evidence of his outcome focus. Furthermore, Ian serves as a critical technical liaison: he rapidly demonstrated his aptitude by easily mastering our SMTP Client/Relay architecture and immediately translating those diagrams and workflows to stakeholders. This ability to understand and speak intelligently about our technical approaches accelerates alignment and reduces the need for engineers to spend time translating internal complexities. Finally, Ian is a great teammate who brings a highly positive vibe; he puts effort into knowing his teammates on a personal level, which is foundational to building a strong, collaborative team environment.\n\n**Vin Foregard:**\nI collaborate with Ian regularly during standups, IPMs, retros, team discussions, and user research. He is straightforward, outcome focused, and understands his role as PM well. He trusts the team to execute and pushes with urgency when needed without micromanaging.\n\n\n\n\nIan consistently keeps the team aligned and makes sure we understand stakeholder goals and priorities. He communicates feedback clearly and considers engineering and design implications before making decisions. He creates space for open discussion and maintains an environment where the team feels comfortable contributing.\n\n\n\n\nDuring onboarding, even when Blitzar was in a busy stage, he took the time to share documents and provide domain context, which helped me ramp up faster. He made sure I had access to everything I needed and checked in regularly. He also pushed for approval for me to join a user research trip within three weeks of joining the team, which helped me understand the product firsthand and build trust early. His leadership helped move Blitzar into production faster than expected.\n\n\n\n\nIan demonstrated that he can lead the team from alignment to production outcomes while maintaining a culture of trust and open dialogue. He keeps communication open and makes it easy for anyone on the team to bring up ideas or concerns without hesitation.\n\n**Riya Patel:**\nn/a - hit max cap\n",
  "start_stop_keep": "**Darla McGraw:**\nIan should continue his pivotal role as a strong organizational partner who proactively builds structure, governance, and clarity across complex initiatives. He should continue being fearless in taking on the hardest challenges and executing with a confidence that inspires and elevates the entire team.\n\n**Cason Brinson:**\nIan should keep up the great work maintaining his high level of efficient work and solid commitment to outcomes. Specifically, keep asking the crucial, tough questions that accelerate problem-solving, and continue to be excellent at tracking and driving action items to completion. I anything, I recommend Ian spend less time discussing technical solutions or options in meetings. Allowing the engineering team to own those implementation specifics just to keep things moving.\n\n**Nick Eissler:**\n**Keep:**\nKeep providing the team clarity when things are ambiguous and helping us stay aligned on what matters most. The way you handle external partners, ask the right questions, and stay receptive to feedback has made a huge impact.\n\n\n\n\n**Start:**\nStart bringing hypotheses and metrics even more into the planning process. We’re getting better at this as a team, and you can help us push to make our decision making even more data driven and hypothesis based.\n\n**Peter Duong:**\nKeep building those relations with stakeholders. It is extremely beneficial not only to our team but also to the other Rise8 teams on the EM&C contract.\n\n\n\n\nI would like to see you continue experimenting with AI to enhance story generation, automatically including the impact statement and a relevant snippet of the Value Stream Map (VSM) it is supporting.\n\n**Vin Foregard:**\nIan could start sharing more of his PM thought process with the team. A simple walkthrough of how he prioritizes work or manages tradeoffs would help others understand his approach and could be valuable for anyone interested in moving toward a PM path. Even lightweight documentation or informal sessions could go a long way.\n\n\n\n\nAt times he takes on too much himself. Distributing responsibilities earlier and showing how he arrives at decisions could help build stronger ownership across the team and prepare others to take on bigger roles.\n\n\n\n\nHe should continue keeping the team aligned and focused on outcomes. His clear communication, urgency, and transparency with stakeholders are valuable to team culture. The trust he built during onboarding and his effort to involve people early had a direct impact on my ability to contribute, and I would like to see him keep that approach as a leader.\n\n**Riya Patel:**\nn/a - hit max cap\n",
  "generation_timestamp": "2025-12-04 17:27:40"
}