{
  "employee_name": "Jennifer Van Hove",
  "accomplishments": "1.  I supported Bifrost as an interim PM while also managing DPL responsibilities.  During that time, we delivered a pipeline MVP, demoed it for the customer and pushed forward with ATO conversations.  Although we did not lock in the ATO, we did continually push for clarity, present new options, and drive stakeholder alignment.  I helped the team push towards less common options instead of accepting the status quo.  Bifrost is a key part of Rise8's overall strategy to help the USSF deliver capabilities - in this case, third-party apps - to warfighters.  We proved we can get apps on Apollo; now all they have to do is let us do it.  \n2. I supported the PM practice as a whole by pairing with individual PMs, interviewing a steady stream of potential new PMs, and working on educational resources like the storytelling curriculum. I worked with Rise8 teams like Gateway and Forge to create and refine their value stream maps, which was a helpful way for many teams to identify missing steps in their roadmaps and help prioritize enhancements along the way.  \n3. I transitioned into a DL role, which involves internalizing context for five additional projects, the portfolio as a whole, and 33 people so that I can effectively collaborate with these teams as they deliver outcomes.  Although still early in the transition, I am already identifying and planning next steps for areas of impact, such as the EM&C deployment cycle and Section 31's relationship to Project 7.",
  "enps_comments": "**Rob Monroe:**\n- Jenn does a phenomenal job dissecting and understanding what is unique about Rise8's culture, what it takes to be an effective PM, and creating an environment where Risers can talk about the challenges. I want to challenge Jenn to take this even further and lean into the DL position as an opportunity to further that trust with Risers by being mindful of their desire for self-validation, and encouraging them to run towards the things they are avoiding.\n- Has always stepped up when we needed her support on accounts.\n- Quickly synthesizes root causes and identifies contributing factors that need to be systematically addressed.\n- I absolutely trust Jennifer to get the job done\n- Communicates clear, and concise, feedback for any Riser, at any level, with precision\n- When Jennifer volunteered to support the STRATFI Bi-frost engagement, she didn't just demonstrate leadership impact by fulfilling the PM role and responsibilities, she successfully coached and mentored the team of engineers to be self-sufficient so that transitioning to a new PM wouldn't be jarring for the team or customer.\n\n**Riya Patel:**\nJen has been an amazing addition to Rise8 this year. I'm really looking forward to having her as Delivery Lead for several Space Force accounts and have been equally impressed with her stepping in as interim Product Manager on the STRATFI account.\n\n**Dan Sanker:**\nJennifer recently transitioned off the program to accept a well-deserved promotion to Delivery Lead. During her time with our team, she consistently demonstrated exceptional focus and organization.\nHer ability to take a broad, complex range of stories and organize them into a clear execution plan was instrumental to our success. Specifically, her leadership allowed us to deliver a critical capability demonstration within the first 90 days of the program—a massive achievement that speaks to her drive and clarity.\n\n**Clark Pain:**\nI've loved working with Jennifer and would jump at the chance to work with her again in a heartbeat.\n\n**Kenny Slater:**\nThere is a reason I ranked Jennifer so high. Jennifer takes a problem, digests it, repeats it in a manner that is easily understandable, and works like hell to fix it. Jennifer is a great Product Manager and when I found out she was the deputy product manager, that made total sense to me. Sad we lost her as a teammate but happy to see her position grow.\n",
  "start_stop_keep": "**Rob Monroe:**\n**Start**\n- Candidly coach Risers on prioritizing both Grit and Do what is required behaviors\n- Embracing AI more and more into your daily workflows\n**Stop**\n- None at this time\n**Keep**\n- Being a context synthesis ninja\n- Building trusting relationships with Risers\n- Voicing challenges and solutions for challenges\n\n**Riya Patel:**\nStart/Stop: I'm not quite sure what I would recommend Jen start and stop doing because we're operating in a fairly new construct. I hope Jen continues to bring discipline and focus on improving delivery and helping our team proactively work to remove blockers. She's already been a great partner in helping me do just that. I hope she can also point out opportunities to be more efficient in how we work or communicate as a team.\n\n**Dan Sanker:**\nStart:\n- Since you have transitioned to your new role, I don't have specific new actions for you to start on our team. \nStop:\n- N/A - Your performance while on the team was exemplary.\nKeep:\n- Keep demonstrating that fantastic professionalism. It sets a standard for everyone around you.\n- Keep leveraging your exceptional communication skills. Your ability to create clarity out of chaos was a huge asset to us, and it will be even more critical in your new Delivery Lead role\n\n**Clark Pain:**\nKeep engaging with empathy, supporting those around you, looking for creative ways to solve problems, and spreading your positive attitude. I think for next year, we should have you engage directly with customers/stakeholders more often. Your expertise, soft skills, and experience would be huge assets for the projects, and I think our customers/stakeholders would really enjoy working with you.\n\n**Kenny Slater:**\nI do not have a Start or Stop feedback, my only feedback for this question would be the \"Keep Doing.\" Keep working hard and crushing it. You're very easy to work with and I hated to see you go.\n",
  "generation_timestamp": "2025-12-04 17:33:27"
}