{
  "employee_name": "Jesse Wilkins",
  "accomplishments": "- FORGE Kickoff - When I first joined Rise8 and the FORGE project I was temporarily allocated to the portfolio team. During this time I began discovery and defining the scope of work at hand. I heavily contributed to the successful planning and execution of an on site kickoff with FORGE stakeholders which was the beginning of building trust and showing who Rise8 is and how we show up. I also facilitated workshops around stakeholder mapping and goals. All of this set a solid foundation for the FORGE program.\n- Launched FORGE Enablement team - crafted vision, mission, strategy, and roadmap for Enablement which by nature is an ambiguous product space. Facilitated workshop with team around Enablement identity and gained alignment on this. Defined the outcomes our team wants to impact and ensured they align with portfolio level priorities. Fostered a culture of feedback and psychological safety by facilitating workshops and advocating for feedback being delivered early and often. All of this work is setting the FORGE Enablement team up for success to enable tenant teams onto the FORGE P2P to ship outcomes in prod to warfighters.\n- Derisked FORGE P2P - Defined work to build a NOVA mock application that is helping us greatly reduce risk and learn for when we onboard the first application to the FORGE P2P. Drove an additional light weight application through the onboarding and deployment process to get more reps in and better understand gaps and pain points. Worked with NOVA to understand their current tech stack, what lean slice of their application we can deliver to users first to drive a meaningful outcome in prod and continue to help them derisk onboarding onto the FORGE P2P by testing in their internal environment. Synthesized feedback from experience onboarding and deploying to our internal environment and provided this feedback to delivery teams so that we learn and improve. All of this work is derisking the FORGE P2P which will ultimately lead to outcomes in prod for warfighters.",
  "enps_comments": "**Drew McFarland:**\nJesse brings valuable strategic thinking to the team. He's always surfacing risks and alternative perspectives the team hasn't considered, and he's good at making sure our work maps to real outcomes. He's not afraid to question things that don't make sense. He's also extremely personable and great at leading stakeholder conversation. Just a pleasant person to work with.\n\n**Pooja Jhaveri:**\nI would enthusiastically rehire Jesse. He is a high-level contributor who consistently delivers on his commitments. He represents and advocates for our team, articulates our mission well, and understands the value we provide to our clients. He helps steer the team in the right direction based on priority and is pragmatic and results driven. He effectively navigates the unique landscape of our engagement (which does not align with traditional software development) demonstrating the resilience expected of a strong performer. It's a pleasure working with Jesse!\n\n**David Alvarado:**\nJesse has been great as the PM.  I have worked with Jesse in the past and was happy when I found out I was going to be joining his team.  He has an eye for detail and he's good at asking questions to tease out information from context that is assumed all other teammates have.  He handles client interactions well and is the consummate team player.\n\n**Jacobi Ayala:**\nI like working with Jesse but I feel as a non-anchor that I haven't worked closely with him enough to give a solid \"Agree\". I do know that he is doing the work and fighting battles for us which is much appreciated and expected so I feel he is a positive contribution to the team.\n\n**Joshua Pritchett:**\nJesse consistently operates above his role level, acting as a true \"force multiplier\" for the portfolio. During a critical leadership gap, he stepped up as the interim Portfolio Lead, not just keeping the lights on, but actively shaping the value stream and stabilizing the team. Beyond his own execution, he demonstrated exceptional stewardship by upskilling peers and ensuring a smooth ramp-up for the incoming Portfolio Lead through hands-on coaching. Jesse is the rare practitioner who balances delivery with enablement, ensuring his team’s work drives impact far beyond their immediate scope.\n\n**David Croney:**\nI've seen Jesse consistently step up to ask the bold questions and take the bold actions that are needed in order to deliver the best outcomes for the client and end user. He has an advanced PM skillset and uses this to ensure his team is tracking the right outcomes, goals and is validating assumptions and risks in order to get to those goals. One area for improvement is in expanding his focus beyond those end users for his product in order to make sure the team is contributing to the bigger picture for the portfolio.\n\n**Jennifer Van Hove:**\nJesse has been an integral member of the FORGE team since the beginning, leading his team with clarity and collaborating effectively with the other teams in the portfolio.  He was one of the first teams to articulate a solid value stream, which provided an effective model for other teams to imitate and baseline the practice model from.\n",
  "start_stop_keep": "**Drew McFarland:**\n**START:** Tightening up the admin side of PM work. Things like making sure tickets have the context they need and meetings have clear purposes. Just the operational hygiene that keeps everything running smoothly.\n\n\n\n\n**STOP:** Letting the administrative stuff slide. I know it's not the fun part of the job, but when tickets are unclear or meetings drift, it creates friction for everyone else trying to stay aligned.\n\n\n\n\n**CONTINUE:** Challenging us to think about problems from different angles and bringing up risks or other consiferations. You're really good at questioning things that don't make sense even when no one else in the room will, and you're great at connecting what we're doing to actual outcomes. Also keep being the person who's quick on your feet and great at leading customer and stakeholder conversations. You're very charismatic and make those interactions way easier than they could be.\n\n**Pooja Jhaveri:**\nPlease keep demonstrating the solid stakeholder communication, team advocacy, and support that you currently provide. Your dedication to giving strong demos and ensuring our team's mission is clearly understood by leadership is a strength that contributes to healthy customer and account-wide relationships. To facilitate your continued growth, I would recommend you start focusing on two key areas. First, you can help proactively build stronger bridges between our team and the different FORGE teams. This cross-team alignment will increase our shared context of the wider ecosystem and better position us to offer timely support, fostering better collaboration. Second, to maximize our team’s execution, please start incorporating more detailed context, requirements, and predicted impact when crafting stories; this will improve the team's understanding of the \"why\" and enable us to produce higher-quality, impactful outcomes in production.\n\n**David Alvarado:**\nYou're doing well man, keep it up\n\n**Jacobi Ayala:**\nI don't have a good start recommendation.\n\n\n\n\nStop letting other teams get in the way of us contributing. I feel that from a pm standpoint there is a tendency to wait for another team to be able to have a meeting with us. Something could be resolved with a short conversation via dm or quick huddle/meet rather than scheduling a block a few days out. This has been less of a tendency as of late so I think he is already improving on this.\n\n\n\n\nKeep encouraging more cross team collaboration. It has had positive effects on morale and contributions.\n\n**Joshua Pritchett:**\n- **Start** actively shaping the strategic direction with external stakeholders. You are successfully leading high-level meetings; the next step is to leverage your understanding of the portfolio's goals to co-create the path forward. Start moving beyond just facilitating the conversation to proactively influencing the stakeholder's vision, ensuring that the direction we agree upon is not just \"received\" but actively molded by the portfolio's strategy.\n- **Start** scaling your competencies to other team members. You have shown you can run strategic meetings effectively. To maximize your impact, start creating a playbook or framework for these interactions so other individual contributors can learn to lead client discussions with the same level of strategic depth. This moves you from \"doing it yourself\" to \"enabling the practice\" across the organization.\n- **Consider** the difference between \"taking up space\" and \"adding value.\" You have excellent questions that cut through ambiguity, but by keeping them to yourself (or waiting for a smaller setting), you are missing the opportunity to demonstrate true thought partnership. Your insights are often the \"unlock\" the room needs, so trust your instincts and bring that value to the conversation in real-time.\n- **Keep** demonstrating the confidence to lead strategic conversations as an individual contributor. It is rare for an IC to effectively facilitate external stakeholders on strategic intent. Your ability to command the room and drive outcomes in these settings is a differentiator, continue to lean into this leadership regardless of your title.\n- **Keep** acting as a \"Force Multiplier\" by upskilling peers. Your work to enable teammates and support incoming leadership ensures the portfolio is resilient. Continue to measure your success not just by your individual output, but by how much better the team operates because of your mentorship.\n\n**David Croney:**\nStart: Connecting your team goals earlier to the higher level engagement/portfolio goals. Proactively seek out how your team can be contributing to the portfolio level goals and what you can do to support other teams. Other PMs could benefit from your experience and even stepping in to assist them/course correct where necessary.\nKeep: Seeking understanding by asking bold questions and keep a bias for quick action and decision making\nStop: After getting a better understanding with your questions/research etc, be willing to move forward with imperfect data and information.\n\n**Jennifer Van Hove:**\nStart: Sharing out more widely within Rise8.  I've asked you for a couple assets when I know you have them, but my guess is that you are defining and building something new and others around Rise8 could benefit from a better understanding of your process.  \n\n\n\n\nContinue: Asking good questions, supporting your CSM, leading and advocating for your team within the Forge portfolio\n",
  "generation_timestamp": "2025-12-04 17:27:20"
}