{
  "employee_name": "Joshua Pritchett",
  "accomplishments": "- Drove Large-Scale Change by Resolving a Portfolio-Wide Blocker: I distilled complex project issues involving six teams that had blocked progress for my eight-team portfolio for over six months. I worked with the teams to concisely articulate and visualize these dependencies for government and external leadership, connecting the blockers to what we clearly needed from support. Resolving this is enabling all eight teams to deliver on our < 180-day 'outcome in prod' brand promise, reducing the potential time to achieve this goal by 30%.\n- Established a Portfolio-Wide Vision to Drive Mission Metrics: I identified that my eight-team portfolio was unsure how their work connected to the client's 'Mission Metrics That Matter' (MMTM). I established a clear vision, strategy, and initial outcomes, scaling this new direction across all 40 practitioners. This has significantly improved project clarity, ensuring all eight teams are now aligned and focused on improving the client's MMTM.\n- Scaled Portfolio Performance by Proactively Building Talent: I identified and addressed critical skill gaps across my portfolio by directly coaching and upskilling 6 PMs. I also grew non-traditional PMs by successfully upskilling a designer and a cybersecurity SME on PM skills and placing them in key roles. This strategic talent development, combined with hiring 5 new personnel and actively managing performance expectations for 5 others, was a key driver for my portfolio, improving and accelerating its delivery of successful mission outcomes.",
  "enps_comments": "**Steven Bair:**\nJosh is, without exaggeration, one of the best product leaders I have ever worked with. Joining the program mid-stream in August—amidst leadership changes and a mountain of existing documentation—he demonstrated incredible learning velocity. He didn't just read the documentation; he comprehended it and immediately started asking the right questions (we had our first 1:1 within his first few days).\nJosh was exactly the stabilizing force the FORGE program needed. He embodies Be Bold by being confident yet openly humble—willing to ask the hard questions that turned rough waters into a culture of elevated trust. He quickly identified gaps in our execution and implemented a new vision and strategy and a consistent project plan, aligning all PMs to a shared definition of success. By establishing the bi-weekly demo, he shifted the conversation from \"saying\" to \"showing,\" proving that we value outcomes above all else.\n\n**Jesse Wilkins:**\nI would rehire Josh for his current role. I have been very impressed with Josh’s leadership and find that I look up to him as a leader. I am impressed with his ability to work through ambiguity and drive action that pushes the portfolio forward. He quickly brought alignment, clarity and confidence in the work we are doing on FORGE all while learning a complex domain.\n\n**Ann Kung:**\nJosh's leadership and strategic intent taking over the portfolio have been instrumental in focusing the team's efforts, especially in the face of constant changes to the customer & portfolio and timeline delays. He swiftly addressed the ambiguity of the program's prior state, refocusing teams on core deliverables and establishing a new project plan to bring alignment to the portfolio. By implementing client demos, he both surfaced the value of what the portfolio was building effectively and allowed for individual contributors to get a better sense of the customer, a gap the team had identified.\n\n**Max Reele:**\nYou are incredibly strong in your technical ability, task orientation, and passion for doing things correctly. You are also steadily growing in your leadership ability and at fostering a culture of teamwork.\n\n**Nick Weiss:**\nJosh brought an incredible and welcome level of structure, strategy, and clarity to what was a remarkably big challenge. He did a heck of a job organizing efforts and communication across the portfolio, turning chaos into a clear path forward. His willingness to collaborate and his concise, solutions-oriented feedback make him an outstanding partner, and I would absolutely want him on my team for any future project.\n",
  "start_stop_keep": "**Steven Bair:**\n- Keep facilitating conversations with that unique balance of commanding the room while ensuring every voice is heard. You are actively creating an idea meritocracy, ensuring we get the best ideas on the table before we decide and commit.\n- Keep \"min/maxing\" (your words) your time and ruthlessly prioritizing. Your ability to pivot as priorities change is uncanny. I have learned a great deal just by watching how you delegate and prioritize; please continue to model this behavior for all of the FORGE teams.\n- Keep making the hard choices. Your willingness to identify lack of continuity and drive action to fix it is exactly what's required to ensure the program's success. It is a pleasure working with you to build this team.\n\n**Jesse Wilkins:**\n- Start: showing more empathy to others especially in public forums and giving folks grace when they might not have the answer right away.\n- Keep: Narrating a compelling story for FORGE and defining vision, mission, goals, and strategy. Aligning all the portfolio teams to common goals. Being an overall badass and someone that I admire and look up to.\n\n**Ann Kung:**\n- Continue driving clarity and unity: Your emphasis on formalizing the new project plan, cleaning up the GitHub backlog, and centralizing risk/assumption tracking is vital for overcoming the program's initial disjointedness & ambiguity. This is essential for moving the project towards and keeping alignment.\n- Continue giving feedback to your team, especially at an individual level. Your insight and encouragement to the team especially after client interactions is noted & helps motivate and reframe the sentiments productively. Individual feedback, though time-consuming, helps grow the capabilities of the program as a whole.\n\n**Max Reele:**\nStart: Prioritize all of the work-steams that you currently operate within, identifying areas that can be delegated elsewhere or cut out completely, making room for deeper focus on the higher priorities. Be more organized for team meetings, setting established targets for the meeting and keeping to strict time boxes.\n\n\n\n\nStop: Relying on published policy or guidance as a motivator for Riser/team performance. At times, I've heard you reference templates, guidance, checklists, Slack posts with the expectation that Risers are adequately informed. When signals are there that Risers aren't following that guidance, we need to seek out other ways of communicating the expectation or making compliance an easier path for them.\n\n\n\n\nKeep: Objectively telling us all how performance is going. You're exceptional at this. Working hard at giving assertive feedback to members in the portfolio.\n\n**Nick Weiss:**\nPlease **continue** to be that essential voice for structure, strategy, and clarity. Your ability to organize our efforts and streamline communication across the portfolio has been indispensable. I especially value your willingness to pair with others to help them skill up, as well as your concise, direct feedback about your needs and what's not working. That candor is exactly what we need to find solutions and fix problems efficiently. You are already a master at bringing order to complex situations. Please continue to create durable systems that allow *others* to maintain that order. When you identify a problem, consider \"what process or template could I create so this doesn't happen again?\" By embedding your strategic thinking into our team's regular operations, you can scale your impact even further and help elevate everyone's organizational skills.\n",
  "generation_timestamp": "2025-12-04 17:26:03"
}