{
  "employee_name": "Luke Strebel",
  "accomplishments": "1. With the chaos of contract transitions on LHDI and Gov Shutdowns, the trust from our stakeholders (Dave/Andrew) that SecRel is delivering value and is stable is something I am really proud to have maintained and grown. This can be seen by us being the only team to get exceptions to delivery moratoriums, consistent asks for help outside our core domain because we have the skills and grit to get it done, and the recommendation to move me from just the SecRel PM to a crew lead position. I also appreciated Brent sharing feedback which shows how me and the team are perceived by our LHDI peers: \"Luke (and Stefan) have been a couple of my 'I want to be like that person when I grow up' models while I've been around this place.\"\n2. SecRel has released a few big updates this year - Runtime Monitoring, new SAST provider, new SDE automations - which have all contributed to making LHDI more secure. Tenants confidence increases by 30% when going through our process and when working with PMs across the teams to get outcomes, feedback is always that \"SecRel just works, and it does what we need it to do\". We have successfully transitioned in a new AO who, when getting the LHDI overview, said that \"It's my opinion that nothing here needs to change\".\n3. On the Rise8 side, I have been happy to help Rise8 win the Torque contract and assist folks to onboard to that space which I have a decent amount of domain background. I appreciate the trust Rise8 has put in me to be a representative of the company. From speaking at Prodacity, Slack summit, AFCEA International, SPRUCE contract bids - I feel like I have represented the company well and grown my practitioner status into thought leader. This is further shown as true as being consistently pointed as one for the best PMs in Rise8, evidenced by Rob recommending I am one of the few which Bryon should meet with for unstructured 1on1 time.",
  "enps_comments": "**Jeremy Arzuaga:**\nLuke is one of the best PMs I've worked with. He cares about the mission and making an impact. He's easy to approach and works well with others.\n\n**Scott Carlson:**\nLuke is by far the best product manager I’ve worked with in my career. He has a perfect mix of charisma, self-awareness, technical prowess, and leadership skills that makes him excel at this job. Anyone would be crazy or would have had some deep family feud against him in order to NOT hire him. While being good friends with people on the team, he never shies away to give hard feedback or call out team members for improvement.\n\n**Branden Van Derbur:**\nLuke is without a doubt the best PM I've had in my career so far.\n\n**Sally Yoo:**\nI would enthusiastically rehire Luke. He is an exceptionally strong performer who is on top of it and consistently delivers excellent work that the team wants to be a part of. He is a great example to teammates, and his habit of taking the time to deeply understand the domain shows his commitment. While he's doing a lot of excellent work, I hope he gets opportunities outside of the VA domain where he can continue to deliver game changing impact.\n\n**Derek Dombek:**\nLuke is an absolute powerhouse! Not only is he incredibly knowledgeable about literally everything thats going on, probably one of the most technical PMs I've ever gotten to work with in my career so far, you can tell he wants nothing but the best for the mission we're on but he's also wildly kind during everything he's got going on and he's amazing at listening to a question immediately able to process and understand it to answer clearly and accurately. This personally helps a tun for me with being a new comer to the team and Im sure that goes for so many others.\n\n**Dylan Doub:**\nLuke brings great energy and knowledge to this team that helps drive and motivate the rest of us.\n\n**John Zubiri:**\nLuke is a great PM. He is always focused on doing the right thing while creating outcomes and impact for the customer. He is aligned with both the company and contract's mission. As a PM he does a great job generating our road map, splitting up tracks of work, identifying priorities for the backlog, and supporting various external tenant-facing things. I think he demonstrates Rise8 values really well. Courageous, speaks his mind, considers all risks/possibilities, thoughtful, very collaborative teammate and inspiring leader\n\n**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\nLuke is by far the best PM that I have worked with. In our time this last year working on ATTV, he has truly been helpful and exemplifies what we would like to have a Riser. He is fun to work with, helpful in all areas, not just product, encourages, challenges, and pushes his team to do great things. I would absolutely want to rehire him if he left and came back to Rise8.\n",
  "start_stop_keep": "**Jeremy Arzuaga:**\nStart\n- Would love to see you take over as portfolio product lead at LH.  \nStop\n- This is more a tread carefully on taking on too many responsibilities. You are doing what's required for sure. Example: managing transition to rev5 and SNOW\nContinue\n- Driving the team toward outcomes\n- Using data to drive decisions\n- Being curious about how we can improve security of LHDI and a better experience for the users\n\n**Scott Carlson:**\nLuke is pretty great as-is, so keep ALL that up. \n\n\n\n\nWith losing his design pair, Luke will need another person (or maybe AI) to challenge assertions with. Working with the anchor more often on this is one solution but another idea is to involve the interrupt more to get different ideas and to give team members opportunities to grow into better planners and decision-makers. I would love to see our team share more of the responsibility to drive outcomes than it solely rest on Luke's shoulders.\n\n\n\n\nWhile Luke is kind with the feedback he gives, he could sometimes remember the human more when team members run into difficult life circumstances.\n\n\n\n\nIt'd be great if we could somehow improve/fix how the team uses Jira. Some of it seems a bit chaotic and it’s not always easy to see the priority of items in the backlog as a team member. There are a ton of filters on the main Kanban page that may or may not be used and there are swim lanes that probably aren’t monitored well by the team. This might be caused by lost processes, VA implementation choices, or lack of effort from team members, so feel free to push back on this critique. While we have a high-performing team, a cleaner kanban (the ‘Kan’ in kanban 看板 literally means ‘to look’) that is seen more often could empower team autonomy by showing what matters for driving outcomes and current bets.\n\n**Branden Van Derbur:**\nStart:\n- Identifying opportunities in domain meetings (IPM, roadmap, etc) to draw participation out for newer members on the team such as \"You recently worked on this ticket which is related, do you have any thoughts on this?\"\nStop:\n- No Notes\nKeep:\n- Bringing a great attitude to the team\n- Being a PM that the team can rely on to challenge ideas and encourage viewing the domain from a wider lens\n- Fostering a growth environment for everyone\n- Being a reliable teammate that shows up ready to rock and roll every single time\n\n**Sally Yoo:**\n**Keep Doing:**\n- Keep up with your deep understanding of the \"technical\" aspects of the domain. It's an invaluable asset to the team, the contract, and to Rise8 as a whole.\n- Continue to run collaborative and effective sessions (like the Team Norming exercise and Roadmapping meetings) where you ensured everyone got an opportunity to engage in the discussion.\n- Continue to do a lot of excellent work that draws people in. You have incredible work ethic that is inspirational to everyone you encounter.\n- Keep making efforts to document team learnings (i.e. WikAI). The team recognizes the need for documentation and encouraging participation will go a long way to distribute the workload.\n\n\n\n\n**Start Doing:**\n- Start timeboxing \"Collab Time\" to pair with devs to \"bounce ideas\" off of. \n- Start leaning on the devs/dev anchor (as availability allows) to help you with user research or make design decisions. Don't do it all alone!\n\n**Derek Dombek:**\nStart: I've noticed you already do this pretty often but within conversation about systems, being cognizant to describe, or define as much as possible about each detail(for example domain specific system names, acronyms, etc.) can go a long way for my personal learnings and I'm sure thats the same for others as well.\n\n\n\n\nStop: I really need some more time getting to work with you but with how much complexity our domain has, I think sometimes the worst thing we can do sometimes is add more to it. For all of us I think its a good habit to take steps back to recalibrate our thoughts for finding those more simplistic and effective approaches, which I've already noticed you doing a tun in some of our recent meetings.\n\n\n\n\nKeep: Never stop adding your input! I find everything you discuss and add to the team super valuable. You're vision is very much customer focused and doing what it takes to get it done and I really respect that.\n\n**Dylan Doub:**\nLuke should keep being a charismatic leader for the team while providing useful and actionable feedback.\n\n**John Zubiri:**\nKeep: Being a technical-oriented PM. Appreciate you being alongside engineers most of the time.\nKeep: Setting direction and strategy for the team, supporting the mission\n\n**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\n**Keep**\n- being bold, honest, candid, caring, and helpful\n- your eagerness to deliver is wonderful and I absolutely love working with you!!\n- pushing the team towards a goal, helping them understand what the needs are\n\n\n\n\n**Stop**\n- Waiting so long to deliver the candid, challenging feedback. I think there were a few times where you could have been more bold and challenged the people we were working with on ATTV to call it quits, or to push them towards delivery\n\n\n\n\n**Start**\n- My context is mainly ATTV, so I don't have anything that I would recommend that you start doing as the work you have put in and provided to ATTV has been amazing!\n- If anything, it would be pair with me in involving leadership more in our decisions and helping them understand the challenges we are facing with the limited amount of people/resources we have available. Work with those constraints and see what we can figure out!\n",
  "generation_timestamp": "2025-12-04 17:26:35"
}