{
  "employee_name": "Michael Estoy",
  "accomplishments": "1. **Received the 2025 Rise8 Encourager Award for creating the foundation of psychological safety to enable team performance**: I received the 2025 Rise8 Encourager Award \"for creating the confidence to learn, grow, and try again...making others feel safe to stumble, speak up, and stretch beyond their comfort zones.\" This recognition validated a sustained pattern of behavior throughout the year, evidenced by teammate kudos: \"Mike for being the hype for the team always,\" \"keeping the team together despite life and work tasks piling up,\" \"always standing behind the team,\" \"eagerly taking on the challenges of becoming a Technical PM,\" and \"always knowing the right questions to ask to bring important conversations to the forefront.\"\n   1. **Impact on Rise8's mission:** This accomplishment addresses Rise8's Q4 delivery issue: \"Risers are not giving direct, quality, and timely feedback to one another leading to poor team health and low delivery performance.\" By creating psychological safety, I enabled the team to tackle the other two accomplishments below. The team may not have adopted AI experimentation or participated in Blameless Postmortems without the foundational trust that it's safe to fail, learn, and try new approaches. This also supports Rise8's people metric of \"A-Players on an A-Team (>85%)\" because A-players need psychological safety to do their best work. The award demonstrates company-wide impact beyond just my delivery team, showing that my approach influenced Rise8's culture at scale. \n2. **Nudged team AI adoption from passive tools to active collaboration**: I shifted the team's approach to AI from passive consumption to active collaboration through prompt and context engineering techniques. While the team initially ignored AI experimentation, I demonstrated how to achieve workable drafts faster than human speed by shaping AI output through different techniques. My dedication to providing abundant evidence and teaching different methods led engineers to conduct their own experiments. Teammate kudos recognized this: \"Michael is a phenomenal PM, and great AI coach.\n   1. **Impact on Rise8's mission:** Teammates use AI regularly and report exposure to broader solutions, new ways of solving problems, and an improved toolset. This addresses Rise8's Q4 risk of \"limited utilization of AI to enable project teams, leading to low upskilling on skills needed to remain competitive.\" By modeling curiosity-driven experimental practices and framing AI errors as standard iterative friction rather than failure, I removed the fear of adoption. The team now treats AI as a junior pair-programmer, which accelerates our ability to continuously deliver valuable software. This was possible because of the psychological safety foundation the team needed to feel safe experimenting and failing with new tools. \n3. **Established Blameless Postmortem process and vertically sliced the backlog to enable outcome-focused delivery**: During the first pipeline outage that happened with limited staffing, I led the resolution communication effort and introduced the team's first-ever Blameless Postmortem process. Rather than the typical incident review focused on blame, I facilitated a retrospective that examined systems and processes, not people, based in fact. Also, I vertically sliced the backlog with granular precision to change how the team approaches delivery from fragments to complete, testable features. Teammate kudos captured this work: \"doing a ton of work to align our backlog to vertical slices aligning with Portfolio Roadmap\" and \"aligning our dependencies for IL5 with platforms work.\"\n   1. **Blameless Postmortem impact on Rise8's mission:** The Blameless Postmortem shifted how the team handles failure. Teammates feel safe to surface risks early and inform the team about issues. We identified multiple improvements, such as pipeline health dashboards and bug reporting processes, that are now in our backlog. The team participated in an event that could have destroyed trust, and instead it strengthened our resilience. \n   2. **Backlog vertical slicing impact on Rise8's mission**: The vertical slicing work grounds the team in user behavior changes that lead to mission outcomes, which supports Rise8's guidepost of \"continuous delivery of valuable software that users love.\" By sequencing dependencies against client priorities, I de-risked the path to production and positioned the team to accelerate delivery timelines for mission-critical capabilities. This addresses Rise8's Q4 company-wide issue of lacking \"a clear, data-driven understanding of how daily work connects to strategic outcomes internally and externally.\" Both initiatives were enabled by the psychological safety foundation from Accomplishment 1.",
  "enps_comments": "**Schuyler Reinken:**\nMichael is a super nice guy, and brings a great energy to the team. However, his skills in understanding the product, identifying risks, organizing our team's backlog, and developing a system through which we can plan and succeed leave much to be desired. I needed to create the backlog myself while Michael was out sick after 3+ months of not having one, and Michael's dependence on AI consistently produces sub-par tickets that the team cannot understand, and makes tracking progress and planning for the future difficult. \n\n\n\n\nI would highly recommend Michael read a book like XP Explained and take to heart terms like Ubiquitous language, and begin a process of developing strong beliefs for how to understand the product and plan for the future in a sustainable way. Michael is not yet an A player, but he may become one someday.\n\n**Ashley Pearce:**\nMichael is an absolute shining star. He cares so deeply about the mission, the people on his team, and the overall vision of the tasks they're completing. I've never worked with a PM who made my job so easy. He truly values every member of the team both personally and professionally and that alone makes him an A Player in my book.\n\n**Andrew Knife:**\nMichael is an exceptionally supportive and encouraging leader who creates a positive, growth-oriented team environment. His leadership style focuses on developing team members, pushing them out of their comfort zones in supportive ways, and maintaining team cohesion through both routine operations and difficult moments.\n\n**Chris Brodowski:**\nIt was a pleasure to serve with Michael over this past year.  He has always put our team first and done everything he can to set us up for success.  He was emotionally invested not just in our team and project outcomes, but also in ourselves and our personal growth.  I have never worked with a Product Manager that believed in me, and in all of us, more than him.  \n\n\n\n\nHe will very much be missed.\n\n**Joshua Pritchett:**\nMichael demonstrates a consistent and valuable willingness to jump in and initiate work. However, to truly excel in their role, the focus needs to shift from \"starting tasks\" to \"driving them to independent completion.\" By building deeper domain context and auditing work for clarity before sharing it, they can close the gap between their high effort and the team's need for high-quality, standalone deliverables.\n",
  "start_stop_keep": "**Schuyler Reinken:**\n- Keep: Facilitation Skills. Michael is a good facilitator. This is a useful skill to keep.\n- Start: Taking initiative. Michael needs to stop waiting to be told what to do and instead build a cohesive framework of his own for how to communicate, plan, and organize, and document a project. Then this framework can evolve with exposure to feedback.\n- Keep: positive energy! We love it\n- Stop: Using AI. AI is a useful tool for someone who can properly evaluate its output. Michael does not have the skills necessary to do this yet. He needs to develop a higher sense of what makes a good plan, understandable and testable acceptance criteria, and personas and value streams. He should spend a good year AVOIDING AI in order to test his own knowledge and skills before returning to it.\n- Start: Taking ownership. Michael has a tendency to avoid taking ownership of his output. He would say things, like \"no, this is the team's backlog, not mine\" when I believe that a good PM takes ownership of the systems they put in place, and believe strongly in them, rather than doubting and abandoning an approach at the first sign of resistance, creating unclear standards and processes.\n\n**Ashley Pearce:**\nContinue being YOU! You make Rise8 a better place, and I have been so incredibly lucky to have worked with you.\n\n**Andrew Knife:**\nKEEP DOING:\n✓ Supportive and encouraging leadership style - your positivity and belief in team members enables their growth\n✓ Pushing team members to grow through public speaking opportunities - this develops crucial skills and visibility\n✓ Transparency with team during difficult moments - your honesty builds trust and resilience\n✓ Focus on unified narrative and team representation - this ensures FORGE gets appropriate recognition\n✓ Daily rituals that build team cohesion - stand-ups with questions of the day create connections\n✓ Advocating for your team's needs and contributions\n\n\n\n\nSTART DOING:\n→ Soliciting more input on stand-up format and questions - collaborative norm-setting strengthens team ownership\n→ Documenting team growth and showcasing achievements more systematically - capture the impact you're creating\n→ Creating more opportunities for team recognition - highlight individual contributions in broader forums\n→ Establishing regular retrospectives or feedback loops on team processes\n→ Sharing your leadership approach with other PMs - your style is worth scaling\n\n\n\n\nSTOP DOING:\n✗ Holding back your thoughts. There are times where it seems that the team is singularly focused, and because of that you hesitate to interject and disrupt the team flow, even if it would have a positive impact.\n\n**Chris Brodowski:**\nKeep: Leading by example and being himself.  \nStart: Keeping in touch with us whenever his next assignment is upon him, and don't hesitant to ask early an often if your strategies align with contract objectives. \nStop: Not sure.\n\n**Joshua Pritchett:**\n- **Start** prioritizing \"self-enablement\" to build deeper domain context. Currently, there is an opportunity to move from reacting to instructions to proactively shaping the path. Start independently researching the domain and digging into the data to understand the \"why\" behind the product. This will empower you to create clear roadmaps and recommendations driven by your own insights, reducing the need for external direction.\n- **Start** owning the \"Definition of Done\" for your deliverables. Aim to make every artifact clear enough that a stranger could understand it without explanation. Start auditing your own stories and roadmaps for simplicity and completeness before sharing them. If expectations are unclear, taking the initiative to clarify them before building will ensure the final output is polished and minimizes back-and-forth.\n- **Consider** that the greatest value comes from \"completion\" rather than just \"initiation.\" While the willingness to pick up tasks is excellent, credibility is built by consistently delivering work that is fully \"owned\" and requires minimal revision. Focusing on the finish line and ensuring work is complete and accurate will significantly increase your impact and the team's efficiency.\n- **Consider** how precision in language acts as an accelerator for the team. When stories or terms are ambiguous, it creates natural pauses for clarification. As a PM, ensuring that every communication is simple, accessible, and grounded in a clear \"why\" is a key way to remove friction and enable the team to move faster.\n- **Keep** showing the initiative to pick up work. Your willingness to step in and try to move things forward is recognized and appreciated. That proactive mindset is the right foundation; applying that same energy to the quality and autonomy of the output will take you to the next level.\n- **Keep** engaging with the process. Your visibility and willingness to try new tasks are great assets. Continue applying that energy toward mastering the domain context so you can execute with greater precision and confidence.\n",
  "generation_timestamp": "2025-12-04 17:26:29"
}