{
  "employee_name": "Nick Weiss",
  "accomplishments": "1. **Spearheaded Platform Team Alignment for IL5 Readiness:** I took ownership of aligning the Platform team around a comprehensive and clear plan for achieving IL5 production readiness, namely in the great detail I've put into our Epic 6 Foundational Cluster build plan. This strategic plan will be critical for successfully onboarding the Nova team and serves as our roadmap to demonstrate tangible platform value ahead of contract renewal. This work also acted as a catalyst across the portfolio, as it identified and highlighted key dependencies that will unblock numerous other teams, enabling them to plan their own work effectively by identifying the minimum critical path we need to take to accelerate our delivery timeline.\n2. **Rapid Upskilling in Platform Engineering:** I've achieved a significant and rapid upskilling in platform engineering, learning the complex requirements of IL5/IL6 environments, their components, and their service dependencies. Coming from an application development background, this new knowledge has allowed me to more accurately identify dependencies, facilitate credible technical discussions with engineers, and serve as a more effective advocate and translator for our team's work to clients and stakeholders.\n3. **Maintained Team Velocity by Mitigating Critical Blockers:** Despite major setbacks in gaining access to DAF Cloudworks, I ensured the team was able to make meaningful and continuous progress toward our goals. By proactively facilitating complex conversations across our team, other portfolio teams, and the client, I helped us pivot to a high-value workaround: building a mock air-gapped environment. This initiative keeps the team fully engaged on important work and, crucially, will significantly accelerate our delivery timeline once the formal access is unblocked.",
  "enps_comments": "**Asare Nkansah:**\nWorking with Nick has been a breath of fresh air in many ways, especially compared to my past experiences with PMs. I truly appreciate his tenacity and craftiness in working through the necessary steps to help us achieve our goals.\nIt's clear that platform engineering is new territory for him, and I've been genuinely impressed and proud of how quickly he's worked to learn complex concepts. This project is a massive challenge, and while he has struggled to keep up at times, his commitment to gaining ground is commendable. As an engineer, I appreciate that he makes processes lean where he can. My hope is that as he continues to grow his technical knowledge, he will be able to take on more of the planning process independently, reducing the oversight needed from the engineering team.\nOn a personal level, he's a really good friend. I appreciate our conversations and feel safe talking to him about my frustrations and those of the team, which is an invaluable quality in a PM.\n\n**Brandon Shouse:**\nGreat work getting up to speed on Platform fairly quickly, having not done Platform in the past, and helping to keep us organized and taking the portfolio requests on.\n\n**Jake Cook:**\nNick has been excellent at leading team meetings and driving down blockers and coordinating needs. While having limited interactions beyond standups and initial planning meetings, it is clear he manifests strong A-player *leadership* roles specifically that are crucial for the team.\n\n**Kevin Gates:**\nBefore I took over the Tiger team, Nick and I collaborated on several initiative (service blue print, metrics, project roadmaps) and he was always great to work with.\n\n**David Croney:**\nNick has a solid PM skillset and brings a much needed product focus to the platform team. Nick is always great to work with and is collaborative. I think the overall engagement would have benefitted from him linking the platform team priorities, epics and activities to the portfolio/higher level goals earlier.\n\n**Adam Gardner:**\nno comment, all details in question 12.\n\n**Chris Butler:**\nThis riser has been a great asset to our team.  Even though there has been more Project Management than Product Management, this riser has persevered and done everything it takes to get the work done.\n\n**Dylan Bossie:**\nNick has been taking steps in the right direction towards becoming a strong PM for the team, with room for improvement in terms of being a leader for the team and taking on more of the PM workload independently\n\n**Nick Luckey:**\nI find working with Nick to be incredibly rewarding.\n\n\n\n\nHe is genuinely much appreciated by the entire team for his strong dedication and unwavering support. Nick demonstrates an outstanding willingness to listen to others, ensuring that all perspectives are considered and that communication flows smoothly across our functions.\n\n\n\n\nNick also excels at handling the unexpected; he does a great job at adapting quickly to unforeseen obstacles and pivots without complaint. Critically, Nick handles a ton of vital work behind the scenes, managing administrative tasks, logistics, and planning. This essential work allows our engineers to remain focused on complex technical challenges, significantly boosting the team's overall efficiency and quality of output.\n\n**Jerod Culpepper:**\nIn an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year.\n\n**Eric Whitman:**\nNick is a valuable A player on FORGE. He does a great job at organizing our backlog and making sure that our team is aligned on priorities every week. Although he is newer to platform he doesn't shy away from learning new things or gaining context into stories. Does a great job with roadmapping and keeping us organized.\n\n**Joshua Pritchett:**\nNick has demonstrated impressive resilience and a growth mindset while onboarding onto a platform engagement with an exceptionally steep technical learning curve. Mastering these technical components and the domain context is no small feat, yet he has taken the challenge in stride, growing his fluency every week. His proactive approach to partnership and his receptivity to feedback are accelerating his trajectory, proving he is up to the task of navigating this complex environment.\n",
  "start_stop_keep": "**Brandon Shouse:**\n- Keep pushing hard for the mission; it shows\n- Don't be afraid to push a little more on the PM part of the project/team. You will probably get a little pushback from the engineers, but as long as you are flexible, they will work with you to make sure you have what you need to succeed and help the team succeed.\n\n**Jake Cook:**\nKeep leading platform team as you are, will derive excellent outcomes!\n\n**Kevin Gates:**\nKeep: Nicks detailed roadmaps are great and set a high standard. I was able to easily integrate out team's work into the overall structure. He is great to collaborate with.\nStart: Collaborating more and bringing lean design processes into the fold where there are opportunities. I see potential for brainstorming / ideation around inner-loop features that might be really valuable to app devs and could \"wow\" govt stakeholders. Would like to collaborate with him on things like this. We've been very focused on urgent engineering work, but we could carve out time to discover low-cost / high impact features that we scope down to what we could potentially deliver..\n\n**David Croney:**\nStart: Implementing a sense of urgency in the development of high level priorities and mapping those to the greater goals and communicate how that is going early and often. Early development of a roadmap and high level epics is helpful to ensure everyone is aligned on the path forward. Pairing with portfolio engineering or other platform engineering SMEs would also be helpful.\nStop: Don't hesitate in communicating any challenges in outlining high level priorities and backlog development. If the team is moving in a direction for platform development that doesn't support the company priority of outcomes in production as soon as possible, push back on this (maybe you have already) but make this visible  and also discuss with internal stakeholders.\nKeep: Applying your strong product practices and experience to the platform team and keeping the team focused on outcomes, especially those aligned with the company mission, e.g. outcomes in prod as soon as possible.\n\n**Adam Gardner:**\n**Keep:**\n- **Bringing rigor and pragmatism to the Platform Team.** I was incredibly grateful for the way you urged the team to utilize a backlog and structured outlines rather than leaving work nebulous. This was critical for Leadership and the Portfolio team to understand our direction and status.\n- **Managing stakeholders and protecting the team.** You were consistently transparent about risks and responsive to asks/deadlines. I especially appreciated how you shielded the team from external stress regarding the unachievable deadlines while still trying to move the engagement in a positive direction.\n- **Standing your ground.** You did a great job adding process even when dealing with strong-headed engineers who tried to control the situation.\n**Stop:**\n- **Letting the \"Risk Analysis\" phase linger too long.** While identifying risks is part of your job, there were times when we spent too much time outlining *why* the strategy/timeline wouldn't work, rather than pivoting to *how* we could solve it. Once the risk is flagged, try to minimize the time spent \"admiring the problem\" and move faster toward ownership of the solution.\n- **Allowing the engineering silo to persist.** While you eventually held them accountable, there were times when the engineers were not pausing to pair or transfer context to you. Don't wait to correct this dynamic; stop the line immediately if the team is leaving you behind on context.\n**Start:**\n- **Deepening your application of the \"Outcomes\" methodology.** I recommend you lean further into the Rise8 mindset of \"Outcomes in 180 days.\" Instead of viewing constraints (like the timeline) as reasons why we *can't* succeed, start using them as forcing functions to break the problem down into smaller, achievable wins.\n- **Driving the \"How.\"** When the overall strategy feels disconnected from reality, I would love to see you take the lead earlier in saying, \"Here is the bad situation, now let's talk about how we fix it.\" Shifting from *risk reporter* to *solution architect* slightly earlier will make your life easier and help the team navigate difficult engagements.\n\n**Chris Butler:**\nThis riser should keep being an A-Player and getting the job done.  This riser should also continue asking for assistance or knowledge when they need help with tasks - this is A-Player stuff right here, i.e. knowing when they need help and asking for it.\n\n**Dylan Bossie:**\nStart:\n- Using team stand ups and other technical meetings as learning opportunities to gain knowledge and context on the platform\n- Remaining attentive to each team member's status to identify action items and understand the state of the current work\n\n\n\n\nStop:\n- Idk\n\n\n\n\nContinue:\n- Working on skill building to take the load off the team for things like writing tickets\n- Advocating for, and listening to the team in regard to timelines and communications with the portfolio team\n- Being receptive to feedback\n\n**Nick Luckey:**\nNick should keep being the empathetic, dedicated listener and communicator for the team**.** His strong interpersonal skills and willingness to hear others' needs make him a vital component of the team's collaborative health.\n\n**Jerod Culpepper:**\nIn an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year.\n\n**Eric Whitman:**\nKeep up with aligning us with our expected priorities and shielding us from work you see as not priority for us to reach our goals. You have done a great job doing that by setting up a process for external teams to get support from us which is awesome. Don't be afraid to push us more on being involved in planning stages/etc, it is sometimes seen as busy work for us and we would rather develop but we know it is important so let us know if you require more input on certain activities we are happy to help!\n\n**Joshua Pritchett:**\n- **Start** translating technical complexity into business strategy. As you master the platform's technical components, start converting that knowledge into simple narratives that explain the value of the platform to non-technical stakeholders. Acting as the bridge between the code and the customer value, moving from understanding the tech to selling the capability, is the next step in your growth.\n- Start defining the multi-year strategy for the platform. Don't just learn the current state; begin to define the future state. Use your growing technical context to proactively manage constraints and start building a roadmap that balances immediate technical debt with long-term mission impact.\n- **Consider** that the role is to be the \"translator,\" not just the \"student.\" While it is important to learn the technology, the ultimate goal is to provide objective expertise to overcome challenges. You don't need to know every line of code, but you do need to know enough to strategically challenge the status quo. Shift conversations with engineers from \"How does this work?\" to \"Help me understand the trade-offs of this approach so I can advise on the larger strategic direction.\"\n- **Consider** the mission impact of the platform. Platform work can sometimes feel removed from the end user. Continuously challenge yourself to connect the technical component you are learning to a specific mission outcome or change in user behavior. If you can't draw that line, the roadmap may need adjustment.\n- **Keep** navigating the ambiguity of a complex technical domain. Your ability to take the steep curve in stride establishes your credibility and sets the tone for the team. This resilience is the foundation of success in complex domains.\n- **Keep** actively seeking partnership to deepen understanding. You are authentically engaging stakeholders (esp. engineers) to co-create your understanding. Continue this, as it is the fastest way to increase the breadth and depth of your knowledge before technical challenges become blockers.\n",
  "generation_timestamp": "2025-12-04 17:27:34"
}