{
  "employee_name": "Roshni Patel",
  "accomplishments": "**1. Leading Discovery & Framing for SATCOM and delivering actionable outcomes in under 30 days**\nI drove multiple Discovery & Framing efforts that enabled the SATCOM team to move from ambiguity to clarity quickly. By facilitating stakeholder alignment, synthesizing complex technical workflows, and ensuring each problem was well-framed, I helped the team deliver 3 outcomes in 145 days. \n\n\n\n\n**Impact:** Accelerated our speed to value, reduced rework, and strengthened Rise8’s reputation for rapid, high-quality framing—especially in a complex mission environment.\n\n\n\n\n**2. Raising the quality bar for product collaboration through hiring and practice support**\nI actively contributed to interviewing PM candidates and shaping what “good” looks like within the PM practice. By helping evaluate candidates and providing feedback across the practice, I supported the growth and consistency of our product discipline.\n\n\n\n\n**Impact:** Helped ensure Rise8 continues hiring strong product talent and reinforced high product standards across teams, directly supporting our mission to deliver exceptional outcomes for clients.\n\n\n\n\n**3. Driving alignment and creating cohesion across the PM/PD function**\nI was part of the team who organized the PM/PD offsite to strengthen team collaboration, shared understanding, and alignment on how we operate. This included helping plan content and facilitating on-site behind the scene needs.\n\n\n\n\n**Impact:** Improved cross-team cohesion, increased clarity around roles and workflow expectations, and supported a healthier, more effective product organization—ultimately enabling Rise8 teams to deliver faster and with less friction.",
  "enps_comments": "**Minh Nguyen:**\nYour performance as a Senior PM is outstanding. You excel at product discovery, defining problems, and laying out clear outcomes that directly set our team up for success; your Value Stream Mapping artifact is consistently the best across the team. You manage stakeholders masterfully: always respectful, yet highly effective at pushing back and steering them toward the right direction, which is especially important with our new stakeholder. You are an exceptional team advocate, consistently considering engineering capacity, and you create a relaxed environment where no one ever feels rushed to work on tasks.\n\n**Edwin Karaya:**\nI would enthusiastically rehire Roshni. She is an exceptional PM who has built deep trust with mission stakeholders and consistently brings clarity back to the engineering team. She communicates openly, anticipates risks, handles shifting requirements without losing momentum, and creates a supportive, transparent team environment. Her calm, steady presence and strong facilitation skills make her invaluable to the mission and the team.\n\n**Hannah Cheng:**\nI am grateful for the opportunity to work with Roshni on Mission Workup. I feel that our working styles complement each other perfectly, allowing us to fill gaps and support one another effectively. Roshni is an exceptional active listener, not just with stakeholders, but with every member of the team. She creates a culture of inclusion by encouraging teammates to contribute across domains. She excels at gaining alignment, providing necessary clarity on immediate next steps while maintaining enough flexibility to handle unexpected situations. Her outcome-oriented mindset ensures we always stay focused on mission impact.\n\n**Riya Patel:**\nn/a- capping comments at 6\n",
  "start_stop_keep": "**Minh Nguyen:**\n**Start**\nThinking about that staff promotion :)\nMaybe thinking about how we can clearly point out to our stakeholder about our Rise8 role in the project.\n**Keep**\nDoing an awesome job as PM for our team, and honestly even for the EM&C project as a whole. It seems like you have been setting the standard and practices across the teams.\n\n**Hannah Cheng:**\n**Keep:** Continue guiding stakeholders effectively; you do a great job of making them feel heard while simultaneously protecting the team's focus so we can deliver outcomes. Please also keep the team centered on delivering for impact; your focus here is the team's compass.\n\n**Riya Patel:**\nn/a- capping comments at 6\n",
  "generation_timestamp": "2025-12-04 17:27:47"
}