{
  "employee_name": "Shubham Goel",
  "accomplishments": "**1. Delivered 12 Mission-Critical MOSS Outcomes (31.6% of Rise8 Company Outcomes in H1)**\nAs the product manager on the MOSS contract, I stewarded 12 outcomes from January–July, representing nearly **one-third (31.6%) of Rise8’s total company outcomes** for the first half of the year including:\n– **System & Sensor Health Modal** (eliminated miscommunication and saved hours of troubleshooting)\n– **Incident Reporting Tool** (restored trust in reporting and created a reliable single source of truth)\n– **Audit Log** (reduced 72-hour troubleshooting windows and improved mission system reliability)\n– **Auto-Populated DSR Logs** (prevented ~104 errors per year and dramatically improved data fidelity)\nThese outcomes received direct positive feedback from Will Nill and Jacob Connors. Collectively, they improved mission readiness, reduced downtime, increased operator efficiency, and allowed leadership to make better resourcing and maintenance decisions at 15SPSS. Our MOSS team won the team award at the Florida offsite. \n**2. Led a Smooth Transition of MOSS to 15SPSS While Maintaining Strong Stakeholder Satisfaction**\nI coordinated with Will Dallmann, Jacob Connors, and multiple 15SPSS stakeholders and users to ensure a steady transition of MOSS post-delivery. Stakeholders expressed satisfaction with our progress, communication, and the product’s increased operational value. This transition also supported the continuation of trust in Rise8 as a delivery partner and set the foundation for future collaboration. We also received operational acceptance of MOSS from Col. Wagenbach at 15SPSS. \n**3. Drove Narrowband Discovery, Roadmapping, and Cross-Team Collaboration**\nOn Polaris/Narrowband, I partnered with design, engineering, the RSSCs, CSSE, and EM&C to validate product direction and produce a strong discovery foundation. I ensured backlogs were always prepped for IPM, refined the roadmap with customer validation, and collaboratively worked on prioritization.\n\n\n\n\nI consistently presented progress in PI meetings, led discussions on priorities, and built strong relationships across the integrator and EM&C communities. Stakeholders such as Jimmy Rodgers have provided recurring positive feedback during demos. I also helped implement test cases and user guides for enterprise health monitoring that was part of 1 approved end user outcome and 1 supporting outcome.\n\n\n\n\nAdditionally, I maintained and co-facilitated the weekly Rise8 Lightning Talks with Edwin, contributing to team learning and culture for Rise8 as a whole.",
  "enps_comments": "**Drew Fugate:**\nAbsolutely, as I have seen firsthand their commitment to delivering high-impact outcomes.\n\n\n\n\n- **Outcome Orientation:** They differentiate themselves by ensuring outcomes are not just \"shipped,\" but \"verified.\" They follow features through to production to confirm functionality and impact, rather than assuming the job is done when the ticket is closed.\n- **Team facilitation:** They are a \"constructive engager\" who runs our rituals effectively. I specifically appreciate their habit of sharing information from stakeholder meetings, ensuring important knowledge isn't lost or siloed.\n- **Adaptability:** They bring a positive, energetic vibe to the team and are highly receptive to feedback, often incorporating suggestions into their process immediately.\n\n**Seehyun Kim:**\nShubham is extremely smart and demonstrates excellent communication skills, which are critical to his role as a PM. I particularly appreciate the positive energy he brings to the team, making our work environment more collaborative, engaging, and inviting. His enthusiasm is contagious, encouraging others to participate actively, share ideas, and approach challenges with a constructive mindset. This combination of intelligence and team spirit significantly strengthens both our internal collaboration and cross-team partnerships.\n\n**Ben Adinata:**\nI would enthusiastically rehire Shubham. He came up to speed within the expected timeframe and now handles all our stakeholder and user interactions. This is a huge help because it protects the engineering team's time, letting us focus on the build while he ensures we're building what the users actually need.\n\n\n\n\nHe is driving the team toward OA because he understands how important it is to get the software into prod. While we are still refining how we handle planning meetings, he listens to our feedback and takes action on it. He is doing a good job navigating a complex product and keeping the team moving forward.\n\n**Riya Patel:**\nn/a - hit max cap\n\n**Norman Sharpe:**\nShubham **excels at the operational responsibilities** of the role, specifically in managing artifacts, share-outs, and coordinating complex user and team meetings. He is a highly reliable partner; when the team brings him problems, he consistently steps up to facilitate the solution process effectively.\n\n\n\n\nHowever, I have concerns regarding his **proactivity** in understanding/navigating the user domain, coming up with a plan for how and when to deliver solutions based on costs/risks, and identifying unique and valuable outcomes. He currently tends to operate passively, often requiring external intervention or guidance to identify risks and business opportunities. This lack of deep domain ownership manifests as a struggle to provide clear, concise product direction, which creates downstream ambiguity for both the design/research tracks and the software delivery pipeline.\n\n**Chris Wang:**\nYou are a charismatic leader who brings psychological safety and positivity to the team. I selected \"Agree\" rather than \"Strongly Agree\" because, while your soft skills are excellent, more technical depth and drive would help get us to our outcomes more quickly.\n\n\n\n\nTo make a bigger impact, I'd like to see you pivot from a \"facilitator\" mindset to an \"owner\" mindset. This means: 1) Developing the technical grasp to make sound product decisions, and 2) Bringing a higher level of intensity and grit to the mission. If you can dig deeper into the product and advocate for desired outcomes, you'd be unstoppable.\n",
  "start_stop_keep": "**Drew Fugate:**\n- **Keep:** Please keep building such strong rapport with our customers. Your positive attitude and connection with users are critical assets as they allow us to collect data faster and get the qualitative feedback we need to ship better outcomes. This customer-closeness is a superpower for the team; don't lose it.\n- **Start:** I would like you to start defining metric requirements earlier in the lifecycle (ideally during the discovery phase for new outcomes/lines of effort). As engineers, we need to know *what* success looks like so we can instrument the code to collect that data from day one. If we \"shift left\" on measurement planning, we can prove our outcomes much more easily.\n- **Stop:** Stop feeling like you need to let every conversation run its natural course. As the facilitator of our rituals, I encourage you to be bold in your direction. If a discussion is circling or going off-topic, feel free to interrupt and move it to a parking lot or otherwise save for another time. This will help to keep our focus on the highest-value topics.\n\n**Seehyun Kim:**\n- Keep obtaining domain knowledge. Continuing to deepen your understanding of the domain will not only strengthen your expertise but also further build trust and credibility with clients, enabling you to influence decisions more effectively.\n- Keep taking ownership. Maintaining your proactive ownership of the project and outcomes will help unlock the next level of your leadership skills, demonstrating your ability to guide teams and drive impact with confidence.\n- Keep actively participating in meetings. Your consistent presence and active engagement in discussions enhances your influence internally within the team as well as increasing your leadership presence within the EM&C context.\n\n**Ben Adinata:**\nKeep: You are doing a great job handling the stakeholders and users. That effectively shields the engineering team so we can focus on the build, which is exactly what we need. Also, please keep pushing us to get our outcomes into production. That focus on the end goal is really important.\n\n\n\n\nStart: I encourage you to step in more during our technical discussions. We often get lost in the weeds, and it would help if you interrupted or time-boxed us. You have our trust, so please feel empowered to make the final call even if everyone hasn't spoken yet. We look to you to set the direction.\n\n\n\n\nStop: I've noticed you can be a bit passive when we need a decision, often waiting for the room to guide you. I suggest you stop waiting for consensus. You have the context and the user data. The team trusts you, so rely on your judgment to drive the decision.\n\n**Riya Patel:**\nn/a - hit max cap\n\n**Norman Sharpe:**\n**Keep Doing:**\n- Keep collaboration and involvement within the team at a high level. Your ability to bring together insights from each member, develop a fun and engaging culture, and facilitate difficult discussions is VERY valuable.\n- Keep consistently executing your day-to-day responsibilities like facilitating standup/pre-ipm/ipm/design reviews/QA and testing overviews. This level of coordination, and delivering share-outs helps the team deliver effectively.\n**Stop Doing:**\n- Stop operating like a \"Project Manager\", the \"chief coordinator\", or the \"scrum master\" for the team. While we appreciate the facilitation, we need more direction.\n- Stop joining meetings as a spectator or note-taker. If you're in a design review or research sync, you should be the most active voice, not the one just \"absorbing\" information.\n- Stop/prevent using \"we need more research\" as a reason to delay a decision or opinion. It's important that you have a point of view, even with incomplete data.\n**Start Doing:**\n- Start focusing on setting crystal clear, concise, and specific guidance on product direction. For example, using the feature delivery timeline gantt chart was a super useful play - think of more ways you can follow through with that pattern.\n- Start using deep user and EM&C facing insights to advocate for changes that will lead to better outcomes.\n\n**Chris Wang:**\nStart: Lean more into the \"Be Bold\" aspect of our values, specifically when it comes to external stakeholders. You are an excellent facilitator, but the team needs you to put our values in motion even when the situation is uncomfortable, uncertain, or intimidating. This means advocating for our position and \"Doing What Works\" to get a well-defined, justifiable MVP to Prod faster.\n\n\n\n\nStart: Do What Is Required to develop a strategic opinion. Go beyond the surface level to understand both the technical details and the deeper stakeholder motivations. It's important to have the insight to navigate the politics and make decisions with conviction.\n\n\n\n\nKeep: Always Be Kind and maintain the psychological safety you bring. Your ability to facilitate discussion and ensure everyone feels heard is a huge asset that keeps the team aligned and supported.\n\n\n\n\nStop: Try to avoid remaining at the high-level facilitation layer. When a technical or strategic discussion gets complicated, challenge yourself to dig in rather than deferring. It is completely okay to ask for help or clarification; doing so will help us fill in any gaps in your understanding, and thus help you lead the team more effectively.\n",
  "generation_timestamp": "2025-12-04 17:27:53"
}