{
  "employee_name": "Basudev Rijal",
  "accomplishments": "G8way: working ~170+ points worth worth of tickets in 1 year contract. Enabled team to significant UI changes during few sprints. improved UI's and tests.\nG8way: Nebula IT lead, managed team access to nebula platform during the the contract.\nETS: switched to system admin hat and supported internal IT team during critical CMMC inspection.",
  "enps_comments": "**Wayland Pearce:**\nI would rehire this Riser because he shows real passion for helping the team and always jumps in when something needs to get done. Since moving over to support IT, he’s taken on a lot of unfamiliar work and handled it with a great attitude. He’s reliable, eager to learn, and follows through once he knows the direction. With more experience and guidance, he’s only going to keep getting better, and I appreciate how willing he is to step up whenever I need help.\n\n**Thomas Reynolds:**\nRJ is passionate about growing as an engineer. I believe he is still in a period of learning how best to learn in a fast moving and quickly evolving environment. That being said, I have witnessed a lot of growth from him since he has joined and believe he has much potential to continue growing.\n\n**Jacobi Ayala:**\nRJ shows initiative to be a contributor and asks questions to ensure he has the right information to solve the problem. He could grow his technical skills more but is otherwise a go-getter and always wanting to learn and participate.\n\n**Matt O'Donnell:**\nIn the short time I worked with Basudev, it was a pleasure. He always reached out respectfully when he needed help or design direction, and he was thoughtful in the questions he asked. He made great use of my time and consistently delivered complete, well-executed work. I would have happily worked with him on another project. He was always able to clearly communicate the why behind his decisions.\n\n**Cory:**\nI worked with RJ on the Q8way project. I was impressed with his frontend development skills and he regularly took on other tickets to get more experience in other fields. I would rehire RJ.\n",
  "start_stop_keep": "**Wayland Pearce:**\n**Start:**\nStart taking more initiative in identifying what needs to be done before being asked. You have the drive you just need to trust yourself more and lean into problem-solving on your own. The more you try things first, the faster you’ll grow.\n**Stop:**\nStop second-guessing yourself or waiting for perfect instructions. You’re more capable than you think, and it’s okay to make a call, try something, or ask clarifying questions early instead of hesitating.\n**Keep:**\nKeep bringing your positive attitude, willingness to help, and eagerness to learn. You’ve stepped into a ton of new IT tasks and handled them well. Your energy and readiness to jump in make a big difference, and as you keep building experience, your confidence will grow right alongside it.\n\n**Thomas Reynolds:**\n- Start: When encountering a problem that you don't have an immediate solution for, set a timer for yourself and go research the problem and potential solutions for a couple hours. If you still haven't found a solution after that, then go and ask for help from somebody who might know the solution. I have witnessed RJ jumping too quickly to asking for help from AI or other engineers without taking time to research and potentially grow from finding the solution himself, which I believe is slowing his growth and learning.\n- Stop: Nothing more to add here besides what I've hinted at in the \"start\" point.\n- Keep: Seeking out opportunities to grow. Not every problem needs to be solved immediately, so sometimes slowing down and using a problem as a learning opportunity is more meaningful than just using the \"best practice\" solution or asking for help. At RJ's level, I would encourage him to try to find a problem each day that he can think critically about for a while and try to find a different solution for, even if there is a known solution for it already.\n\n**Jacobi Ayala:**\nStart working on some personal projects with specific technologies to gain a better grasp of the tool and its best practices. Anything you are interested in is useful knowledge.\n\n\n\n\nI don't have a good stop recommendation.\n\n\n\n\nKeep working towards your technical expertise and mastery of languages and tools without having to rely on AI. It's easier to guide AI when you know the tools a little more.\n\n**Matt O'Donnell:**\nThis question is tough to answer because I didn’t have much visibility into his day-to-day work ethic. During the time we worked together, though, he was always on time, created an enjoyable work environment, and was consistently helpful whenever I had questions about the work he was doing.\n\n**Cory:**\nI know RJ has been on the beach so I hope he can take advantage and grow his skills as well as get on a project that will test him and help him grow. Just keep up the growth.\n",
  "generation_timestamp": "2025-12-04 17:47:59"
}