{
  "employee_name": "Wayland Pearce",
  "accomplishments": "**1. Advancing CMMC Level 2 Readiness**\nI led major portions of our CMMC and NIST 800-171 compliance effort strengthening policies, tightening controls, and improving documentation. This work directly supports Rise8’s ability to win and retain government contracts, especially those involving CUI, and positions us for long-term growth in the federal space.\n**2. Modernizing and Securing Our IT Environment**\nFrom Zscaler deployment to improved endpoint security, asset management, and Google Workspace FedRAMP-High configuration, I significantly raised the security and reliability of our internal systems. These improvements reduced operational risk, increased resilience, and created a more secure foundation for both classified and unclassified work.\n**3. Reducing Operational Friction Across the Company**\nI proactively solved countless IT and security blockers everything from onboarding, access issues, and Google Drive cleanup to vendor management and internal processes. By removing friction and increasing clarity, I helped teams stay productive, ship faster, and focus on delivering value to our clients instead of fighting tools or systems.",
  "enps_comments": "**Bryon Kroger:**\nYou have incredible grit and growth mindset. And I know we can always count on you to do the right thing and do what is required. One area for growth would be:\n\n\n\n\n1) working backwards from desired mission/business impact - this is somewhat natural in this stage of your career, but to really excel as an A Player in your current role, you need to step above the tactical details and be able to think more strategically about what the business needs and how we can get there. And then learning to communicate that effectively to leaders. This will be a big unlock for you. It's also not nearly as easy as it is to say. Learn from the leaders at Rise8 that do this well.\n\n**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\nI would absolutely rehire Wayland! He has a great addition to the IT team and he is always willing to do what is required. He has tremendous grit and pushes towards the end of every project that he's working on. He is thorough and loves what he does. I appreciate the way he engages with his teammates, and that he's always willing to serve.\n\n**Christal Walker:**\nWayland, I want to express my sincere appreciation for your profound impact on the team environment. You were instrumental in helping me feel welcomed and integrated into Rise8 from day one, which is especially important in a role that can sometimes feel siloed.\n\n\n\n\nYour dedication to company culture is invaluable. You are the ultimate **Culture Catalyst**, creating an environment where people genuinely enjoy working and inviting others to partake through initiatives like the 9/11 Stairs Challenge and 75 Hard, and by promoting the Rise8 brand with enthusiasm. Your ability to embrace the 'IT guy' persona while simultaneously mastering your technical responsibilities is fantastic.\n\n\n\n\nBeyond culture, your management of the help desk is great; I've heard zero complaints. You ensure that everyone has the necessary resources, enabling the rest of us to focus squarely on delivering mission outcomes. You consistently go the extra mile and always respond with eagerness, making colleagues feel prioritized, never inconvenienced.\n\n\n\n\nThank you for your consistent kindness, professionalism, and dedication. I truly value working alongside you and look forward to witnessing your continued success.\n\n**Noah McHugh:**\nWayland is such an incredibly helpful and knowledgeable person to work alongside, he never says no when you need help, always willing to step in and do what it takes to get the job done. He is always wanting to gain more knowledge and grow his experience, never afraid to take something new and foreign on.\n",
  "start_stop_keep": "**Bryon Kroger:**\nKeep leading by example what it means to have grit and growth mindset. And just generally being an awesome dude. We appreciate you.\n\n\n\n\nI think I covered it above, but start an IT strategy for the year/quarter and then create a plan to get leadership buy in. It doesn't have to be something profound or \"innovative\". What does the business need now/next year and how do we get there?\n\n**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\n**Keep**\n• learning!! this is your superpower, you love to learn and are growing so much! don't stop!!\n• asking questions!!\n• being a servant!! this is also your superpower. I love that you are always willing to help and find solutions\n• asking for help! This will be a huge enabler for you as you push to learn and grow in your career\n\n\n\n\n**Stop**\n• jumping in and doing something right away. Pause, take some time, research, and look into what you are trying to do, to make sure that what you are doing is approved or endorsed by others that might have more experience.\n\n\n\n\n**Start**\n**•** seeing the big picture. As you get more involved and learn more, start focusing on what happening across more than just your own bubble.\n\n**Christal Walker:**\nWayland, I encourage you to operate with the full confidence that your talent warrants. I sometimes sense you might be underestimating your own significant abilities, but you are an extremely capable and essential part of the team. Please leverage your professional development resources to continue mastering your craft—investing in your skills will only amplify your already strong performance.\n\n\n\n\nI'm glad to hear that some responsibilities may be shifting, giving you the necessary space to focus deeply on the areas where you are most passionate.\n\n\n\n\nPlease maintain the exceptional level of service and professionalism you consistently deliver. That infectious enthusiasm you bring to your work makes a palpable difference; keep that spirit alive!\n\n\n\n\nYou are effectively the Chief Steward of the help desk, and you should embrace that ownership completely. That includes feeling fully empowered to delegate tasks, proactively ask for additional support, and provide feedback when contributions from others are falling short.\n\n\n\n\nYou truly function as the company's immune system—without your continuous vigilance and support, our team would quickly become weak, inefficient, and vulnerable to mission disruption.\n\n**Noah McHugh:**\nStart gaining more knowledge on greater tech and cloud tooling that we use, AWS would be a great place to start growing and gaining certification. Potentially get more involved in company tech initiatives, that could be a great place to gain more knowledge.\n\n\n\n\nKeep being an incredibly kind and helpful person to work alongside.\n",
  "generation_timestamp": "2025-12-04 17:48:06"
}