{
  "employee_name": "Matt Pacione",
  "accomplishments": "For the first three quarters of 2025 (January through October), I served as Platform Engineering Practice Lead, managing seven delivery teams across our largest contracts. In late October 2025, I transitioned to Enablement Lead, reporting to the Enablement Director, where I now focus on enabling platform engineering teams through training, R&D projects, and AI-powered tooling. The accomplishments below reflect both my Practice Lead tenure and the early momentum I've built in my new enablement role.",
  "enps_comments": "**Jeff Wills:**\nMatt did a great job keeping track of personnel. PE and Security seemed to have the most people with performance problems.  Matt did not shy away from the tough conversations, investigated the situation, and responded with kind directness that helped several Risers right the ship.\n\n\n\n\nHaving Matt to bounce ideas off and provide context in the swirl of activity is/was super helpful.\n\n\n\n\nI marked some 'solid performer' as I didn't have enough context to rate higher.\n\n**Noah McHugh:**\n(Probably going to give away who this is) But Matt is an incredible person, he took me under his wing and went above and beyond helping me learn the company, get up to speed on contracts, and feel comfortable and supported along the way. He cares and it shows, and that is important.\n\n**Branden Van Derbur:**\nI've known Matt for several years now, and he's without a doubt an engineer I'd always want on my team.\n\n**Bryon Kroger:**\nSaw you grow a lot in the area of being bold, especially when it comes to feedback and hard conversations, including firing. \n\n\n\n\nI've given you this feedback before, but to continue to have the respect of your team, you've got to really push on platform skills. People love you as a coach/teacher, but over time if you don't stay Staff+ in skill, it will be hard for the practice to follow you. So keep finding ways to stay fresh and advancing.\n\n**Jeff Rodanski:**\nI consider you a A+ Player!! Keep it up.\n\n**Mike Gehard:**\nMatt is a great collaborator who consistently brings innovative ideas and takes initiative without needing to be asked - his work on 8gents and the solutions repository are perfect examples of this.\n\n\n\n\nHowever, I'd like to see him be more assertive in defending his strong ideas. He tends to be agreeable when pushing back could lead to better outcomes. I also notice he sometimes takes on new commitments before fully completing existing work, which causes delays. His experiments show great promise, but they often stop just short of broader adoption - they need feedback from more Risers and active promotion to maximize their impact.\n\n**Jeremy Arzuaga:**\nI think a lot of these rating are hard to give accurate rating to when you don't work with this person day after day. When interacting with Matt I always felt he was really easy to approach and work with.\n\n**Luke Strebel:**\nMatt is an incredibly sharp individual, one of those guys who Im not sure Rise8 would be the same if / when he starts his own thing. I have been super impressed with his vibe since the day I met him. He’s very fun, outgoing, technical, and empathetic. I really appreciate that he was able to support Branden through a pretty rough time in his life, and it was great to feel like he was taken care of both professionally and personally. Mat’s a true A-player!\n\n\n\n\nIn our work together in ATTV, I have gotten to see Matt rotate through whatever persona was needed for the lifecycle of the project. From single point of context on what the history of the project, driving it forward one step at a time, to leading architecture to most recently “here’s a vision and the tools. With AI and a little guidance you can lead the way here as devs and help define what is needed next”. I think it is cool to see you empowering the team on where to go next.\n\n\n\n\nATTV is a strange project sometimes, from the fluctuating vision to the spiky resources, it’s a challenging product to be the PM for. It can be difficult to get insights into what leadership is looking for on the project. On one hand, I could definitely do a better job of being proactive and hyper-engaging in the product to get it to be a super-success. On the other hand, there are times when Matt gets new info that I’m not tracking and it shifts the vision or strategy quicker than I anticipate. Matt does as good fo a job as he can keeping me in the loop, which I appreciate a ton - but there’s almost always something that I feel just a touch behind on.\n\n\n\n\nI prefer Mat’s style of “inform as fast as possible the core people who might be affected”, but there have been times where I am in several differen DMs or having conversations with folks about resourcing on SecRel and it feels like a game of telephone. I would tell Sharon, who would tell you - but you had already told dev X something else. It never caused any real harm, but it was a bit stressful trying to keep track of what was the most recent and who had the information. It’s incredible that Matt was able to keep this stuff moving with all his responsibilities to begin with - but I think being more deliberate about those discussions would be helpful. I ack that it’s a catch22 because you either get transparent and early - but wrong. Or you get accurate and late, and are ambushed. I would rather have the former every time, but that’s not true for everyone and some people just want to hear one thing.\n\n\n\n\nMatt is always bold and taking on tough challenges, focusing on outcomes and people too. He’s a top 1% in almost every category. I do think Matt and I could have done some solid feedback before this. There are times when it’s hard for both of us to focus on ATTV, and I think we could do a better job at Keeping it Real on where we’re performing on our expectations for delivering something real. You would be a fool not to hire M@!\n",
  "start_stop_keep": "**Jeff Wills:**\nStart: add some cli skills assessment to PE as it is a foundational skill and the easiest thing to test mastery in.  Mastering a tool such as CLI is a good predictor that they'll master whatever is put in front of them. If not cli some other common tool PE uses will do. Maybe how well they navigate an IDE?  Possibly less important with Claude taking over.\n\n\n\n\nKeep providing clear and caring feedback to Risers\n\n\n\n\nI think we in Engineering have a lot of room to improve practice, both in PE and SWE.  Looking forward to see the impact Matt makes in Enablement!\n\n**Noah McHugh:**\nKeep being you, you're a cornerstone in the company, you push people to be a better version of themselves and encourage them along the way. Your enthusiasm shines through and helps others when they need it, and your willingness to learn and teach others is incredible.\n\n**Branden Van Derbur:**\nStart:\n- No notes\nStop:\n- No notes\nKeep:\n- Being someone that Risers can rely on to always approach every situation with rationale, kindness, and fairness without fail\n- Encouraging teammates to embrace challenges and adversity so they can harden their skillsets and grow as fast as possible\n- Being a role model for engineers to strive to become\n- Being one of the greatest fellas I've ever met and someone I know will always have my back no matter what\n\n**Bryon Kroger:**\nKeep: pushing the limits with AI. Pretty impressive what I've been hearing and seeing. Keep being a guy that everyone loves to talk to and learn from. Keep giving feedback.\nStart: really pushing hard on platform engineering as a practice... we need to be the best in govtech at platform. That's your task.\n\n**Jeff Rodanski:**\nStart spreading knowledge/inspiration on this new era of AI-enabled with Agentic Automation more widely at Rise8 (and beyond)\nStop being so busy \nContinue to be a thought leader in Rise8 AI-enabled delivery process (across all practices)\n\n**Mike Gehard:**\n**Start:**\n- Seeking feedback earlier and from a broader group of Risers during development, not just after completion. This will help refine your work and increase its relevance beyond platform engineering.\n- Actively promoting and educating all Risers on how to use the solutions you build. Your innovations deserve company-wide visibility and adoption.\n- Advocating more forcefully for your ideas during collaboration. Your instincts are good - trust them and push back when you see a better path forward.\n**Stop:**\n- Saying yes to new commitments when you have significant work in progress. Your existing initiatives deserve your full attention to reach completion.\n- Defaulting to 1:1 or small group implementations. Design with all of Rise8 in mind from the start.\n**Keep:**\n- Taking initiative to experiment with new technology without waiting for permission. Your work with AI tools like 8gents and the solutions repo demonstrates exactly the kind of innovation Rise8 needs.\n\n**Jeremy Arzuaga:**\nMatt has been a great resource to help through some difficult engagement issues specifically with the whole USPTO issue. I knew I could count on him to help guide on what's best to do for the employee and the relationship with customer. Matt has also been great to collab on improvements to the cybersecurity hiring and interviewing scripts and was always looking for feedback. In the one instance where I asked for some additional coaching he was quick to reach out and provide guidance.  \n\n\n\n\nI also appreciated him reaching out to me when there was some confusion of the DL/EL/CS roles and responsibilities. \n\n\n\n\nI don't work with Matt day to day, so the only recommendation I would have would be related the hiring process and ensuring we tracking which people we're hiring for each position. The FORGE hiring was kind of hectic with all the people we had to hire and at times I wasn't sure which position we already filled. \n\n\n\n\nOne thing I'd like to see understand more from an EL is how they interact with individuals (it seems more of an as needed).\n\n**Luke Strebel:**\nFor the next year, the main thing is to **keep** being that A-Player: **keep** your fun, outgoing, and empathetic vibe, and **keep** rotating through the personas ATTV needs. Your style of \"inform as fast as possible\" is preferred, so **keep** doing that. The main area to **start** is to be more deliberate about our communication, especially on resourcing. To avoid the 'game of telephone' (where I'm in several different DMs), we should **start** using a single, clear channel for those decisions. Finally, let's **start** setting a regular check-in so we can 'Keep it Real' with each other about our expectations for ATTV and make sure we're aligned.\n",
  "generation_timestamp": "2025-12-03 20:28:35"
}