{
  "employee_name": "Brian Jennings",
  "accomplishments": "1. **Upskilling myself & others in AI tools and practices**: I am super excited about the progress we made this year around AI upskilling for our design department as well as personally how far I've come in my own progress. These tools will allow us to have outsized impact like never before (we're just beginning to see the payoff) and one of my biggest wins for the year is leveling up our design team, my peers, and myself when it comes to integrating these tools into our practices. They are making us more efficient at our jobs and allow us to complete tasks that were unachievable without these tools. Outcomes I saw: we went from designers being afraid of these tools and having a lot of fear/pushback early in the year to having every designer coding with Claude. In one of our design mix sessions, teams built entire solutions with working software in 40m for a test challenge we gave them. Designers are using tools like Claude and Gemini to synthesize research more quickly, to build discussion guides, to create prototypes, to organize and categorize information. It's allowing teams to move more quickly and be more efficient with product validation. 60% of designers are using AI tools daily on their projects and the other 40% are using them at least weekly if not a few times a week.\n2. **Retaining our designer A-players, and keeping folks excited/motivated:** One of the bigger impacts is that we had 0% attrition in the design department in 2025. The last time we had a designer leave Rise8 on their own accord was Feb 2024, that was the only designer we've ever had leave since I took over as PL (we had 2 terminations for performance issues that I am counting separate than attrition). By keeping folks motivated, aligning the work they do to personal goals, creating a design community that folks want to be a part of, and showing recognition for contributions, we've created a design community at Rise8 that A-players want to be a part of and don't want to leave. This means we are kicking off projects with folks that have an ever-growing foundation of Rise8 experience, we are wowing customers early and are able to reduce the time it takes to onboard new folks, ultimately having less ramp up, faster time to value and happier customers who can wow the client on day 1. Examples: Jon Van Dalen on TAK, got overwhelmingly positive feedback from Noah+Kevan working on that account, Hannah on EM&C helping produce a gold standard OOR with her PM pair (per Rob), Darla making immediate contributions on EM&C team.\n3. **CL'ing for 15SPSS & Delivering 11 approved outcomes in 6mo, and winning \"The Dream Team\" award for the year:** I wanted to connect back to one of the most important parts of the Rise8 mission, delivering outcomes in production. From mid-2024 to July 2025, I was a Client Liaison for the 15 SPSS customer and worked alongside a truly great team that shipped 9 user outcomes and 2 supporting outcomes between January-July in 2025. Those 9 outcomes represented 24% of all outcomes submitted across all Rise8 projects between Q1+Q2. In my role as CL I was able to work with the team to keep pushing them to think of the next outcome, to bring together stakeholders to support the delivery team, discuss risks and resolve blockers. I did an on-site customer visit with the team in early 2025 and was able to get 4 of the key stakeholders to attend Prodacity which also led to business development - coming out of my Prodacity meetings, we submit 2 proposals together trying to get more funding to continue our partnership together. Unfortunately neither panned out (they were competitive awards) but we are still working with the customer to leverage other funding vehicles to be able to work together more. At our 2025 offsite, we (myself included) were awarded the coveted \"Dream Team\" award for setting and elevating what it means to \"rise up\" to ship customer outcomes.",
  "enps_comments": "**Rob Monroe:**\n- Operates with curiosity, empathy, and humility at all times, which makes him excellent at navigating ambiguity and solving tough problems\n- Championed growth mindset and grit on our team by leaning into Claude code and exploring opportunities to solve unique challenges for Risers\n- Your leadership and coaching really helped us pull off an effective and impactful department off-site\n- While Brian is always locked in how to best solve for users needs, I'd love to see him start more conversations and decisions from the mission/business impact we're trying to achieve. With it becoming easier to take ideas to prod, there's also greater risks of our team defaulting to building solutions that may be better suited with a buy or partnership strategy. As an example I'd love to see more rationale on how strategies like RiseU, RiseU Bot and upcoming solutions we're planning to ship, are going to drive critical Rise8 numbers such as Outcomes in Prod, Revenue, etc.\n\n**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\nI definitely would rehire Brian for his role on my team at Rise8. He is passionate, driven, eager, and cares about his team. He loves to see his projects through, and pushes the boundaries on what we should expect from a designer. I appreciate that he is thoughtful, patient, and analyzes problems based upon the whole picture. He is kind, do what's right, and always looks out for his team.\n\n**Jeff Rodanski:**\nYou're a A+ player!\n\n**Bryon Kroger:**\nThis year was a whirlwind! You really stepped up and led the design department, including through some tough challenges. I really appreciate you. The perspective you bring always gives me valuable things to think about and you do large amounts of valuable work! There are three areas I highlighted that I saw room for improvement. Two of them are related (I think). I see that you sometimes struggle with the courage to have difficult conversations. Interestingly, moreso with subordinates than with peers or even me. In fact, I really appreciate how often you are willing to challenge me. So it's not just about hard conversations, and there's probably something there worth exploring. But because of that, I think you have struggled to challenge some practitioners directly and in a way that can help them grow in key areas (which is the kind thing to do). I don't want to make this seem dire, though. There's room for improvement, but overall I think you are skilled at giving feedback and I think you grew through the tough ones. I also know firing was a new experience for you, and a difficult one, and while I'm sure you have some lessons learned, I was impressed at how you handled those situations. \n\n\n\n\nThe third one was do what works. I felt like specifically with RiseU, we really struggled to get to a place where we had measurable outcomes we were working towards. I assume some of that was due to it being one of many hats, so I'm looking forward to seeing RiseU 2026!\n\n**Tom Anastasio:**\nBrian's **empathetic and brutally honest communication** is one of his greatest strengths. During the extremely challenging time when my employment status was uncertain, his communication style made a potentially life-impacting situation feel manageable. His kindness, combined with clear honesty, allowed me to stay **optimistic and motivated** to provide value to Rise 8, rather than immediately seeking other employment.\n\n\n\n\nBrian is highly effective at managing his teams by clearly articulating the **desired outcomes and impacts**, along with potential strategic ideas. Crucially, he gives people the **autonomy and support** necessary to hit those goals, stepping back and trusting them with the \"how.\"\n\n\n\n\nBrian's true **superpower** lies in his ability to **identify and leverage people's strengths and interests**. He not only observed a nascent interest in me that I hadn't fully recognized but then strategically moved me into a role that challenged me to become a **leading expert** in that area, and then encouraged me to coach and share those learnings across the company. This shows exceptional insight into talent development.\n\n\n\n\nOne clear area for improvement is the **timeliness of critical feedback**. Specifically, there was some very valuable and accurate feedback about my lack of company-wide contributions. While the feedback itself was excellent, delivering it sooner and more frequently would have allowed me to correct my focus much earlier, preventing issues from compounding until a mid- or end-of-year review.\n",
  "start_stop_keep": "**Rob Monroe:**\n**Start**\n- Working backwards from clear and measurable impact, and making this clear and prevalent in your comms  \n- Considering when it's time to buy or partner with other companies to solve our company challenges\n**Stop**\n- None at this time\n**Continue**\n- Bringing the UX/Design thought leadership in every conversation\n\n**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\n**Keep**\n- being passionate with design and how we should deliver to users, thinking about them and caring about how the mission is impacted through their work\n- looking towards what the user wants and how the mission can be impacted by what we do\n- caring about Risers and their education, pushing them to strive towards being better\n- stepping up and taking charge in the vacuum. I appreciate how you find those needs and step up to rally the team around these issues\n- up your technical ability and continue to grow there! I love that you jump in on projects and want to learn and dig in on all things technical to help your enablement and design across the organization\n**Stop**\n- being so quiet about what you are working on, I think you do amazing work and would love to see more of what you have to offer (see \"Start\")\n- working in isolation. Let's pair more! if you have questions on infrastructure or the platform, let's talk through it, happy to provide more context on the environment and what we can and can't do at the moment. I love that you figure out solutions for the problems you face, but involve the team more to see if there's any other options that could be explored, especially when it comes to matters in other practices.\n**Start**\n- sharing more often of what you are doing. I know I am often not knowing what you are doing, until you are close to being done. I know I'm not a stakeholder, but I love to see what you are working on, as it encourages me to do better in what I'm doing, so seeing what you are doing along the way (possibly just sharing more out during the day in our #enablement_team channel or something) would be helpful\n\n**Jeff Rodanski:**\nStart advocating for the future way of working using AI-enabled delivery process (go beyond AI as a tool)\nStop not going to the Design COP meetings. Even though you have a new role, you're still a designer and a design leader (and all the designers look up to you). \nContinue to be a thought leader in the AI-enabled design process (and beyond)\n\n**Bryon Kroger:**\nKeep: Being an advocate for autonomy and no unnecessary rules. I sometimes feel like the entire world is against me on that topic. You've been one of the biggest advocates for freedom & responsibility. Hope to see you do a microenterprise/spinoff one day!\nStart: leaning into those tough conversations. One thing that has helped me is to have a no hesitation rule. I have this thing where whenever I am feeling uncomfortable I force myself to immediately lean into it. It's changed a lot for me in the last two years. I sometimes count to three as a silent reminder/pep talk\n\n**Tom Anastasio:**\n- **Keep Doing:**\n   - **Keep using your empathetic and honest communication style** in high-stakes or difficult situations. This is a critical leadership skill that preserves employee trust and engagement during uncertainty.\n   - **Keep using your superpower of identifying and cultivating talent.** The way you move and challenge individuals to become experts in their areas of interest is a massive growth driver for Rise 8.\n   - **Keep giving your team autonomy** by clearly defining the desired outcomes and impacts while trusting them to determine the best path to get there.\n- **Start Doing:**\n   - **Start integrating frequent, intentional expectation alignment check-ins** into your 1:1s (e.g., a Monthly loop). Explicitly and clearly help your direct reports measure their current performance against the initial outcomes you set. This focus will ensure a much shorter feedback loop, eliminate any ambiguity about their contribution status, and enable early, small course corrections for any gaps or blind spots, preventing issues from compounding until formal reviews.\n",
  "generation_timestamp": "2025-12-04 17:48:00"
}