{
  "employee_name": "Jeff Rodanski",
  "accomplishments": "Coaching and inspiring designers to be A-players\nTaking the steps to be a AI design thought leader\nCreated the A-player scorecard app",
  "enps_comments": "**Bryon Kroger:**\nI haven't had a lot of opportunity to observe your work, or the results. I've largely heard about it indirectly via Brian and sometimes others. The exception would be facilitated sessions. I believe you can be the Design leader we need here and there are also opportunities for you to some of the things you love and are passionate about. I'm excited to see what you do with those.\n\n**Brian Jennings:**\nYou are able to take your vast wealth of experience and use it to coach and mentor folks for the better. You are kind, yet still provide amazing feedback which helps folks feel cared for. If anything I want more of that feedback to come out and help steer the direction of Rise8. \n\n\n\n\nI appreciate your customer centricity, your pragmatic approach and willingness to bend to ensure customer happiness.\n\n**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\nI absolutely love working with Jeff and would enthusiastically rehire him in a heart beat. He provides a creativity and drive that is infectious and helps the rest of the team push further and faster than where we've gone in the past! We've not worked together that long, but can't wait to see how our partnership grows and see what amazing things we can deliver together!!\n\n**Seehyun Kim:**\nI would love to work with Jeff again because I feel that he cares about everyone on the Design team and invests in each individual’s growth. He doesn’t just provide answers necessarily. He guides me to think critically and strategically, which has made me feel supported, especially when my project workload was intense. \n\n\n\n\nAs designers, we are often heavily integrated into project teams and can sometimes feel isolated, but I believe Jeff has an ability to create a strong, safe design team where everyone feels a sense of belonging and support. \n\n\n\n\nWith his years of experience in consulting and design, I greatly value the opportunity to learn from him and discuss challenges and ideas. Jeff is inviting, inclusive, and creates a fun, playful atmosphere while maintaining a high level of professionalism.\n\n**Nick Mendiola:**\nJeff has quickly become the rock in the Design practice. I know If I ever have any issues, need some direction/feedback on my work, or just want to have a quick water cooler chat, I can come to Jeff. I'm grateful for his support and his ability to make me a more impactful riser.\n\n**Hannah Cheng:**\nJeff stands out as one of the most empathetic and kind colleagues I have worked with. He creates a safe space for me to ask questions and grow, and as an exceptional active listener, he is always willing to invest his time in pairing and brainstorming to help me overcome challenges. His mentorship has been instrumental in my growth as an Individual Contributor, ensuring my work stays aligned with Rise8’s core values. He doesn't just give answers; he shares his thought process to help me learn. Through him, I have adopted the valuable mindset of having \"strong opinions, loosely held.\"\n",
  "start_stop_keep": "**Bryon Kroger:**\nI just have one start: Start waking up every morning thinking about how you can make Rise8 the best in the world at design in govtech.\n\n**Brian Jennings:**\nThis is Brian!\n\n\n\n\nStart: Going into 2026, I want you to feel fully empowered to own/steer the direction of the design practice. You won't hurt my feelings by hitting the reset button on things or going back to the drawing board when you think things should change. Continue to trust your instincts and experience - avoid feeling paralyzed when you may not have full context of how things were done historically and own it now in your new role!\n\n\n\n\nContinue to push yourself to stay on the cutting edge of design practices and avoid practice/skill complacency - you've become one of our AI leaders in a short few months and are learning new practices and how to evolve them. I love how much you've dug in there - continue doing it and continue to seek out what the next evolution of our practices will look like.\n\n**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\n**Keep**\n• thinking about the end user and how our mission impacts them\n• engaging with users and being creative in how we create tools and services that provide impact and outcomes to the mission\n• doing amazing work that is based on the needs of the customer\n• thinking outside the box and how we can improve the flow for design and development\n**Stop**\n• working in isolation, I'd love to see what you are working on more often and communicate more if we are working on a project together. You do great work and I'd love to see it more often! Let's pair more often and let's get you up to speed so you can deliver your great ideas into production!\n• being so detailed, you tend to \"squirrel\" on various topics, so be careful getting too far in the weeds and pull back a bit to look at the big picture or the context of what we are currently talking about. I think you are naturally a detailed person, so this will take some time, but it definitely distracts you from understanding the goal or the heart of what we might be talking about. You want it to \"be perfect\" and that can definitely hinder you from delivering the \"good\" product that you have envisioned. The saying, \"Perfect is the enemy of good\" is something that comes to mind after having worked with you for a few weeks now. I love your desire to do excellent work, but don't let it distract you from shipping the already amazing work you've produced!\n**Start**\n• pairing more and seeking the help to get you caught up to speed on all things platform and production\n• sharing out what you are working on more often\n• digging in and becoming more technical, it will just take time and reps to get comfortable with the keyboard and CLI, but seems like that's going to be necessary for you going forward\n\n**Seehyun Kim:**\n- Continue cultivating a fun, supportive, collaborative, and inclusive design team culture.\n- Continue offering mentorship and guidance whenever possible. I love learning from you.\n\n**Nick Mendiola:**\nFor the next year, I would recommend that you...\n... **start** more vibe-coding projects! The work you've done with the scorecard is amazing! I'd love to help out on the next round. **** \n... **keep** up the great work with taking over the Design Lead role. I look forward to seeing how the Design practice will get even better at Rise8.\nNot sure what you should stop. I'm pretty happy with all the work you've done.\n\n**Hannah Cheng:**\nPlease continue bringing your authentic insights and high level of empathy to the organization.\n",
  "generation_timestamp": "2025-12-04 17:48:02"
}