{
  "employee_name": "Mike Gehard",
  "accomplishments": "1. Created a solid base of AI knowledge within the company and a culture of exploration of AI tools through the AI channel and office hours. This is important to allow Risers to figure out how to best apply AI to their projects.\n2. Enabled Risers to experiment with AI assisted software development in a secure way by creating the AI assistant container. This is important to make sure we are using AI in a secure manner.\n3. Provided leadership through people leaving and organizational change. This is important to make sure that the changes didn't leave something forgotten or undone.",
  "enps_comments": "**Bryon Kroger:**\nI've been so impressed with your growth mindset. I've said that a few times, including in public forum, but it's worth repeating. Diving deep on a new skill late in your career that upends many of the strongly held beliefs we all have... admirable. The only two things above that I think could be areas for improvement are \n\n\n\n\n1) working backwards from outcomes... this is something I am challenging all leaders to start doing much more formally. How are you going to move the needle at Rise8, what outcomes does it require, and then what activities and outputs? You started off with a bit of a firehose of resources and activities & outputs, which have definitely dialed back. But I think still some people are craving the why and that's stopping adoption. \n\n\n\n\n2) doing what is required... I think this is related but I feel like sometimes you want to avoid all the messy meatware... the very human things that have to happen for adoption. Especially when it ventures into irrational behaviors on the part of the consumer. I believe that growth in this area will be the ultimate unlock for you. You are so damn good at what you do. And unlike some engineers, you have the people skill. But skill *and* will are needed. Put those together, and there's no limit to what you can do inside an organization.\n\n**Tom Anastasio:**\nMike was assigned the **impossible task** of fundamentally transforming how Rise 8 approaches software development and positioning the company as a **cutting-edge GovTech leader** in the rapidly evolving world of AI. He has tackled this challenge with remarkable success and clarity.\nMike’s most defining characteristic is his **extreme pragmatism**. He consistently prioritizes the best outcome for Rise 8, demonstrating a strong willingness to **pivot away** from existing work or ideas—even his own—when a better path emerges, provided it doesn't compromise security. This flexibility and dedication to the company's success is invaluable.\nHis superpower is his ability to **find, turbocharge, and champion** the good ideas and experiments of others. He is excellent at providing support, celebrating those wins publicly, and efficiently sharing the learnings across the organization.\nMike is a **masterful user of AI tools**, integrating them into nearly every facet of his work while crucially maintaining an authentic **human connection** in all his interactions. His enthusiasm, clear vision, strategic path forward, and patience in answering questions have transformed even the most skeptical team members (like me) into **believers and champions** of the AI strategy.\nWhatever you guys pay him it is not enough lol\n\n**Carlo Viray:**\nI haven’t gotten to interact with you a ton this year, but every time we’ve worked together it’s been super easy and genuinely enjoyable. You’re always open, thoughtful, and willing to jump in wherever you can add value. When you were still in the Director of R&D role, you were someone I could depend on anytime I needed help with AI conversations or customer-facing discussions. You also stepped in on a couple of Growth opportunities, whether it was reviewing PWS documents, helping with coding or orals challenges, or helping shape the IRS staffing plan. I really appreciated that support.\n\n\n\n\nI’ll be honest that there’s definitely a gap when it comes to understanding government and government contracts, but that isn’t on you. That’s on me to give you the context you need so you can move confidently in those spaces. Now that you’ve shifted roles under Adam, I’m not always sure how to engage with you or what overlap you might still have with Growth, but I want you to know that everything you’ve contributed to Growth has been meaningful and appreciated.\n\n**Delaney Coveno:**\nMike is passionate and energetic about his work. He is always willing to jump in and help when needed, and will do the difficult things that are necessary to get the job done.\n",
  "start_stop_keep": "**Bryon Kroger:**\nKeep going ham on AI. Even though I'd have liked to see more adoption, there's no denying it's made a huge shift inside the organization. Huge. Also, keep having the hard conversations. I appreciate that you've come to me a couple times with hard conversations. And great feedback. Keep it coming.\nStart focusing on the people aspects. Why aren't people adopting? How can we change that? Part of it might be giving them the why by working backwards from outcomes and impact. And overcommunicating that.\n\n**Tom Anastasio:**\n- **Keep Doing:**\n   - **Keep pairing closely with teams to successfully integrate AI Vibe Coding tools and IDEs** into their standard development workflows. This focused, hands-on support is proving to be a massive game-changer in terms of productivity and code quality across engineering teams.**Keep applying your extreme pragmatism.** Your willingness to pivot away from sunk costs and focus purely on what is best for Rise 8 is a core organizational asset that enables us to stay ahead.\n   - **Keep being the \"turbocharger\" for others' ideas.** This unique ability to identify, support, and scale successful experiments is critical to fostering innovation and making Rise 8 a learning organization.\n   - **Keep advocating for the AI vision** with the same clarity and enthusiasm. You have successfully won over skeptics, and that evangelism remains vital. *This is one of the most impactful things you do and I am not sure you even realize it.* \n- **Start Doing:**\n   - **Start designing and implementing fun, low-pressure, and hands-on workshops** aimed specifically at non-coding staff. While adoption of AI tools is high among developers, a significant portion of our non-coder population is still intimidated or too busy to meaningfully learn. Making these sessions enjoyable and accessible will drastically reduce barriers and improve organizational AI literacy.\n\n**Carlo Viray:**\n**Start:**\nThis one is hard for me because I don’t have full clarity yet on your new role or how often our work will intersect, but I do think it would be great for us to stay aligned on AI. Growth really needs a clear and accurate stance when talking to customers, and your input helps a ton in making sure we’re not saying things that aren’t grounded or consistent.\n\n\n\n\n**Stop:**\nHonestly, I don’t have anything concrete here since we haven’t worked together closely enough in your new role for me to see patterns that need to stop.\n\n\n\n\n**Keep:**\nKeep providing your perspective on AI and helping us shape Rise8’s overall point of view. I’ll still be leaning on you and Bryon to guide us on what’s real, what’s possible, and what we should be saying to customers. Also keep helping with the technical side of interviewing candidates, especially the solution architect roles we’re trying to fill for Growth. That’s new for me, and I appreciate being able to depend on you for assessing the deeper technical skills.\n\n**Delaney Coveno:**\n- Start: When working on a team (even for a short time), it would be helpful to be explicit about practices and responsibilities. \n- Stop: I find it hard to keep up with everything that is posted on slack - keeping messages more brief where possible might make them more impactful.\n- Continue: Promoting use of the AI assistant dev container. I don’t know where adoption stands, but I think it’s an incredibly powerful tool and would be great to make the default development environment for Rise8. Continue to approach your work energetically and passionately.\n",
  "generation_timestamp": "2025-12-04 17:48:04"
}