{
  "employee_name": "Noah McHugh",
  "accomplishments": "1. TAK, even if we don't win, what we were able to do in 7 weeks is crazy. Helping us win exciting and new work.\n2. Diving into the DPL role, I feel like I just dove in head first and got to know everyone and did my best to get my knowledge up on every aspect of our practice. \n3. I'm not sure what #3 would be, these last 5 months have been a blur and whirlwind with change, diving into contracts that need help, starting and managing new efforts. Next review I'll be able to say \"CMMC certification\"",
  "enps_comments": "**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\nI definitely would rehire Noah, but didn't put \"strongly agree\" as I don't know that this role (and the past role) is something he'd want to fill again. I think he is an A Player, but might not be in the right seat, for what he's wanting and skilled. I have loved working with Noah and think he's at the right company, but he will do what's required and will fulfill his requirements as he's great at doing what's necessary.\n\n**Branden Van Derbur:**\nNoah is awesome to work with.\n\n**Derek Dombek:**\nMy time with Noah on TAK and at the offsite was a tun of fun! Since the moment he came in as my deputy practice lead he has been nothing but supportive and understanding of all the somewhat wild situations I've been in and not only that, when we actually got to work together on something we seemed to gel real well on how we went about things. Both our mentalities are: \"just get it done with quality\" and not over stress about the things that don't matter and we worked pretty fast because of it. I have nothin but good things to say about Noah and truly believe he is the perfect person for the companies CISO spot!\n\n**Kevan Mordan:**\nNoah possesses exceptional foundational knowledge in platform and security architecture. His grasp of the high-level technical landscape is a major asset to the organization. However, for him to fully mature into this leadership seat, he must be more proactive with team enablement and involvement.\n\n\n\n\nHe needs to be more proactive in guiding junior engineers and teammates and communicating their progres. Growth in this role looks like vocalizing his standards and performance expectations. This led to unintended issues with how our pipelines were created in Gitlab. To show true seniority, he needs to become a force multiplier—ensuring his knowledge and skills aren't just captured in memo's or written guidance, but active performance evaluation and active mentorship and clear, sometimes difficult, conversations.\n\n**Kyle Dozier:**\nI think the thing I appreciate most about Noah is his blend of competency, confidence, and humility. He is not intimidating or imposing, he's chill and puts people at ease. He's the leader you never knew you had, but it would immediately miss should he leave. I have enjoyed working with him closely on TaK, and also across various internal infra efforts.  I don't have a single negative thing to say about Noah and I hope I get to work with him more in the future.\n",
  "start_stop_keep": "**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\n**Keep**\n• being kind, helpful, thoughtful, and always willing to share what's going on\n• always being willing and excited about getting the work done, doing what's required. I love this about Noah! He's always willing to help and take on what you ask him\n\n\n\n\n**Stop**\n• being distracted during meetings. I think you have a lot going on in the background from what I'm guessing, and it distracts you from giving in-depth answers and responses, and doesn't necessarily come across as being present\n\n\n\n\n**Start**\n• being more honest and candid. You tend to be open/honest to me, but I'm not seeing the same candid and openness when you are speaking to others on the same topic.\n• speaking up more. You are knowledgeable, smart, and work hard. We need to see this more from Noah, and would love to see you speak up and share out this expertise and input that you have in there. Don't hide, take charge, get that courage on and deliver!\n\n**Branden Van Derbur:**\nStart:\n- No Notes\nStop:\n- No Notes\nKeep:\n- Being cool, calm and collected during pairing in challenging scenarios\n- Pushing for excellence and efficiency from Risers\n- Sharing your experience and knowledge with those around you\n- Encouraging risers to face challenges\n\n**Derek Dombek:**\nStart: Influencing others to focus on what truly matters. I feel you're already doing this but there seems to be a ton of noise at times on things that come off important that just are not and I think if someone could make it aware, maybe it'll change how we work from team to team and a company as a whole.\n\n\n\n\nStop: This one was hard because I'm a big fan of how you operate. I'd rather you not stop anything you're doing but I would say don't be silent with anything you have critical thoughts on. I value the way you go about things so much that one moment of you ignoring anything would only make us go backwards.\n\n\n\n\nKeep: Keep being you! The way you are is how things are getting done. Also, from out interactions you are super kind and never hard to work with. This creates for a great team dynamic that I would work with again in a heart beat. So keep being a great person!\n\n**Kevan Mordan:**\nStart - Delivering \"Real-Time\" Feedback**,** giving direct, constructive feedback immediately after observing an issue\n\n\n\n\nKeep - Technical Excellence, continue setting the high bar for platform stability and security architecture.\n\n**Kyle Dozier:**\nKeep: Leading with humility, putting people at ease, driving us forward.\n",
  "generation_timestamp": "2025-12-04 17:48:04"
}