{
  "employee_name": "Adam Gardner",
  "accomplishments": "**1. Force Multiplication for Under-Allocated Teams** I identified a group of engineers who were allocated too early and lacked direction, and I proactively scoped meaningful R&D work for them. This converted potential \"bench time\" into demonstrated value, de-risking future delivery and reinforcing Rise8’s reputation for **outcomes over hours**. (i.e. onboarding an automation team and the path of creating golden path through evolving hello world app)\n\n\n\n\n**2. Strategic Turnaround using \"Mission OS\"** I successfully stabilized a difficult stakeholder relationship by shifting the conversation from tactical execution to strategic alignment, utilizing Rise8’s *Mission OS* and *Path to Production* frameworks. This elevated the engagement from a standard vendor relationship to a trusted advisory partnership, ensuring we solved the **right problems, not just the easy ones**.\n\n\n\n\n**3. Accelerating Decisions through Clear Communication** I leveraged accessible analogies to demystify complex technical architectures for non-technical DoD stakeholders. By bridging the gap between engineering complexity and mission impact, I reduced \"fear of the unknown,\" built stakeholder confidence, and **enabled faster decision-making** in a risk-averse environment.",
  "enps_comments": "**David Croney:**\nAdam brings an excellent knowledge of engineering practices and systems design. He has a strong bias for making progress and pursuing action directly which is extremely helpful for the teams that he is on. In general, he could also likely benefit from providing early intervention and guidance to less experienced teammates. He is one of the most proactive team mates I have seen in terms of offering his time to pair. I think the next level of this is in directly intervening and course correcting team mates when he sees this opportunity.\n\n**Steven Bair:**\nI've had the pleasure of viewing Adam's leadership and delivery abilities as both a member of the Portfolio and Tiger/FWS teams on FORGE. He is a strong contributor who brings a strategic mindset to client interactions, effectively leveraging Domain Driven Design to solve complex problems and coaching others on how to use the tools more effectively.\nCulturally, Adam embodies the value of Keep It Real; he is always willing to ask the hard questions that others might avoid, ensuring we get to the truth of a problem. He pairs this boldness with a commitment to creating strong documentation that elevates the entire team’s understanding. Furthermore, Adam demonstrates exceptional emotional intelligence. He is adept at \"reading the room\" and uses that empathy to lead excellent workshops and facilitate meetings where every voice is heard.\n\n**Joshua Pritchett:**\nAdam demonstrates a high degree of autonomy and can be trusted with complex projects. He's have faced several challenges over the last few months and have shown strong perseverance, all while maintaining a positive attitude. He consistently focuses on doing what is right, balancing the needs of the organization with a strong sense of personal integrity.\n\n**David Alvarado:**\nI being new to the company, on a new type of project for Rise8, made of mostly new hires, Adam was a solid team member and a solid example how Rise8 operates.\n\n**Jerod Culpepper:**\nAdam quickly adapted to a new team and problem space where he had limited prior experience, yet he consistently engaged with the work and made real contributions. He also championed XP practices such as a weekly goal that helped keep the team focused.\n",
  "start_stop_keep": "**David Croney:**\nStart: Speaking up and pushing back on clients/partners whenever needed, when you do this it is effective and I believe there is more opportunity for you to feel comfortable providing direct feedback in these situations. Use your experience to provide more explicit direction to less experienced engineers when needed.\nStop: Don't feel you need to hold off on providing feedback to teams or clients as your insight is strong and needed.\nKeep: Your bias for action and support of your team members, it's a great asset to have in terms of maintaining momentum on your team. Helping your teammates maintain their focus on meaningful outcomes as the top priority.\n\n**Steven Bair:**\n- Keep driving hard on training others in the Rise8 culture and best practices. Your expertise in D&F and DDD is a massive asset—continue to share this knowledge to elevate others.\n- Keep bringing empathy to facilitate collaborative discussions. Your ability to sense how others are feeling is a superpower that helps bridge the gap between technical execution and human collaboration.\n- Keep relentlessly driving to deliver outcomes quickly. Continue your practice of getting something in front of people, gathering feedback, and making necessary pivots to ensure we are always doing what works.\n\n**Joshua Pritchett:**\n- Keep applying your exceptional diligence and thoroughness to your work. Your commitment to high-quality outcomes is a major strength and is deeply valued.\n- Keep to demonstrating your willingness to learn and grow. It took courage to dive into this new, complex effort without having all the skills upfront, and your commitment to learning is fantastic.\n- Start**,** when given a complex project, to break it down into \"knowns\" vs. \"unknowns\" to help the team and stakeholders set clear, achievable goals from the beginning.\n- Start to leverage leadership and the wider team as a sounding board earlier in the process, especially when feeling stuck on ambiguity. Bringing others in to help set goals isn't an interruption, it's a valuable part of collaboration and keeping everyone aligned.\n- Consider how \"analysis paralysis\" might be a source of stress. It's okay to not have every answer upfront, your ability to figure things out as you go is evident.\n- Consider reducing the pressure to have a complete, perfect plan before you begin. On a complex project, that's a tough standard for anyone to meet. Try focusing on what it takes to begin, identifying the key risks and unknowns that need management, and balancing your natural thoroughness with the need for speed.\n\n**David Alvarado:**\nApart from definitely please keep on being such a solid team member, I hope to work with you more in the future.\n\n**Jerod Culpepper:**\nStart - Trust your expertise and feel confident being the final sign-off for your work. Getting feedback and input is valuable, but it often felt like you wanted someone else to “sign off” so you wouldn’t get blamed if something went wrong. You consistently do great work, own it and let yourself take credit for those wins!\n\n\n\n\nStop - Nothing specifically comes to mind. Keep challenging yourself and stepping into bigger roles as you grow.\n\n\n\n\nKeep - Working hard and staying engaged.\n",
  "generation_timestamp": "2025-12-04 17:12:01"
}