{
  "employee_name": "Cory Hurlbut",
  "accomplishments": "1. Being local to the customer and having access to SIPR has been helpful to reduce the limiting factor of SIPR development as well as help get me up to speed on the project.\n2. I have been able to learn a lot about the project from interacting with the customers in person, which has helped to onboard quickly and have a more thorough understanding of the account.\n3. I drove development to add a feature that allows users to revert a report status when dismissing a report. This eliminated potentially incorrect information displaying to the user.",
  "enps_comments": "**Dan Bitter:**\nCory is new on this team but has showcased his abilities to learn a new platform, persist through obscurity, and think critically. He commonly speaks up to point things out that don't make sense or to offer his perspective on ambiguous situations. He impressively built a multi-state income tax calculator in Warp Core as a way to learn the platform, completing it in a relatively short time.\n\n**Mases Krikorian:**\nIn an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year\n\n**Evan Mladinov:**\n“In an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year”\n\n**Abel A A Hernandez:**\nCory is one of the newest members of our team, as an Engineer he seems eager to lear and competent. I can't speak to some of the other categories since I have only worked with him for about two months and some of those aren't things he is directly exposed to or responsible for at this time in his role and career.\n\n**Roshni Bhanderi:**\nCory continues to grow as a contributor and shows a strong willingness to learn. He demonstrates initiative by reading docs to help him troubleshoot through foundry issues. With continued experience and confidence, he is on a path toward taking on more complex work.\n\n**Kyle Smart:**\nCory is a very solid employee that gets the job done, despite the fact that he has only been here for 2-3 months. Willing to get hands on quickly and work on any tasks that he believes he can tackle. Has no issues with admitting he is lacking knowledge in something to ensure the job gets done correctly.\n\n**Danny Benson:**\nI would enthusiastically rehire Cory because he has demonstrated rapid growth, strong initiative, and a consistently positive impact on the team. Despite being new to the project, he ramped up quickly, stepped confidently into unfamiliar areas, and showed a willingness to ask questions and learn without ego. His professionalism, work ethic, and strong customer-facing presence has made him a reliable contributor. \n\n\n\n\nCory has already proven that he elevates team performance and helps us deliver outcomes more consistently. With his continued growth in collaboration and feedback, he will only become more effective. He is exactly the kind of teammate who makes a team stronger, and I would welcome the chance to work with him again.\n\n**Lambo Lamberson:**\nCory has done well learning Warp Core and adapting to the different tech stack.\n\n**Becca James:**\nI have had limited interaction with Cory and do not have sufficient context to perform a complete review.\n\n**Riya Patel:**\nn/a\n",
  "start_stop_keep": "**Dan Bitter:**\nStart\n- Giving feedback to teammates when necessary. I haven't received any from Cory, and I know I've caught myself leading pairing instead of passing the baton, or working on something that could be paired on without being in a Google Meet.\n- Consider turning your webcam on from time to time. My webcam usage varies, and tends to be off more than it's on, but it allows \"conversation\" even while muted with facial expressions and body language. Your clothing, home decor, and random background items can spark the water cooler conversations that we usually miss out on since we're remote. I've personally like having video on for stand up and usually having it off the rest of the day.\nStop\n- I've noticed Cory will pause or use filler words while putting his thoughts together. I also have to work on this - I've found keeping a GDoc journal of my activities each day has helped me organize my thoughts before the next day's stand up, and I can quickly and succinctly give my update. I also try to gather my thoughts when formulating an answer by saying \"I got you, I'll take a minute to think about this\" if I feel I need a longer pause. \nKeep doing\n- Being a great development partner. You search documentation when I'm driving and running into trouble, you gained a great amount of Warp Core knowledge by building your pro dev projects, and you think about the bigger picture when we work through things.\n\n**Mases Krikorian:**\nIn an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year\n\n**Evan Mladinov:**\n“In an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year”\n\n**Abel A A Hernandez:**\nStart increasing your curiosity about the objectives and key results (OKRs) for the software we are building. Your effectiveness will significantly increase when you are more aware of the \"why\" behind the problems we are addressing, leveraging your existing deep domain knowledge to contribute not just as an engineer, but as a subject matter expert (from the years you served). \n\n\n\n\nKeep demonstrating your initiative by pairing with teammates and diving into new work. Since you started, your consistent willingness to jump into tasks, whether to learn or to lead, has been noticeable and highly valuable. Please continue to engage with the work without hesitation.\n\n**Roshni Bhanderi:**\n**Start**: Be more proactive about picking up tickets, especially those that offer opportunities for problem-solving and technical growth.\n**Keep**: Taking the time to read documentation when stuck and continuing to build platform knowledge.\n\n**Kyle Smart:**\nI really like how thorough you are at note taking and getting the file structure down for SIPR and NIPR environments, and how easy it is to pair with you on stories on OSIT. It is concerning when it gets really quiet on your end as its hard to help with what you are working on.\n\n**Lambo Lamberson:**\nContinue growing in your understanding of Warp Core and identifying ways we can improve our products.\n\n**Becca James:**\nStart: Voicing your opinions in team settings. Your position's perspective, especially co-located with the customer, is valued!\n\n**Riya Patel:**\nn/a\n",
  "generation_timestamp": "2025-12-04 17:48:00"
}