{
  "employee_name": "Darius DeSpain",
  "accomplishments": "- Led the planning and execution of the largest and \"best\" (according to Bryon Kroger) offsite in company history to develop 1 to 1 connections between Risers across the company.\n- Proved Viability of Rise8's Team Model & New Enterprise Deployment Path\n   - De-risked Palantir Foundry for USSF leadership by proving that an XP-based, fullstack Rise8 team could successfully deliver a re-architected high-profile application on the complex, low-code platform.\n   - Pioneered the first \"code low, deploy high\" path-to-production on JWICS by establishing a reusable enterprise deployment pipeline using Palantir's Marketplace, unlocking this capability for other teams.\n- Accelerated an unprecedented new USSF path-to-production by partnering with the Bifrost (Apollo/STRATFI) team as the primary SureFire SME, contributing critical application specifications and co-authoring the System Security Plan (SSP) to unblock their ATO timeline.",
  "enps_comments": "**Tom Anastasio:**\nDarius is an exceptional A Player who operates as a true anchor for the team. He consistently demonstrates a highly pragmatic, kind, and humble approach. Qualities that often exceed even high expectations. His ability to maintain deep context, identify his own blind spots, and drive complex work almost single-handedly is phenomenal. He routinely handles challenging coding deliverables alongside meta-strategies for software migrations, security coordination, and stakeholder management. He is a driving force on the team and clearly embodies the Rise8 values, consistently performing far beyond his fair share of the typical anchor workload.\n\n**Alex Berner:**\nDarius is a Best in Grade Riser through and through, a true A+ player. He consistently over delivers in every area, whether internal or external, technical or strategic. He has had a really challenging year having to assume so many extra responsibilities on Starfox and he stepped up to the absolute fullest. Not only is he a technical leader for all of Section 31 that has garnered recognition from portfolio leadership, but he is a curious, empathetic, and strategically minded individual who cares deeply about the mission and his own growth. I would fight to have Darius on every team I'm ever on in the future\n",
  "start_stop_keep": "**Tom Anastasio:**\n**Start** - Being more confident and less self conscious about how your team perceives you. \n**Continue** - To ask for and give specific value feedback. \n**Continue** - To care more about just coding. Being genuinely interested in the users is your super power many devs lack. \n**Continue** - Communicating with leadership about what your team needs to succeed, especially with non-Rise8 contractors and sensitive situations .\n\n**Alex Berner:**\nStop letting any intrusive impostor syndrome thoughts chip away at your feelings of self worth. Actions speak louder than words and you have consistently demonstrated your ability to be the best of the best. Carry that confidence with you and challenge those around you to be their best, even if it means having hard conversations and uncomfortable feedback sessions. Your deep core values of empathy and respect will never allow you to become an asshole, so swing a little more towards aggressive accountability in order to grow your presence as a leader\n",
  "generation_timestamp": "2025-12-04 17:48:01"
}