{
  "employee_name": "Kevan Mordan",
  "accomplishments": "SpOC - delivered OSIT MVC founded on strong DDD principles that led to it's successful acceptance by users while enabling discrete data classification tagging for releasability to coalition users; ensuring its data can be used by all mission areas and partners.\n\n\n\n\nTAK Prototype - led delivery for a prototype that can win a significant SOCOM engagement, first ever Rise8 AI model training engagement and native architecture builds; also using to to further educate and build out Rise8 practices\n\n\n\n\nSWE Community of Practice - built out a lot of SWE material, DDD exercise template, sweRise, etc",
  "enps_comments": "**Jeff Wills:**\nKevan's technical prowess and hard work and get it done work ethic is second to none!\n\n\n\n\nKevan cares deeply about doing the right thing for the client and Rise8.\n\n\n\n\nSpOC OSIT launch would have failed without him and TAK wouldn't have built such a great app. He's already digging in and running fast with Ventures.\n\n\n\n\nAreas of Growth\nSometimes Kevan says, \"I don't care how you do it\", when he does in fact care.  I think the solution here is keep caring just be honest with yourself and those around you about what you actually care about.\n\n\n\n\n\"Perfect is the enemy of good\" - Voltaire.\n \"Would you rather be right or successful?\"\nThis is one I still struggle with, and I think Kevan does too. I think there are some things you can let go of and still see success.  Very rarely is there an ideal situation, but to acknowledge it, mitigate it, and move on.\n\n\n\n\nThe to items above I think create some friction for Kevan and people not accustomed to the directness and passion.  I know that Kevan has been passing stuff by me and Gemini for tone to help ensure his true intent is heard.\n\n\n\n\nReflecting, maybe I pushed back on this or didn't act fast enough, but I think we could have avoided the SpOC relational problems if we had moved faster to swap personnel.  Push me harder next time if I was the problem, or suggest a personnel change sooner.  You may have, but I know we waffled a bit too.  You really did advocate for the team to leadership, even though some of the relations soured. I think would make it easier for me would be understanding when you're just frustrated and when you want to replace someone.\n\n**Becca James:**\nKevan is a high-value member of the Rise8 team. He has work ethic, tenacity, dedication to the mission that position him as a team leader on any team that he is part of. He leads with strong opinions that often prove themselves, building confidence with customers at any seniority level.\n\n**Noah McHugh:**\nNothing but great things to say, excellent leader, excellent developer, just a great person all around. A joy to work with and am personally in awe of what you're able to produce in the amount of time.\n\n**Jeff Rodanski:**\nYou're an A+ player. Keep it up!!\n\n**Jennifer Van Hove:**\nI have really enjoyed collaborating with Kevan as a DPL and look forward to working with him as a delivery lead.  He has a very pragmatic, results-oriented take on any given situation.  Not sure, but he might be allergic to ineffective or broken processes. He's willing to challenge existing patterns and processes to try a better way, he has constructive feedback, and he understands and deconstructs the way team dynamics impact the project.\n",
  "start_stop_keep": "**Jeff Wills:**\nKeep pushing hard and pushing us to technical excellence.\nKeep checking your tone so you ensure you're intent is heard.\n\n**Becca James:**\nStart: I have seen Kevan excel at execution and taking instruction/guidance and running with it. With his skills I believe he can begin to own strategic shaping in partnership with our customers -- a behavior that I hope his role as a Delivery Lead will encourage.\nStop: In his capacity as a Delivery Lead it will be even more important to understand how to craft feedback and collaborative critique so that it is received positively and beneficially. In the past, Kevan has had a tendency to act himself rather than coach others through. I have experienced Kevan's coaching and have personally found it kind, but the delivery doesn't always land that way with others. In short, I suggest slowing down and building patience for behavioral change.\n\n**Noah McHugh:**\nJust keep doing what you're doing, you're absolutely killing it.\n\n**Jeff Rodanski:**\nStart thinking about how to evolve the Rise8 delivery process using AI. This could help with future service offerings and set you up as a leader in certain types of projects (like TAK)\nStop - Not really a \"stop\", but I’ve noticed that when someone makes a mistake, your reaction can jump to the extreme, which can create more fear or urgency than the situation calls for. Nothing to \"stop\" at this point but keep that in mind as a Deliver Lead going forward.\nKeep getting feedback on how to continuously improve, especially as you become a leader within your new role as a DL\n\n**Jennifer Van Hove:**\nI feel like the DL role is going to give all of us an opportunity to experiment with how projects work and see what ends up being effective. If you try an experiment, I'd like to hear about it!\n\n\n\n\nJennifer\n",
  "generation_timestamp": "2025-12-04 17:48:03"
}