{
  "employee_name": "Norman Sharpe",
  "accomplishments": "1. **Spearheaded Discovery and Initial Delivery on the New EM&C/Narrowband Project:**\nI quickly onboarded into the complex EM&C domain, learning new technologies like Go and our K8s deployment to help pave a pathway for delivery in a highly technical problem space. I led the technical delivery of our first major epic, the Event Monitoring System, from requirements to completion. For Narrowband Mission Workup, I grounded our work in user needs by leading an onsite visit with our user base, which provided invaluable data that directly shaped our product strategy. This discovery work combined with technical leadership and anchor roles/responsibilities enabled my team to go from user requirements directly into shipping our mission workup application, which we not only have been able to perform early demos, but are projected to deliver into production with OA 3 months ahead of schedule, and possibly achieve outcomes in prod in 120 days.\n2. **Delivered Key Blitzar Enhancements and Executed Critical Migration:**\nI drove the delivery of several high-impact features for the Blitzar application, focusing directly on user outcomes. I implemented a bulk data import feature to reduce manual entry and updated export functions that dramatically cut down user group processing time. I also delivered the critical Metrics functionality, which enabled our product team to quantitatively prove our success in reducing page loads from minutes (using legacy JIST) to seconds (using Blitzar).\n3. **Led and Deployed the RiseU AI Chatbot:**\nI identified an opportunity to enhance our internal knowledge sharing/Riser upskilling and took the initiative to build the RiseU AI Chatbot. I managed the entire lifecycle, from initializing the repository and implementing the OpenAI integration with RAG, to deploying the bot into our production slack environment. I then successfully demoed its capabilities to leadership, aligned on a rollout strategy, and continued to add significant value by integrating iRise video content processing, transforming it from a concept into a valuable, education/engagement tool for the company.",
  "enps_comments": "**Ben Adinata:**\nI would enthusiastically rehire Norman. He is an excellent anchor who leads by example. He takes responsibility not just for the code, but for guiding the team to build the right thing the right way.\n\n\n\n\nA great example was his push to get our product to OA by the end of this cycle. He championed that decision to ensure we actually shipped software, even when external factors made it difficult. He is great at aligning the team on what matters and consistently pushes us to grow, both technically and in how we work.\n\n**Chris Wang:**\nNorman is a critical anchor for the team. His diligence in managing stakeholder and company requirements, his reliability, and his willingness to manage upwards and protect the team's focus are all invaluable. He consistently does the hard work that keeps the team stable and able to execute.\n\n\n\n\nAs two people who often serve an \"anchor\" role on projects, our strong perspectives can sometimes lead to clashes. At the same time, this dynamic often provides a tempering balance.\n\n\n\n\nMy rating isn't Strongly Agree because of the significant friction and team impact caused by the communication patterns listed in the feedback below (the tendency to railroad, be dismissive, etc.). I am confident that as he continues to improve on the soft skills, he will move from being a valuable contributor to a truly exceptional leader.\n\n**Drew Fugate:**\nNorman is a high-impact engineer who consistently demonstrates a deep commitment to user value and technical excellence.\n- **Outcome Driven & Proactive:** They go above and beyond to understand the problem space, as evidenced by their initiative to conduct solo on-site visits to the local RSSC. This gathered crucial context that directly improved our development speed and quality.\n- **Technical Rigor:** As an anchor, they set a strong standard for the team regarding TDD and code quality. They ensure we don't overcomplicate technical implementations while maintaining high reliability.\n- **Areas for Growth:** While their output is excellent, their collaboration style can sometimes create friction. They occasionally lead conversations toward criticism rather than understanding, which can stifle team discussion. However, given their drive and technical capability, I am confident they can adjust this to become an even more effective leader.\n\n**Seehyun Kim:**\nI really appreciate Norman’s initiative, which has unlocked several opportunities for our projects, including direct access to Narrowband planners. He embodies Rise8’s values in the way he works and encourages others to do the same, which I admire. Norman is incredibly smart and consistently brings critical perspectives, not just on technical matters, but also on strategy and overall project success. Working with Norman has been both inspiring and impactful for the team.\n\n**Shubham Goel:**\nNorman has been a fantastic teammate and an essential anchor for our Narrowband team. He brings a high level of competency, calm leadership, and an enjoyable personality that makes working with him both productive and fun. He consistently answers the question of the day, keeps the team energized, and contributes to a positive environment. As our dev anchor, he has played a critical role in guiding us through the technical feasibility of the Narrowband foundation, ensuring we stay aligned, grounded to the SAR data, and building on a strong foundation as the team has gotten onboarded. His feedback for product during Narrowband demos and facilitation is consistently thoughtful and actionable, helping shape implementation choices in meaningful ways.\n\n\n\n\nI also  appreciate Norman’s push to get our Narrowband code into prod as quickly as possible. His urgency and ownership have contributed to our ability to deliver solid code with strong momentum. Norman’s effort in championing Gather was also impactful; encouraging that collaborative office space helped the entire team communicate more fluidly. Beyond that, he demonstrated strong initiative by providing his previous RSSC contacts when we were waiting on a SME connection, enabling us to secure a user session far earlier. He also went onsite twice to RSSC PAC, validating SAR workflows and gathering valuable tracker documentation that helped accelerate team understanding.\n\n\n\n\nNorman is a natural leader at Rise8. His lightning talk on cyber attacks was excellent, and I encourage him to continue leaning into those leadership qualities - expanding his influence through more talks, Loom videos, or sharing insights with the broader engineering org. He brings  humor, proactiveness, and reliability to the team. While Norman’s movement-first”approach is often highly effective, taking a step back to occasionally analyze the broader risks will make his leadership even stronger. Overall, Norman is a pleasure to work with and a great contributor to our success.\n",
  "start_stop_keep": "**Ben Adinata:**\n**Start/Stop:** The anchor role has a lot of responsibilities, and I can see that it causes you stress. I recommend you start delegating more of those tasks to the rest of us and stop trying to carry that entire burden alone. It will help you focus on the bigger picture and give the rest of the team a chance to step up.\n\n\n\n\n**Keep:** Thank you for listening to the feedback I gave you about pairing. The improvement has been great, so please keep that up. Also, keep pushing the team to deliver results; that drive is incredibly valuable. Finally, I really appreciate that you explain the reasoning behind your decisions when we pair. It helps me grow as an engineer.\n\n**Chris Wang:**\nStart: Basing your technical arguments purely on objective mission needs. You have sharp instincts and strong opinions. The next stage of your growth is to consciously separate \"what I personally prefer\" from \"what objectively works best\" for the team or customer. I've sometimes seen you advocate for a particular framework, pace, way of doing things, etc. because it's what you like or have become accustomed to. To truly \"do what works,\" we should filter out our personal preferences and comfort levels.\n\n\n\n\nStart: Practicing active listening to demonstrate understanding of another's perspective before responding**.** Your insights are sharp, but they will have a greater impact if you first explicitly acknowledge the other person's point, e.g., \"So what I'm hearing you say is xyz.\" This serves a dual purpose: ensures that you're accurately hearing the other person, and also provides a natural pause to gather your thoughts and bring to mind more perspectives.\n\n\n\n\nKeep: Serving as the team's anchor and advocate. You take on a huge amount of work that keeps the team stable, on track, and protected. This includes your diligence in delivering on Rise8 artifacts, but just as importantly, your willingness to manage upwards and push back on requests that don't align with our goals. This  protects our focus and momentum. Your reliability here is what gives the rest of the team the foundation to get things done.\n\n\n\n\nKeep: Your growing self-awareness, particularly in discussions. I have recently seen you pause, take in new information, and even adjust a position you just took. This is a remarkable and difficult skill. It builds immense trust, as it shows you are committed to finding the right answer rather than just being right. Please keep cultivating this.\n\n\n\n\nKeep: Observing the impact of your words. You've made visible progress in recognizing that other people's perspectives are valid, even if they differ from your own. This shift makes you a more effective and persuasive collaborator. Continue to lean into this.\n\n\n\n\nStop: Providing unsolicited career advice to teammates. This can come across as presumptive, as we may not all share the same career goals or paths. It's more helpful to wait until someone asks you for that kind of guidance.\n\n\n\n\nStop: Thinking out loud and dominating the conversation. Oftentimes, your train of thought carries you for minutes at a time, and it's a challenge for others to interject. This can have the effect of \"railroading\" the discussion toward your solution before others have had a chance to speak.\n\n**Drew Fugate:**\n- **Keep:** Please keep your ambitious, proactive approach to understanding our users. Your willingness to get out and engage with RSSCs and the broader EM&C team is a differentiator. It brings a level of reality and urgency to our work that is invaluable. Continue to seek those opportunities.\n- **Start:** I would like you to start practicing \"inquiry before advocacy\" during group discussions. When you hear an idea from a team member that you disagree with, pause and ask clarifying questions to understand their intent *before* critiquing. Shifting your tone from \"critical\" to \"inquisitive\" will prevent conversations from feeling like \"your way or the highway.\" This grace is essential for maintaining a psychologically safe environment where the whole team feels comfortable contributing.\n- **Stop:** I would recommend you try to take a step back from wearing the PM and Designer hats. While your product instincts are sharp, trying to control every aspect of the solution can create friction and adds unnecessary stress to your plate. Trust your teammates to own their domains. By letting go of some of the design/product nuances, you will free up your mental bandwidth to focus completely on what we need you for most: leading our technical implementation, solving complex engineering problems, and fostering shared technical knowledge.\n\n**Seehyun Kim:**\n- I’ve seen you actively listening and offering insights beyond what’s spoken. Keep doing this. Teammates with different communication styles or pacing can still provide valuable perspectives that strengthen the team's work.\n- Keep providing constructive feedback in a kind and thoughtful way. Your observations are sharp and valuable. Framing your feedback with your intention and the support you aim to provide to the reciever will make it even more impactful.\n- Keep your passion. Your enthusiasm for the project inspires the team. Even though this project is challenging and less glamorous, your drive is contagious and reminds us that our efforts are making a meaningful impact beyond the immediate users.\n\n**Shubham Goel:**\n**Start:**\n– Sharing his expertise more broadly across Rise8through additional lightning talks, Loom videos, coaching other engineers, or documenting insights that elevate the wider engineering community.\n**Keep:**\n– Bringing positive energy, humor, and team-building that makes working with him enjoyable.\n– Acting as a strong technical anchor ensuring feasibility, alignment, and delivering high-quality implementation guidance.\n– Providing fast, actionable feedback during product demos and pairing sessions.\n– Demonstrating urgency and ownership, such as pushing the team toward production readiness and securing RSSC user access proactively.\n– Embodying the proactiveness, initiative, and reliability that make him such a key teammate.\n– Continuing to assess risks and trade-offs before moving forward; adding a strategic “zoom-out” layer will strengthen his already strong leadership instincts.\n",
  "generation_timestamp": "2025-12-04 17:48:04"
}