{
  "employee_name": "Peter Duong",
  "accomplishments": "Obtaining access to KM IL6 tools like Grafana has helped the team increase our observability into logs and metrics. We deliver excellence through Blitzar to our users, measuring our impact and shipping outcomes.\n\n\n\n\nAs we displayed Rise8's work performance through Blitzar, we were able to gain the trust and respect of EM&C. This supported the EM&C contract award to Rise8, resulting in the addition of 2 more teams within EM&C.\n\n\n\n\nPartner with the Nebula team, where we had to migrate a feature from Blitzar over to Mission Workup. This was a last-minute request from EM&C at PI8 in hopes of supporting Blitzar's competitor JMT because there would be no way for JMT to seamlessly integrate with the rest of the system. We were able to deliver the capability in the limited timeframe that was given, showcasing Rise8's ability to move fast and deliver, Rise8 teams work as a single unit and not just individual teams, and that we are dedicated to the mission, helping out a competitor of Blitzar for the mission to be successful.",
  "enps_comments": "**Ian Sperry:**\nI would enthusiastically rehire Peter because he is a foundational technical pillar for the team. He brings a unique combination of technical excellence and collaborative leadership that significantly boosts our collective capabilities\n\n\n\n\nPeter consistently tackles our most complex technical challenges , exemplified by his leadership in defining and executing the crucial user migration plan. He takes full ownership of his responsibilities and outcomes.\n\n\n\n\nHe does not just solve problems; he raises the team's ability to solve future problems by leading efforts to gain new competencies in unfamiliar codebases and languages. This aligns with the expectation to empower others to create outcomes.\n\n\n\n\nPeter proactively seeks opportunities for personal growth and team support, demonstrating a high degree of adaptability and ownership. His willingness to move through uncertainty and volunteer for tasks involving ambiguity and discomfort, such as attending PI planning and presenting to unfamiliar stakeholders, shows his dedication to doing what is required for the mission and embracing the growth mindset.\n\n**Darla McGraw:**\nPeter is a truly well-balanced and influential Riser who consistently operates at or above the expected level of an A-Player. He is a key driver in how we approach both strategic planning and tactical execution.\n\n\n\n\nThis year, his impact was demonstrated by his proactive leadership and ability to represent our team both internally and externally. He successfully steps in to lead and present in front of the customer and other vendors for PI planning, as well as demonstrating exceptional commitment to organizational success by volunteering to split his time to serve as an embedded engineer and SME for the Mission Workup team, helping them successfully complete an urgent and critical piece of work. This cross-team contribution showcases his value not just to Rise8, but to the customer.\n\n\n\n\nTechnically, Peter acts as a force multiplier with a relentless focus on outcomes in production. He actively champions cutting-edge practices, notably pushing the team to incorporate AI concepts into our daily development practices to maximize delivered value. His focus on derisking technical choices and maintaining a strong empathy for the user experience ensures that all outcomes are reliable and precisely meet user needs.\n\n**Nick Eissler:**\nI strongly agree that I would enthusiastically rehire this Riser for their role on my team. His leadership and technical skills have been huge contributors to our success on Blitzar and on the EM&C work. He’s great at bringing clarity to ambiguous problems, unblocking others quickly, and raising the overall engineering bar for the team. H was key to our success on Blitzar, for example leading our Mission Workup integration.  He led much of the implementation work and carried out the on-base checks in SIPRNet to make sure everything actually worked in production. In our recent work within Kahless he has been driving progress, securing merge permissions to enhance our teams velocity as well as spear-heading much of the technical discovery as we look to stand up an SMTP server within the Kahless ecosystem.  Peter is also values feedback greatly, ensuring the perspective of everyone on the team is valued.  Recently he led a retro on our past Blitzar work that helped the whole team align on what went well, what needed to improve, and how we can carry those learnings forward into future projects. His ability to facilitate thoughtful discussion and keep us focused on outcomes has been a huge part of our growth as a team.\n\n**Vin Foregard:**\nPeter demonstrates strong technical leadership, sets clear direction for the team, and consistently drives toward outcomes. During onboarding, he helped me quickly understand the system and explained the reasoning behind key implementation decisions in a way that made everything easier to grasp.\n\n\n\n\nAs our dev anchor, he holds the team to a high standard and pushes for clean design and quality code. The team naturally looks to him for guidance and architectural decisions. He leads by example, communicates clearly even when topics are complex, and creates space for open discussion so ideas can be shared freely. When work is complex, he walks through multiple approaches before choosing a solution, which helps the team understand the trade offs and reinforces good decision making.\n\n\n\n\nHe also took on significant responsibility, including driving into the SCIF to test the application and bring back insights that helped us move forward. He shows ownership, stays focused on the mission, and uplifts the team when energy is low. His presence brings clarity, confidence, and direction to the team.\n\n**Cason Brinson:**\nI would enthusiastically rehire Peter due to his commitment to leading the team, his technical problem solving, and his comfort interacting with users and stakeholders. As our technical lead, Peter has done a great job driving solution decisions, keeping the engineers aligned, and making the developer experience balanced and agile. He has deep technical knowledge and learns incredibly fast, which enables him to tackle any problem he faces. A perfect example was how he helped lead the team in the shift from Blitzar to BotanyBay, working with completely new languages and frameworks. Additionally, Peter is a valuable team member because he knows the right questions to ask and is always willing to talk to stakeholders to get things done. Overall, he is a crucial part of our team and I would enthusiastically rehire him.\n\n**Minh Nguyen:**\nYour proactive approach during our month-long cross-team effort on the ARA outcome was incredibly valuable, and it would not have been possible without your support. You quickly grasped our EventStorm artifact, which immediately translated into you leading a highly effective test planning and documentation effort. Your swift understanding ensured the test plan was correct and high-quality. Furthermore, your feedback and contributions during PI planning event were crucial, helping us to clearly present Rise8 values and alignment to the stakeholders.\n\n**Hannah Cheng:**\nPeter impresses me with his speed and resourcefulness. Despite joining us as a loaned engineer, he wasted no time utilizing resources around him to get started. He excels at bridging gaps; he proactively pulled me in to tie design reviews back to engineering stories, ensuring alignment. Furthermore, he is willing to take on unassigned work to support the team. A prime example was when he volunteered to draft a test plan in a specific client format, something the team lacked experience in, allowing the rest of us to focus on development.\n",
  "start_stop_keep": "**Ian Sperry:**\nKeep being the technical coach. He should keep driving the team's learning in new areas and mentoring people through those tough technical hurdles. That leadership is critical\n\n\n\n\nPeter should start formalizing the knowledge transfer from technical deep-dives (e.g., unfamiliar codebases). This could involve leading a dedicated internal workshop or documenting high-level design decisions on a wiki page. This practice will ensure his leadership investment is scalable across the entire organization. \n\n\n\n\nStop defaulting to the expectation that others will always present the team's work. His willingness to step into stakeholder interactions (PI planning, presentations) is a major step. For the next year, he should actively seek out opportunities to independently present compelling narratives of our technical accomplishments and roadmap\n\n**Darla McGraw:**\nGoing forward it would be great to see Peter continue to drive technical innovation by identifying and incorporating new practices (like AI) into our standard development workflows, maintain strong cross-functional engagement with stakeholders and users, including leading presentations, and to keep exercising empathetic mentorship. The guidance you provide to junior and mid-level engineers, balanced with the space you give them to grow, is essential for our team's growth and velocity.\n\n**Nick Eissler:**\n**Keep:**\nKeep delivering strong technical leadership and clarity in complex situations. Your work consistently moves the team forward.  Keep your openness to feedback and willingness to hear all perspectives.  It’s clear you value the input of other engineers, and that strengthens our team’s decision-making and culture.\n\n\n\n\n**Start:**\nStart putting even more emphasis on hypothesis-driven/data-driven development and making metrics a core part of how we make decisions.  This is something our whole team is growing into, and it's something I think we have been improving on since our learnings from Blitzar.\n\n**Vin Foregard:**\nTo increase his impact, Peter could start sharing more of his architectural thinking across Rise8 in lightweight ways, such as short write ups, walkthroughs in SWE Rise, or quick lightning talks. His approach would benefit engineers outside our immediate team and help strengthen engineering practices across the organization.\n\n\n\n\nHe often carries a lot of responsibility on his own, which works well, but finding ways to distribute some of that responsibility could help others grow into senior roles and create more shared ownership across the team.\n\n\n\n\nHe should continue setting a high bar for engineering quality and explaining his reasoning clearly. His approach to problem solving builds confidence and creates learning opportunities for others. The environment he creates makes it easy for people to share ideas, and his steady energy helps lift the team when momentum is low. I would like to see him keep doing that as a leader on the team.\n\n**Cason Brinson:**\nStart: Peter should start giving feedback to other more junior engineers more often to help with their growth and ensure they know what is expected of them. Peter has a lot of good insight as he has been a technical lead and has a lot of experience.\n\n\n\n\nKeep: Should keep leading the team and providing his knowledge in app architecture and solution ideas.\n\n**Minh Nguyen:**\n**Start**\nCollaborating more :)\nI do hope we get a chance to do another cross team collaboration effort similar to the ARA form, but maybe with Blitzar, or whatever you guys are currently working on being the integration point. We can start with DDD EventStorm between services.\n\n\n\n\n**Keep**\nBeing an awesome engineer and anchor for your team.\n\n**Hannah Cheng:**\nContinue being a positive pairing partner and sharing your GovTech domain expertise to help the team avoid pitfalls.\n",
  "generation_timestamp": "2025-12-04 17:48:04"
}