{
  "employee_name": "Pooja Jhaveri",
  "accomplishments": "",
  "enps_comments": "**Jesse Wilkins:**\nI would rehire Pooja for her role on our team. Pooja is a natural leader that has the ability to ask probing questions that drive out things that may not have otherwise been considered. She is technically adept and is continuously contributing to the teams conversations and providing valuable insights that help us move forward. She is action oriented and is quick to think what action the team can take to keep things moving.\n\n**Drew McFarland:**\nPooja is the engineering partner every designer hopes for but rarely finds. She has a unique ability to translate complex technical concepts into language that makes sense without ever making you feel like you're asking a \"dumb question.\" This creates an environment where I can focus on design decisions rather than fear of looking non-technical. She shows genuine care for our customers by engaging in conversations about what will actually work best for our customers. The psychological safety she builds through patient explanations and collaborative problem-solving unlocks faster iteration and better outcomes for the team. I'd request to work with Pooja on every team if I could. She represents the gold standard for what I want from an engineer on a team as a designer!\n\n**David Alvarado:**\nPooja has been great.  She is confident and has taken the anchor role and has run well with it.  As quick example, during a meeting with stakeholders, and with rise8 project traveling, she jumped in an answered questions from the stakeholder on Rise8's behalf.  I feel that she is a great teammate and integral to the project.\n\n**Jacobi Ayala:**\nI think Pooja shows a lot of potential for more growth and an ability to learn a breadth of tools and concepts that others at her level would struggle with. I would have her on my team again.\n",
  "start_stop_keep": "**Jesse Wilkins:**\n- Start: leading technical discussions at the team level and having a stronger opinion on next steps based on your technical expertise\n- Keep: asking probing questions and being the right amount of curious to get the job done without getting lost in the weeds and always being willing to collaborate and provide technical perspective.\n\n**Drew McFarland:**\n**START:** Scaling your communication superpowers beyond individual interactions. Consider leading workshops or creating resources that help other engineers develop this skill of explaining technical concepts accessibly. Your ability to bridge technical and non-technical perspectives is rare and valuable. Rise8 would benefit from you mentoring others or taking on more visible cross-practice opportunities where this strength can have broader impact.\n**STOP:** Being too polite when my ideas aren't technically feasible. I throw out big, sometimes unrealistic ideas on purpose (if all your ideas are technically feasible, are you really thinking big enough?) but I need you to call it out earlier when something won't work. Your kindness shouldn't stop you from telling me when an idea is technically stupid. That direct pushback saves us both time and actually makes our work better!\n**CONTINUE:** Making technical concepts accessible without condescension. This creates psychological safety that unlocks better collaboration and faster iteration. Your genuine customer focus shows up in how you engage with the work, and your approach to cross-fucntional pairing sets the standard for how engineering and design should work together. All of this compounds into trust that makes hard conversations much much easier. I wish I could take an engineer like you to every team!\n\n**David Alvarado:**\nPlease keep doing what you are doing 👍\n\n**Jacobi Ayala:**\nStart working on some side projects that incorporate niche things you want to learn or get exposure to. It can help with gaining deeper knowledge of the tool so you can wield it more efficiently.\n\n\n\n\nStop relying on ai agents TOO much. That's not to say \"don't use AI\" because I do use AI, but I think getting personal exposure to the technology you want the agent to spin up first can help you guide it towards the path you want to go down more effectively. Also, there is some value in trying to trouble shoot something by hand and understanding the error at a base level before turning to the agent and saying \"hey this is happening, what do you recommend to fix it?\".\n\n\n\n\nKeep learning and showing initiative to lead. I think you show a lot of potential as a senior lead if you keep expanding your knowledge and experience. Also remember to lean on your teammates. Don't get trapped into the mindset of \"I need to know all of this\". Teams are many for a reason. Everyone can be an expert in something different and we should all lean on each other and pull each other up.\n",
  "generation_timestamp": "2025-12-04 17:48:04"
}