{
  "employee_name": "Bryon Kroger",
  "accomplishments": "NA",
  "enps_comments": "**Jeff Muller:**\n(BTW, this is Jeff).  Feels like 2025 will turn out to be one where we focused on internal organizational development instead of making significant progress on identifying strategic opportunities at the HoldCo level.  Bringing in Max and Adam will be transformational if it improves delivery execution and leverages Bryon to focus on developing the relationships that will be necessary for strategic transactions.  Similarly, leveraging Jeff with additional contract admin (Christal) and financial modeling (new hire financial analyst) support will provide capacity to execute on strategic transactions.\n\n**Carlo Viray:**\nOf course I’m going to rate you best in grade for everything. You’re an amazing leader, mentor, and friend, and I’m all in for as long as you’ll have me and as long as I can keep contributing in a meaningful way.\n\n\n\n\nThe feedback I have isn’t really about you personally, but more about how I’ve been feeling lately and how those feelings show up in how I think about the company and how you empower the leadership team. Rise8 is definitely different now than it was when it was just me, you, and Matt — and then me and you — and then eventually the larger leadership group. I know you’re depending on me to lead Growth and to lead my people, and I take that seriously. But here are a few things I’m experiencing that I think are worth putting on your radar.\n\n\n\n\nFirst, if Marketing and Growth are expected to have an intense focus on increasing qualified pipeline, then Growth is naturally going to rely a lot more on Delivery support in Q1 and Q2 until the Growth Solutions Team officially stands up. Right now it feels like we’re putting a pretty heavy demand on Delivery with the new request process. I worry that the combination of their capacity and our need for fast qualification is going to create bottlenecks. I literally had to create a ticketing system just to request support from Max. Maybe that’s what it needs to be, and I’m always open to experimenting, but it’s something I’m keeping an eye on.\n\n\n\n\nSecond, this one is more of a general feeling. As we get bigger and expand the leadership team and the operating model, it feels like we’re getting slower at decision-making. We end up in “whose lane is this” mode more than we used to, and then we spend a bunch of cycles figuring out who owns what and what the next steps are. A lot of it feels like it comes from two places: people being at capacity and not wanting to take on something ambiguous, and people wanting to protect their teams. The first point about Delivery support is a good example of that tension.\n\n\n\n\nThird, I’m struggling to find A-player hires for Growth roles. I don’t know if it’s because we’re not sourcing enough candidates or attracting the right kind of people. I don’t know if I’m being too picky or if I’m scared to make the wrong hire. Or maybe part of me is afraid of giving up control to someone who thinks they can “do Growth better.” I’m trying to build this team in full alignment with how you and I see Growth and sales at Rise8, but it’s been tough, and I want to be honest about that. I don't want to let you down as we scale.\n\n**Jordan Dilworth:**\nThe passion and intelligence is undeniable.  You learn the fastest, you commit to actions, keep it real.  You do have a tendency to be heavily influenced by others and this creates challenges in that your influences change because of the volume of content that you consume, and the influences, be it Hormozi, Scaling Up, Corporate Rebels, Evan Carmichael, Jeff Bezos Narrative Memo or others are not always consistent and we're always trying to apply their frameworks to Rise8.  I have seen a lot of maturity and growth in you as a leader and a person since I started.  Opportunities still exist for us as a team to be further aligned on the vision and strategy, think 3-year picture of what we look like, and spend more time growing the business.\n\n**Kristin Pearson:**\nI guess it's possible for a founder to not maximize every category, but I feel fortunate to have a CEO that truly walks the walk and sets the example for everyone.  I appreciate your integrity, intelligence, and vision.\n\n\n\n\nI will say that sometimes I think all of us on the leadership team can get so focused on OIP and just getting the job done and hopefully displaying attributes like grit that we can forget things like gratitude.  I'm trying to remember to look for opportunities when expressing that is deserved, and I will say that in your position and coming from you, showing gratitude is extremely powerful.  I've seen how much that can mean to ICs, so just a nudge if helpful to remember this humble yet mighty tool in your leadership tool belt.  :)\n\n**Adam Furtado:**\nI'm so glad I made the jump to Rise8. I'm loving it and maintain the same fire I had on day 1.\n\n**Max Reele:**\nInteresting to answer about the CEO of the company, but to reframe, I would choose to work for you again and recommend other professionals I care about to work for you.\n\n**Joseph Andrews:**\nYes, I would rehire Bryon as CEO ;-). I'll provide additional context in the next section but I appreciate his passion and directness. I believe he is a thoughtful leader and has a clear vision for the future of Rise8. There are always going to be growing pains when you double the size of a company in less than a year but Bryon is never shy to ask other for feedback or give his employees a platform to ask questions or give opinions, this is a rare quality.\n\n**Mike Gehard:**\nBryon excels at setting bold vision and direction - the iRise videos are a perfect example of how his direct communication style rallies the company around our mission.\n\n\n\n\nTo maximize impact as we scale, I'd love to see more follow-through on strategic initiatives. For example, we introduced KPIs at Q2 offsite but pivoted at Q3 without closing out the originals. Establishing persistent KPIs with clear owners, regular check-ins, and visible tracking would help teams prioritize daily work and ensure initiatives reach completion.\n\n\n\n\nWhile I appreciate the high-agency, low-rules environment, we need more horizontal structure (between teams) to support our growth - specifically explicit initiative owners and clearer accountability for cross-functional work like recruiting support.\n\n**Jeff Wills:**\nSeems like I mailed this one in, but I did spend a good bit of time reflecting on each one.  Bryon really does set the example in all Rise8 values. He doesn't just lead on paper; he leads in practice. \n\n\n\n\niRise is always on point. He is there to support both teams and individuals whenever it's needed.  He doesn't prioritize the success of Rise8 to the detriment of A Players. He believes that the success of Rise8 is built on the success of our A players.\n\n\n\n\nI think Byron sometimes holds back his opinion to let others have theirs, which is great. However, I believe there are situations where it would be helpful if he clearly communicated his opinions.\n\n\n\n\nI sometimes git mixed signals from him on fire fast.  Bryon states fire fast frequently. However, I was ready to release some Risers (none for negligence, more so skills), and Bryon checked to see if I was sure. In one case, I kept the Riser.  This is a testament to Bryon's attention to the human element, but it does make me second-guess myself. Am I moving too slowly? Am I moving too fast? Always good questions to consider, but it makes it hard to know if I'm doing a good job on this front.\n\n\n\n\nBryon's drive and passion for some topics can create anxiety in some Risers because they don't understand the whole picture or what it will look like in practice.  I know some of the early sharing comes from the passion and vision he has for the future, which I appreciate.  I believe Byron's past performance in these areas should instill confidence that it will be beneficial for both the Riser and Rise8.  A Player scoreboard, as an example, is creating some anxiety in the masses.  I think there are questions about whether this is going to be public to all Risers?  Will A player's score take into account my Level, i.e., will I be ranked lower simply because a level above me contributes more? How will this work when I'm on a study or working a difficult client that we though was a good fit but infact wasn't?  Having a more detailed plan or a list of factors to consider before mentioning a \"big\" change will help Risers adapt more easily.  They often bring baggage from past employers that results in an anxiety response instead of a reflective response.  Byron's leadership and Rise8 have done right by us in the past and are likely to do so again.\n\n**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\nI would absolutely \"rehire\" Bryon to work on \"my team\" in the same role. Bryon's vision and passion for mission impact and making the world a better place is very encouraging and influential in the space in which we work. I love that he breaks the norm on what GovTech has done in the past for the sake and benefit of the warfighter and veteran. He cares for his team unlike any other CEO that I've worked for and it's wonderful to know that he's willing and ready to do anything for his teammates. This has been a shift in how I see company leadership as this is not the norm (but it should be!!) and I absolutely appreciate it. He shares out what it's like from a CEO's perspective but also gets down to earth on a personal level and genuinely works with the teams to help delivery and remove any major issues. He tackles major problems for the teams and looks out for them and the customer all the time.\n\n**Brian Jennings:**\nI love the organization you've built and are building and the big ambitious vision you have for us. I appreciate the dedication to outcomes, so much so than planning revolves around the impact we can create rather than the revenue we can generate. I love your open door policy for everyone, your candor and perspective when you share feedback with folks. I'm inspired by your thirst for growth, reading and wanting to be the best at everything. It sets the tone for the whole organization.\n\n**Rob Monroe:**\n- What we do, where we are heading, and with your leadership compass, is still the reason why I am at Rise8\n- Your radical candor and transparency are truly unique, please don't ever pull away from this\n- It's incredible to see how you're able to chip in and support so many different individuals and teams all at once. I seriously don't understand how you manage it all.\n- **Do what works** is the only thing that I'd like you to consider making an adjustment going forward. \n   - Even when we're certain that something is a root cause, contributing factor, or the solution we need, we should leverage those as opportunities to demonstrate what good looks like to Riser IC's and department leads. \n   - In recent months I haven't seen the leadership team as a whole demonstrating a curiosity-led approach with hypotheses that leverage data-backed decisions for solution, outcome and impact bets. \n   - Not doing this increases the risk of delivery teams wondering why they're held to a different standard. We can't just stop at we're doing xyz because it's obvious, or to just trust us, because we would never accept that from our delivery teams. If you believe we are doing these things well today, then I'd ask that we at least adjust our communication about these efforts. I like the OPSP for what it is, but it doesn't provide data or insights that led to certain constraints being prioritized over others or the hypothesis around a particular solution we're betting on over others. That clarity and transparency raises trust, engagement and willing support - things that get harder as we get bigger.\n\n**Jennifer Lopez:**\nBryon is a high-velocity, mission-driven leaders whose strengths in transparency, growth mindset, and rapid execution drive meaningful momentum for Rise8. There are opportunities to deepen alignment around user-validated impact, refine coaching-on-the-fly moments, and apply CEO-level leverage that motivates and stabilizes the team. Overall, his intent, integrity, and pace of improvement remain standout strengths.\n",
  "start_stop_keep": "**Jeff Muller:**\n(BTW, this is Jeff).  Kristin, Max, and Adam need to provide Bryon with the confidence that delivery execution is covered so he can focus both on how our product needs to evolve and get traction on the HoldCo strategy.  I think we need to be more explicit about what we want the HoldCo strategy to produce in 1-2 years and work back to determine how to execute.\n\n\n\n\nIt feels like we are making progress on our coms structure to make sure you are getting the data/info on regular department priorities.  I'm not sure we've yet figured out the reverse flow: regularly providing the leadership team with your sense of our strategic priorities on a cadence shorter than our quarterly offsites.  I think there may be an opportunity there that would strengthen alignment.\n\n**Carlo Viray:**\n**Start:**\nI know we’re supposed to come into the Q4 offsite with a vision and mission, but I still feel like Jordan and I don’t fully understand your strategic vision for how you want Rise8 to grow beyond outcomes and revenue targets. And I don’t mean the numbers — I mean the stance. The actual strategic call on commercial versus gov. The call on which agencies we should avoid or lean into. Right now we’re a little reactive because pipeline is small, so we say yes to IRS or yes to State because they show up inbound. But as we scale, we’ll have more actual choice, and I want to make sure we’re all aligned on the kind of company you want us to become.\n\n\n\n\nSame thing on scenarios like hitting revenue targets early and shifting focus to delivery quality. If we ever need to pause new contracts or push pipeline out, that has massive implications for Growth, and we’d need that clear direction from you. Another example is the return to Kessel Run, having your top-level stance upfront would shape how I build the strategy against it. Right now, I feel like I’m reacting to those conversations and making assumptions about what you want. I want more clarity so I can build the right path.\n\n\n\n\n**Stop:**\nI don’t know if there’s anything here that’s truly a stop. I get why the drumbeat matters to you, and I get why holding leadership accountable to intentions and follow-through is important. I think the meeting is just more of a status update than anything else, and that’s fine.\n\n\n\n\n**Keep:**\nKeep doing what you’re doing. Keep focusing on the people and the culture. Losing A-Players like Stefan or Graham hurts a lot. That stuff is painful. I appreciate how much you pour into people and into creating an environment where high performers want to stay. That matters, and people feel it.\n\n**Jordan Dilworth:**\nWhile I would like to provide feedback that says 'Stop trying to do so much' - you're superhuman and at such a higher level than even A-Players so this feedback may not serve you well as you're incredibly successful by doing so much.  It's inspiring.  What would be helpful though is the staggering of projects and priorities as communicated in slack 6 weeks ago about the impact each idea has on the organization below, and staggering sharing these ideas out to avoid chaos and uncertainty through the leadership group.\n\n\n\n\nKeep raising the bar and setting the example of what is possible.  You accomplish so much in 24 hours and find time for family.  Keep pushing Risers to do more and be better, both professionally and personally.\n\n\n\n\nStart giving clearer feedback.  There are examples of async feedback where the takeaway is 'I don't like this' and we don't know why.  This happens in google doc comments and then makes it hard to action so providing a bit more context in these examples would be extremely helpful to action and improve.\n\n\n\n\nStart making sure you've given the feedback or expectations correctly. You move extremely fast and do so much that there are examples where you think you have given clear feedback or expectations, but this is misaligned with what has been received.  I'm going to share a simple and specific example here as I think it's valuable.\n\n\n\n\nThe simplest example is reworking the case studies in the Kellogg format and the understanding was that a single IDIQ case study doc was to be reworked from an old version that Matt Nelson created to align to the Kellogg framework.  Done - easy peasy.  What was then later revealed, a day after we received approval from you on a case study that was not in the Kellogg format, was that ALL case studies were to be in this format, and that you thought you had been communicating that for several quarters and at offsites.  This literally blew our minds and was a shock to all of us (Carlo, Jordan, Rachel, Cara).  I use this example as there are more but it's a simple example to show that your perception is our reality, and sometimes there is a disconnect to what you perceive yourself to have communicated, and what has actually been communicated or received by the team.\n\n\n\n\nStart/Stop - I'd like to you to start asking harder questions to the new leaders more and really pushing them to  further rationalize their asks for investments, be it new roles and/or a dedicated office space in Rhode Island (with dinosaurs!). Are there are different ways to accomplish what they're aiming for?  Sitting in Montreal, it felt like the keys were handed to the new hires and supported all of their asks without deeper discussion around it and there were big investments in people, travel and office space.  Challenge all of us on our investments - and these seemed to go unchallenged.\n\n\n\n\nStart getting the leadership team together for more strategic time/strategic discussions.  We're all being pushed to be more strategic and yet the OPSP doesn't get into the vision of what Rise8 looks like in 3 years in terms of who our partners are (agencies), the types of engagements we're in (program of records, enterprise level). We know # of outcomes shipped, # of Risers and $, and adding a picture of what that looks like will help us work towards a clearer north star.\n\n\n\n\nStart/Stop - I'm excited to see what comes out of the Corporate Rebels seminar b/c this is about the forcing functions of the Scaling Up program and our weekly IPM meetings.  The meeting rhythms just haven't been productive and we're trying to maintain some piece of the Scaling Up framework but the Friday meeting and even Quarterly reports forces super tactical comms, which is the opposite of what you are hoping to accomplish.  It's created busywork that's not valuable.  The As-Needed leadership meetings have improved and those are proving to be the most valuable.  Cross collaboration between teams happens in between the meetings so figuring out the right cadence and purpose is still an opportunity.\n\n**Kristin Pearson:**\nI know you want to stay involved in many aspects of the business, particularly some customer-facing/account work.  I'm wondering how we continue to leverage you as your schedule only gets tighter (and that's even without the hold co being fully off the ground).  It could be helpful for you to be more specific on when/what you want to be involved in.  Hearing clearly what you don't need to be involved in is just as helpful as what you do want, especially if it's coupled with an endorsement for another go-to person.  Ex - \"I only want to get involved if x happens, otherwise, I trust y person to lead this effort\" sort of thing.\n\n**Max Reele:**\nStart: Trying to communicate about your open mindedness as it relates to the signals being received. I know you always think critically about all aspects of info you receive (example being the iRise where you said that you think about what conditions you've set to have someone believe that they need to lie to you instead of just being angry that they lied to you) but that's not always what gets communicated to us. For a recent example, but maybe not a great one, is when I communicated that Risers were referencing the Town Hall slide with L7 comp on it. You jumped right into correcting the logic, seeming a bit defensive to support your rationale for presenting what you did to the company, instead of communicating that you understood it to be a signal that Risers could be using the presented info in unintended ways. I feel confident that you think critically about all signals about how the company is running; communicating parts of that thought process could be really helpful for us. You do it well in iRise and you do it well when we get to talk 1:1, so maybe this is just a limitation in Slack (short form) communications.\n\n\n\n\nStop: Second-guessing decisions when you can catch yourself. It's very difficult to take indirect feedback like that and feel trusted to execute my job. It comes across as complaining about my (or my team's) performance as opposed to constructive feedback. I'd rather you tell me, \"I believe you made the wrong decision about XYZ and here's how I'd like you to approach it in the future.\"\n\n\n\n\nKeep: Encouraging all of the departments to be supporting the overarching Rise8 strategy and making us demonstrate it with value-based proposals. Please keep pushing harder on hiring practices to ensure we're getting the top qualified practitioners that can be found in our industry, at all levels. Also, keep pushing decision making to the lowest levels where confidence & growth can exist. These are all things that you already do well and can probably emphasize even more. They are top reasons why I was confident to come to Rise8 and why I love being on your team.\n\n**Joseph Andrews:**\nI struggled a bit with the format of this answer for you so I'm just going to do it my way and hope it has the same desired affect.\nKeep: Overall I appreciate your leadership style, you're direct when you need to be but you show empathy and vulnerability when your interacting in a live environment and I believe most of the Risers appreciate that. Clearly you care about the mission, vision, and values of our company and the relentless efforts to ensure we have the right people here that are A Players, this is an invaluable trait that you don't always see in CEO's. I appreciate that you are always open to feedback and listening to what others have to say.\n\n\n\n\nStart/Stop/Feedback: I'm not sure if this is a start, a stop, or more of just a bit of feedback... it may be a bit of all three. The company has been through tremendous change over the last 3 months with the addition of 2 new leaders/roles, A complete reorganization of our leadership team, benefit changes both 401k and Health, as well as the stress of changes in the Government and the effects they could have on our company. I sense the stress it has on all Risers and I do think that has lead to \"gripping the bat to tight\" in some situations, I imagine you see it as well. It might be worth addressing company on a company level, acknowledging the extensive changes we've had as a company this year. I do think these are all good changes but not everyone may feel the same way. Sometimes you do need to just rip the bandaid or break something so you can learn quickly and move forward but other times its valuable to hold, give things more time to develop, and see if people can adjust.\n\n**Mike Gehard:**\nStart:\n- Implement quarterly KPIs with designated owners and weekly check-ins that persist through the full quarter\n- Assign explicit owners to all major initiatives with visible tracking against goals\nStop:\n- Launching new initiatives before confirming previous ones are completed or explicitly closed out\nKeep:\n- Your bold, direct communication in company-wide forums (iRise videos) - this authentic voice perfectly balances boldness with inclusion and keeps us aligned on mission\n\n**Jeff Wills:**\nKeep doing iRise. I watched some interviews where the interviewer specifically called out that the CEO talks to us weekly.  It was clearly a positive for those Risers. I regularly hear Risers talk about it. While the talk doesn't always yield immediate results, it fertilizes the soil for growth.\n\n\n\n\nKeep pushing us forward, its uncomfortable at times but well worth it.\n\n**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\n**Keep**\n- caring about your staff\n- pushing the boundaries of what we \"should\" and \"shouldn't\" do in GovTech\n- repeating yourself and the mission of Rise8\n- making the world a better place!\n- doing iRise, speaking about both high level and strategic issues at the company. I love hearing about where the company is going and what's on your mind. It's a great time for the company to get a sense of where we are going and what we want to focus on this year\n\n\n\n\n**Stop**\n- sharing things with others in the company before you share them with leadership, I don't know that this causes problems with them, but I could imagine it might bring about a disconnected sense of unity or direction, if you are sharing something that hasn't been \"caught\" by the rest of the directors and C-Suite. You have every right to do this as the CEO, but I wonder how much the leadership might appreciate a head's up before sharing out certain information. Honesty and openness are great, but that lack of communication to those you are closest might bring about some friction (only guessing, not heard anything from anyone about this)\n\n\n\n\n**Start**\n- getting context for other Riser feedback in your 1 on 1s. The signals I'm picking up on are that when you receive feedback from Risers on other Risers, the timeline for when that feedback was given or assessed, needs to be verified if it is timely and if it has been given directly to that Riser from that Riser. Make sure it has been formally documented (possibly in Lattice?), verbally and given in writing to the teammate, and to the DL and/or EL as well. I've noticed a few of times over the last year where feedback was given to you, passed to me, and then I find out it seemed to be very stale, and I don't know if that Riser providing that feedback was questioned on if they had given that to others. For example, I've noticed that Stefan and Asare were/are great at giving feedback about other Risers (when they are not in the Riser in question is not in the room), but they really struggle to provide that same feedback to the Riser themselves, and in timely fashion. I've given these 2 Risers feedback on this and want to make sure they (and others) are following through with having courage and care to give that to those they are working with.\n- investing in a couple/handful of Risers that you handpick that you see and want to invest in that have potential for leadership. You have the A+ players you are meeting with 1 on 1, but what about a small cohort you choose to mentor/coach that could rise up in the near future for leadership positions? Call it the \"Hamilton Cohort\" or something 🤣\n- meeting with B/C players occasionally, not as often as your desire to meet with A/A+ players, but this might give you a sense of where the company is falling short. I know you meet with A/A+ players, but would there be any benefit to meeting with B/C players? I feel like it might be worth your time to get a glimpse of both ends of the spectrum\n\n**Brian Jennings:**\nKeep making yourself available to everyone in the org to come to for support, keep bringing a collaborative approach to how we solve customer problems together, keep sharing out company strategy to the wider organization so folks see where we are heading, keep trying to remove things (meetings, cadences, etc) that aren't working/aren't adding value. I really value all of these things that you do, please continue doing them!\n\n\n\n\nStart/Stop: I could use more clarity around medium-range company strategies - I understand where we need to be from an outcomes in production and revenue perspective 2-3 years from now, but I'm less clear on what big things we need to tackle in order to get us there. I feel solid on big vision and day-to-day execution, I also feel like I can align my work to our quarterly priorities well. I worry about not being ready for some of the bigger plays or longer-term strategies and want to ensure the work I'm doing is building up to prepare us for those. Example, if we do our first hold co acquisition in 2027, how do we spend 2026 preparing ourselves so that we can successfully execute on our first one? Not sure exactly what the start/stop would be as I'm not in the planning meetings but it's a current pain point I'm feeling that I believe you could help with.\n\n**Rob Monroe:**\n**Start**\n- Challenging folks to be data and curiosity led (set a 50 hypothesis experiment rep goal, per team, if you have to)\n**Stop**\n- None at this time\n**Continue** \n- Demonstrating all of the behaviors you're crushing as \"Best in grade\"\n",
  "generation_timestamp": "2025-12-04 17:48:00"
}