{
  "employee_name": "Jeff Muller",
  "accomplishments": "1. benefits reengineering - moving 401(k) to Fidelity; employee benefits through HUB; and LTIP.\n2. budget and forecasting - creating department based budgets and forecasts.\n3. contract administration - ongoing development of pricing model and contract admin while executing on short-term priorities.",
  "enps_comments": "**Bryon Kroger:**\nYou've been a great addition to the team and have really helped me rebuild in the last two years! The only thing I had hoped to see was a bit more of that integrator persona as it was defined... I didn't know where to place that above in the rating system, as it's a combination of a lot of factors. Specifically I'd like to see more driving of execution and metrics driven accountability. I'm actually curious to talk to you about this and find out what might be driving it, because when I got your referral from Brooke, she specifically called out how good you are at those activities. If it's something you can do and want to do, we should address blockers or issues. Or, if you'd rather, we can make that part of this new role we've discussed in operations. Either way, will be good to chat through.\n\n**Christal Walker:**\nJeff, thank you for the significant depth of knowledge you contribute to the team. Your outsider perspective and sharp business insights have been instrumental in generating fresh, new ideas. What truly sets you apart is your leadership presence: you convey strong conviction while remaining genuinely approachable. That rare ability to keep discussions light yet focused on key priorities is incredibly valuable. For those reasons alone, I would rehire you again and again.\n\n**Jennifer Lopez:**\nJeff has contributed meaningful work in areas such as budgeting, forecasting, financial modeling, and operational organization, and his recent transition into the CFO role appears to align far more naturally with his strengths. Challenges indicated in the above ratings reflect expectations of the COO position rather than his capabilities as an individual. In a finance-focused seat where structure, analysis, and steady execution are central, I have full confidence Jeff is better positioned to contribute at his highest capability. As he continues to grow into this realigned role, increased transparency, ownership, and proactive communication could potentially help strengthen collaboration across teams and support the company’s next stage of maturity.\n\n**Kristin Pearson:**\nSuch a solid Ops/Finance partner - thank you!  I really appreciate not just your domain expertise but how easy you are to work with.  Dependable, pragmatic, approachable...we are fortunate to have you on our team.\n\n**Carlo Viray:**\nI’m super appreciative of everything you’ve done for Rise8 and for me personally this year. You’ve been such a steady presence, and I’ve learned a ton from watching how you handle things. I’m especially impressed by your ability to navigate any kind of conversation — whether it’s giving hard feedback or negotiating with partners. Those are situations that honestly make me uncomfortable sometimes, so knowing I can lean on you when those moments come up is incredibly valuable. You’ve also been a huge help in deepening my understanding of operations and finance, and that’s made me better at my job.\n\n\n\n\nThe only bit of feedback I really have is that you’ve got a ton on your plate (understandably), and before Christal joined to help, it was hard to keep some of our collaborative tasks moving. It never really caused problems — it just sometimes took a few extra nudges or follow-ups. Overall though, I’m just grateful for how much you do and how consistently you show up for the company and the team.\n\n**Jordan Dilworth:**\nDefinitely a calming influence on the team and often the voice of reason.  Your experience is highly valued to keep us moving and grounded in the business objectives.\n\n**Joseph Andrews:**\nJeff gives me the space to get stuff done while stepping in with clear, practical guidance when I need it. He trusts the team to move fast but is always there to unblock, course-correct, or provide a little extra context, which keeps things moving and focused on outcomes. I really appreciate the autonomy and support he gives me. I would absolutely rehire Jeff for my team and leader for Rise8.\n",
  "start_stop_keep": "**Bryon Kroger:**\nKeep crushing it on the financials and general operations. This has been a godsend. One start would be to maybe start bringing us more into your world. Teach everyone about financial statements, how to read them, etc. and then go through it with us monthly. Assume they still can't read it and need a walk through and explanation of what matters and why!\n\n**Christal Walker:**\nYour contributions are essential to the team's stability and strategic direction. Please continue to leverage these strengths:\n- **Patience and Temperament:** You consistently demonstrate a patient and even-keeled demeanor, which is invaluable for maintaining team morale and stability, particularly during periods of change.\n- **Executive Translation:** Your ability to provide \"executive translation\" for strategic decisions and organizational goals to the team is exceptional. This clarity ensures that high-level objectives are distilled into understandable and actionable tasks for everyone.\n- **External Perspective:** Your insights, informed by experience outside the traditional government contracting environment, are instrumental in reinforcing how Rise8 differentiates itself in the market. This perspective is a crucial strategic asset.\n- **Commitment to Simplicity and Execution:** You have a clear strength in avoiding process over-complication. You take ideas and processes as they are presented, simplify where necessary, and execute effectively against them.\n\n**Kristin Pearson:**\nI'm interested to see how the organization of our leadership team evolves next year.  I think overall we have good enough comms, but I think you agree that there have been some pain points around cadences especially when there's been a decision to be made without a clear owner (you?  Jen?  BK?).  You have a great sense of what's needed, and I'd encourage you to be willing to get basic inputs and just make the call.  Or clearly designate someone else to make the call.  I love our general collaboration but also think we spend a lot of unnecessary time  on topics that could be relatively simple to just try something and see how it goes.\n\n**Carlo Viray:**\n**Start:**\n- Providing more near-real-time updates on revenue and margin KPIs. As we get more disciplined about tracking metrics, it would really help Growth and Marketing to understand where we’re at and where we’re forecasted more regularly. It’ll help us adjust our strategies faster and stay on track with revenue goals.\n\n\n\n\n**Stop:**\n- Letting your backlog get too burdensome and long, haha. I know there’s always a lot going on, but carving out space to get ahead of it might help ease the load a bit.\n\n\n\n\n**Keep:**\n- Jumping in to help the Growth team where it makes sense — it’s always appreciated.\n- Helping me and Bryon navigate the tricky partner and contracts conversations. You bring a calm, confident energy to those moments that makes a huge difference.\n\n**Jordan Dilworth:**\nKeep - looking for more opportunities to improve the customer experience of internal customers and stakeholders when it comes to the financial documents.  The budget documents are not used frequently enough yet by the Directors so familiarity and confidence in deciphering them is low.\nStop -  only sharing feedback that is passed along from conversations with Bryon.  Feedback on what you see and what you think carries a lot of weight so a Start would be to share more of your observations based on your experience.\n\n**Joseph Andrews:**\n**Start**\n- Share quarterly financial *wins* alongside the regular updates - quick, high-level highlights we can use in town halls (ie.. revenue/forecast beats, cost savings, hiring runway, and any wins that directly enabled mission outcomes), I'd love to see more of this.\n**Stop**\n- Continue to shift operational finance/admin tasks away from yourself where possible, rely on other to help more when you can. I think you're spread thin taking COO and CFO duties, I'd love to see your team grow.\n**Keep**\n- Keep giving autonomy while stepping in with clear, practical guidance when needed.\n- Keep being a low-drama unblocker, your calm demeanor keeps others level headed when things seem chaotic.\n- Keep prioritizing big-picture strategy and being available when we need escalation or direction.\n",
  "generation_timestamp": "2025-12-04 17:48:02"
}