{
  "employee_name": "Jennifer Lopez",
  "accomplishments": "1. **Reduced CEO Bottlenecks and Elevated Leadership Autonomy**\nWhen I started, nearly everything flowed through Bryon. By tightening boundaries, creating process friction, and prompting better preparation before escalation, I’ve helped the team engage him more strategically. The result: fewer interruptions, clearer asks, and stronger leadership ownership.\n2. **Created Visibility That Led to Key Hires and System Improvements**\nBy surfacing patterns in what consistently reached Bryon’s plate, I helped highlight where the company needed additional capacity and structure. That visibility directly influenced several key hires and prompted better proactive planning systems.\n3. **Expanded Executive Reach and Stakeholder Access**\nI’ve positioned myself as a trusted extension of Bryon’s office: representing him with professionalism and emotional intelligence in stakeholder communication. This access has allowed us to secure meetings and strengthen relationships that were previously difficult for others to initiate.",
  "enps_comments": "**Jeff Muller:**\nJennifer was spread too thin to take full ownership of leadership coordination and state compliance matters in 2025, but I believe we have solutions for both of those going into 2026.\n\n**Bryon Kroger:**\nIt's been a great journey so far! Couldn't have made it through 2025 without you.\n\n\n\n\nThere are two areas for improvement I want to focus on. \n\n\n\n\nFirst is working backwards from outcomes/impact. My Nov 15 slack message to you hit on this a bit, and in the past I have said that we can't get strategic because we are drowning in the tactical. I've also expressed several times that I believe it's because of how we are approaching task management and that we need a better way. Now I'm making that your number one priority in Q1... we must get to elite level task management in ClickUp. We need to couple that with strategic time allocation, using task management as a data source for time audits. \n\n\n\n\nSecond is challenging directly and providing quality feedback without making others feel like they aren’t cared for. There have been three times where you gave/received feedback to me in a way I didn't think was healthy. I called out each of those and (I think) we got to a good place. I've got thick skin and a lot of patience, and I also empathize. But I worry about it happening with others. It's not the way I want Risers to engage or the kind of environment I want at Rise8. I gave you feedback in those moments, and I'm happy to talk about anything anytime. I think is an area that is holding you back. It came up in your reference check, and it has come up with other team members. If you can overcome it, you could be unstoppable.\n\n**Jordan Dilworth:**\nYou are a master of organization and networking/connections and treating people well.  You get to know their name, who makes the decisions, telling them you have faith in them to make it happen and get it done and that you appreciate their work... it's fun to watch how you move about your day and get everything done, building relationships for the future at every step.\n\n**Carlo Viray:**\nThank you for everything that you do. Seriously, thank you for keeping Bryon on track and managing all the moving parts around him. You’re such a critical part of how things run here, and it’s obvious how much you care about doing things right and supporting the company. I’ve seen so many moments where you’ve taken on anything and everything, put your head down, figured it out, and got it done. You never complain, you’re always open to feedback, and you handle every situation with kindness and professionalism.\n\n\n\n\nThe only constructive feedback I have is that you don’t always need to take on tasks that are overly technical or outside your lane. A good example was when you were building presentation slides for a customer — that’s something others can and should own. Your strength is making sure the right people are accountable, not carrying every single task yourself. Also, if leadership ever hires EAs for each of the directors, you absolutely need to be part of that interview process because you get it. Every EA should operate the way you do.\n",
  "start_stop_keep": "**Jeff Muller:**\nBy 2026, I think Jennifer will have off-boarded both leadership team coordination and state compliance responsibilities, allowing her to focus on executive admin support for Bryon.\n\n**Bryon Kroger:**\nStart: Task management system in clickup in Q1. Time audits and strategic time allocation.\nStop: covered above re: feedback\nKeep: being my rock. I'm better with you as my EA.\n\n**Jordan Dilworth:**\nKeep: Showing up everyday and trying your best to stay on top of everything.  What you do is not easy, and you always show up with a smile on your face, a good attitude and you try to accommodate everyone - and it's only getting harder as we grow.  Maybe ask for a 2nd version of you?!  Keep being fun, loose and a total kick-ass, make it happen boss.\n\n\n\n\nStart: Trust to your teammates a little more!  Trust that we evaluate 100s of opportunities every year for Bryon and if we bring one forward, it's because we believe it's the right thing to do.   A few times this year, you've acted as another screener on opportunities that have already been screened and approved.  It can create confusion as to who the ultimate decision maker is and we try really hard to only bring opportunities to Bryon that we think\n\n\n\n\nStop: You're going to know exactly who this is from these and that's totally OK!\nA recent example.  The example is from the 2026 Offsite Playbook.It took 5-minutes to create with AI - which was great initiative by you - but the output was brutal b/c it didn't use the right inputs.  Your heart was in the right place, but the result caused a lot of re-work so a quick job turned into a big job.  It's okay to not insert yourself into the project if you're not the best person or you don't have the right information.  Or maybe pair with someone on it to make sure the right info goes in first to get the best output.\n\n**Carlo Viray:**\n**Start:**\nI personally miss being able to see Bryon’s calendar details since it helped me plan around him better, but I totally understand you’re trying to protect his time. If we can’t have that visibility, I’d love to have a better understanding of his priorities or backlog, especially how Growth-related tasks fit in. It would help me know how to adjust, or when I should just take something on myself to keep things moving. Also, help manage Bryon and the directors in leadership huddles when it comes to ownership and follow-through. Sometimes it’s hard to tell who actually owns what, and it would help a lot to have that clarity called out in the moment.\n\n\n\n\n**Stop:**\nFeeling like you have to take on tasks that Bryon is responsible for. If he doesn’t have the bandwidth, see if one of the directors or Jeff can pick it up instead. You don’t need to fill every gap yourself.\n\n\n\n\n**Keep:**\nFollowing up on actions, emails, tasks, and agendas that involve Bryon or require his input. You’re amazing at keeping things organized and making sure nothing slips through the cracks. That level of consistency and accountability is what keeps everything on track, and it’s something I really appreciate.\n",
  "generation_timestamp": "2025-12-04 17:48:02"
}