{
  "employee_name": "Carlo Viray",
  "accomplishments": "1. We secured our 3 largest contracts ever with FORGE, EM&C, and STRATFI\n2. Completed our first AI/ML project + prototype OT contract with TAK - got to showcase our ability here but bummed that the final demo was not what we hoped it to be\n3. Grew the Growth team - promoted Clayton and brought back Shanna which significantly helped in the capacity of what we were able to accomplish/submit for this year",
  "enps_comments": "**Clayton Spakes:**\nYou can tell a big difference in the shift from day-to-day work on the Growth team to strategic leadership this year. You do a really good job at keeping our team aligned and allowing us the space to learn and grow as we try new things.\n\n**Shanna Chen:**\nI didn’t realize how much I didn’t know until I started working with Carlo. He has an super deep knowledge bank, and learning from him has been a game changer. He truly invests in his people, and the culture he’s created is unbeatable. I know that working with him will set me up for success in the future. I trust him and Bryon\n\n**Kristin Pearson:**\nCarlo the GOAT!  :)  As always, I appreciate you for being an incredibly intelligent, hard working, kind teammate who brings the focus on setting delivery up for success that we need from Growth.  You make it easy to work through new ideas and initiatives, and I enjoy being able to quickly collaborate as we identify needs in support of process improvement and scaling.\n\n**Max Reele:**\nYou are a hard working teammate that is reliable and trustworthy to the highest degree. I can't say enough how much I appreciate working with you and feeding off of the zeal that you bring to our leadership team.\n\n**Adam Furtado:**\nCarlo has been super impressive thus far. For a CEO, the most valuable thing is knowing that you can \"outsource\" a portion of your strategy to someone you can trust to deliver. Carlo is off an running with little need for oversight as far as I can tell. Carlo has grown into a new role the past few years and I am 100% confident is the right person to be leading our growth efforts into the future. I honestly wish I had more constructive feedback to make this more useful, but I really don't. Improvements could be in the way of process improvements of how we collab with Delivery and enablement, but he has gone out of his way to start those improvements.\n\n**Jordan Dilworth:**\nCarlo is incredibly passionate about the mission and a great evangelist of Rise8's efforts.  He is also a genuine individual and a great person, which makes it difficult in providing some of the ratings as I want him to succeed and succeed with him.  In reviewing the above, there are opportunities to push more into areas where he's uncomfortable, such as pipeline development strategies, metrics/pipe metrics reviews and push to get more out of his team and upskill his team.  Carlo is unwavering in his pursuit of building a certain style of team with specific backgrounds, almost to a fault and it's challenging our ability to grow at the pace desired with the current skills and performance gaps of his existing team and how fast we're trying to grow.\n\n\n\n\nWe've taken some really strong steps lately with Pallas, Summit Strategy and Pipe Council, and soon to be Win/Loss retros - these indicators are positive and will help uplevel Carlo to the Growth leader he expects of himself.  If trends continue and these positive changes lead to a stronger team that drives deals vs. one that is currently quite passive and appear to be lacking confidence, and Carlo becomes a driving growth leader that demands more from his team and helps them upskill on sales strategies and navigating customer sales cycles to  openness , I would absolutely rehire for the Growth Leader role, but he's also excellent at something like a Sr. AE role vs. Growth Leader, especially with his background in software delivery at KR and S31 and understands Rise8, and that role would get a strongly agree rehire rating all day long.  The Growth Leader skills are still being developed and I think that's to be expected based on being relatively new to Sales himself (2 years), and now with new team members and the rapid growth of Rise8.\n\n**Rob Monroe:**\n- Always \n   - exploring how to improve growth and sales\n   - open to pairing or partnering on continuous improvement efforts\n   - patient and willing to educate others on gov tech, acquisition and RFP context\n- (More department feedback than for Carlo specifically) The timing and approach to pulling Risers into growth & sales events continues to be a jarring experience for me personally as a Riser. I know how long these cycles take, and how much total effort goes into reaching a contract award or rejection. I'd love to see how we could shrink the lead time and effort for these processes, so that we can ideally increase contract awards, or at a minimum reduce the effects of rejection\n- I'm wondering how we could reduce the barrier for customers to work with us, so that they feel the experience and are more likely to buy-in for larger contracts (is there a lower price point that we could offer workshops that dont require long contract acq cycles?)\n   - I'm also wondering if we're missing out on opportunities to work with commercial or private sector companies who share similar mission passions like Rise8 (e.g. lots of companies support Veterans in different ways)\n",
  "start_stop_keep": "**Clayton Spakes:**\n**Start:** Share our growth strategy more broadly across enablement and DLs. It feels like there is a gap in understanding the bigger picture of why we go after certain opportunities. \n**Stop:** This isn't a major thing, but I think more things can be passed off to Shanna and I. You handle a lot of the templates and things like that. We could take that over so you can focus on other things. \n**Keep Doing:** Setting clear direction and challenging us to grow. Giving more responsibility to the rest of team so that you can focus on strategic level things.\n\n**Shanna Chen:**\nYour change leadership really motivates me to keep pushing myself. You’ve built a team where I feel safe to speak up, and I think you should push us more\n\n**Kristin Pearson:**\nI think you know how much your voice carries clout in the company, and my only encouragement would be to remember that clear feedback coming directly from you can be really helpful at every level.  Whether it's a kickoff with a delivery team that isn't showing the right level of engagement or is botching a dry run, or if you ask for inputs that you think are important for Growth success and don't get them, or you have best practices ideas on how we're standing up new leadership functions, I'd encourage at least closing the loop to confirm someone is addressing the issue or always be willing to give direct tough love feedback.  Your voice can help reinforce what others are saying and is incredibly valued.\n\n**Max Reele:**\nStart: Looking for more creative ways to officially apportion growth support to specific Risers. This needs to be to worked with other directors since growth support can/should come from all other departments.\n\n\n\n\nStop: Posting screen captures of your text messages :). Just tell us the key takeaway for the convo.\n\n\n\n\nKeep: Challenging us to get better at setting our engagements up for success with better customer fit and understanding of our requirements.\n\n**Adam Furtado:**\n**Start:** I love the weekly looks at the pipeline.  That has been a great passive way to stay up to date with how things are going.  I'd love to see a little analysis along side that- even if a short 1-2 liner about how confident YOU are in us meeting revenue goals for the year. \n\n\n\n\n**Stop:** The ad hoc nature of supporting growth opportunities is very disruptive.  I know we are working through this and much of it is out of our control- but more of an organized system to support growth efforts would go a long way to limiting toil and churn on the delivery and enablement teams.\n\n\n\n\n**Keep:** Maintain the effort and urgency you've had! And keep communicating and keeping us aware of progress how you have been.\n\n**Jordan Dilworth:**\nKeep your positive attitude, willingness to learn and try new things, as well as your continued efforts of building your personal brand to grow Rise8.  That takes commitment and you've consistently delivered and grown your influence.\n\n\n\n\nStart taking on more ownership of the revenue numbers, metrics, insights and activities to drive the strategy.  Carlo has an opportunity to truly build the plan and know our performance inside and out and decide the balance of contracts at Rise between agencies and team size/structure. \n\n\n\n\nStart upskilling the team with sales training.  Traditional sales training is what it is, and it's always adapted to the environment after the training ends.  Taking more control of deals, threatening to walk away, playing your cards in certain orders, navigating the complex buying group - these are skills that are needed in B2B and B2G, and our team needs to learn sales tactics and then adapt so we don't upset customers.  The best Enterprise sales leaders with super complex buying cycles are LOVED, and yet they are ruthless.\n\n\n\n\nStop being afraid of 'more phone calls'!  It's been a running joke for a few years but we have to be comfortable opening doors that are currently locked.  It is required for him and his team and we struggle to balance reputation with activity.  I'm not sure of our competitive BD practices but would assume they're more aggressive - and then would wonder if that hurts their reputation or not.\n\n**Rob Monroe:**\n**Start**\n- See comments in #11\n**Stop**\n- See comments in #11\n**Continue**\n- See comments in #11\n",
  "generation_timestamp": "2025-12-04 17:48:00"
}