{
  "employee_name": "Jordan Dilworth",
  "accomplishments": "- Prodacity 2025 - except for the chairs.  It's a beast, and it was a well run, well promoted, well post-promoted and leveraged event.  Prodacity influences 31% of Rise8 deals (107 of 300+) - it's huge for us.\n- Building the Marketing Team.  Excluding the hiring miss with Jamey, bringing Marc in-house for Graphics in July, and hiring Vanessa and Sal (planned) and McKinnon (altered plan a bit) in September has had an impact on how marketing can support the overall Rise8 business in a few ways. \n   - First, we have more SMEs in-house which is a shift from being outsourced as we were tight with budgets and relied on fractional SME's and doing it all ourselves.  \n   - Second, it has freed me as the leader to get out of the tactical executions more and spend time more time with Carlo on pipeline and pulling him into the things we need to be looking at as we try to grow 50% year over year for 2027 and 2028\n- 1st ever Marketing Summit (Virtual offsite).  With the new team in place, it was time to get us all together, with our agency partners and internal Growth partners to identify SWOTs, Messaging Opportunities, Strategic Priorities and draft OKRs.  \n   - This will help in role and priority clarity among team members, and among leadership as to what Marketing is focused on, why and how\n   - Of 10 respondents, average score of 8.2/10 on overall satisfaction with the Summit (a great start for our first!) and lots of good feedback for lessons learned in [this form](https://docs.google.com/spreadsheets/d/1EQ2VxiIejtcmUV0OBAJw5Mk6T-BsuycZdU2LM5ccq7M/edit?usp=sharing).",
  "enps_comments": "**Rachel Del Vecchio:**\nWe've had some moments of tension lately but there's still no one else I'd rather have leading this team.\n\n**Marc Fishman:**\nJordan exemplifies what it means to be a team leader. He is fair, focused, and fearless. I've seen him make hard choices, and \"rally the troops\" while still being empathetic. He always has outcomes in mind, and the greater good in his sights. He is open in his communication, and he's made me personally feel \"heard\" and \"seen\".\n\n**Cara McLean:**\nI sincerely appreciate Jordan's leadership and the opportunity to not only observe how he's grown and developed the Marketing Team, but to also be a member of it. In addition to being mission obsessed and gritty, Jordan continuously demonstrates a growth mindset. He emphasizes not only individual professional development, setting the example in his daily actions, but also encourages the team to be bold, innovative...and fast. Jordan demands the best and always does it with kindness. 100% A Player as illustrated by 11/11 Best in Grade ratings above.\n\n**Carlo Viray:**\nI really appreciate having you at Rise8. I’ve learned a ton about marketing and sales because of you, and I genuinely enjoy working with you. I think we’re entering a really pivotal stage in the company, and I’m going to depend on us working super closely together as we figure out how to take Rise8 to the next level.\n\n\n\n\nI shared feedback in the marketing summit survey, but I do want to reiterate that I think we need a third-party facilitator for sessions like that, the same way we know a facilitator works better for our quarterly offsites. I’m not sure the summit was as valuable for me personally as it could’ve been, and that might just be something you and I sync on separately. I also wasn’t sure if the expectation was for us to help shape your vision and priorities or if it was more for us to understand the direction you’re taking.\n\n\n\n\nI’ve already given similar feedback to Clayton and Shanna around giving your team direct feedback, asking for feedback from them, and being better teammates when it comes to truly collaborative projects. I'd expect you to tell your team to do the same instead of you having to feel the need to escalate something to me to then go back to my team on. \n\n\n\n\nI think the way marketing projects are currently structured sometimes makes everything feel transactional where Marketing owns the entire project, then tasks get pushed to Growth, and when we get pulled into proposals or live deals, it feels like we’re dropping your priorities. I’m not sure ClickUp is helping. I think we need a clearer, shared view of priorities so we’re not trying to get through everything at once and falling behind. Maybe we do a ruthless prioritization exercise specifically around what Marketing needs from Growth.\n\n**Kristin Pearson:**\nI really appreciate Jordan's talent and character and feel lucky to have him as a teammate.  It's been incredible to see what he's handled over the past year, particularly the strategic vision to handle a huge budget and department growth as well as turning shifting visions about huge company events into reality.  Well done!\n\n**Vanessa Ten-Kate:**\nKeep giving the team the autonomy and trust to move projects forward—that support and confidence really helps us do our best work. Continue setting clear communication and expectations so each person understands their role and what success looks like. And keep helping us stay focused by making priorities explicit and being comfortable pausing lower-priority items. That kind of clarity lets us focus on what truly matters without feeling stretched thin by more projects and requests than we can reasonably take on at once.\n\n**Sal Aziz:**\nJordan demonstrates strong, strategic leadership with a clear focus on planning, team alignment, and proactive problem-solving. His actions include organizing and driving a detailed 2026 Marketing Strategy & Planning summit to establish clear objectives and a comprehensive campaign calendar. He actively champions strategic knowledge-sharing, as seen in his forwarding of external insights on high-level meeting preparation and sharing prospect-facing documentation for team awareness. Furthermore, he successfully delegates key strategic discovery work, like taking the lead on exploring industry analyst engagement, demonstrating trust and empowerment of his team members.\n\n**McKinnon Pearse:**\nYes, I would rehire Jordan without hesitation. He brings a strong strategic vision, a growth-oriented mindset, and a clear focus on tying marketing action to measurable outcomes. He effectively steers the team, keeps the organization aligned with sales and business goals, and ensures that marketing initiatives contribute directly to pipeline and revenue growth.\n\n\n\n\nI’ve observed that he provides feedback in a calm yet forward manner, and is always willing to put in the extra work to make a program/product better. This commitment to quality, long-term results, and organizational success seems to be a hallmark of his leadership style. Working with him has already helped me understand how to balance strategic thinking with tactical execution, and his guidance and vision has accelerated my own learning curve in this new role.\n\n**Bryon Kroger:**\nOn \"working backwards from desired mission/business impact, creating alignment while rapidly testing hypotheses about outcomes and outputs\" I think we've talked about this at length re: getting more strategic. I will say, I have seen some really positive signals in the last 60-90 days in terms of growth in this area. Excited to see the 2026 strategy.\n\n\n\n\nOn \"takes full ownership of the results without making excuses or shifting blame\" I gave you feedback about this before, and have seen a lot of improvement. There are still times, though, when the pressure is really high, especially in public, that you shift responsibility or make excuses. You don't have to do that here. But again, it's been a huge improvement. Your confidence is 8x. Awesome to see you grow in this area.\n\n\n\n\nOn \"viewing the challenges as opportunities to learn rather than to complain or give up\" I've been wondering... are you legitimately conflicted on growing into VP, or are you giving yourself an out to give up? Only you can answer that question. But I can tell you that I believe you can do it.\n\n**Jennifer Lopez:**\nJordan has had an exceptional year. He operates with high autonomy, puts our values into action, and leads his team with a combination of kindness, grit, and consistent delivery. His ability to take feedback lightly, apply new ideas quickly, and motivate his team through both friction and momentum makes him one of the most dependable leaders in the organization. As he continues to broaden his knowledge of the market and company-level strategy, his impact will deepen even further. Overall, Jordan is a high-output, high-integrity, people-centered leader that I would enthusiastically rehire.\n",
  "start_stop_keep": "**Rachel Del Vecchio:**\nStart:\n- Trusting your team more on the nitty gritty. It's more valuable to have your support and enablement from the top. Set us up for success, let us run with it, and help us make sure we we have what we need as the process goes. This will keep your head above the forest focused on the strategic things and leading us where we need to go rather than down in the trees (and in copy docs suggesting subject lines 😉)\n\n\n\n\nStop: \n- \"Pushing\" - This is something you've said a couple of times.. Your job is to \"push the team.\" I personally don't love that framing and don't respond particularly well to it (as you may have noticed).  Your job is to lead us, from the front, from the top. If we're straying, then that means there's misalignment and we need your clarity, your context, your empowerment, your help reassessing priorities, not brute force. \n\n\n\n\nKeep: \n- Being our champion in leadership circles and having conversations about trade-offs when the \"good idea fairies\" strike.\n\n**Marc Fishman:**\nPlease continue to make 1:1 meetings with each team member a priority. Don't like the boats drift too far apart from the main ship.\n\n\n\n\nKeep helping the team define individual roles — so the laneways become clearer between *product*, *program*, and *brand.*\n\n\n\n\nPlease consider adjusting the \"Creative Brain Trust\" meeting. While the notion of a purposefully nebulous meeting to get into deep thought on the brand and creative opportunities is admirable... it's *too* nebulous. While I believe the intention is sound, the execution has been muddy at best. I would sooner suggest a monthly 90 minute session — that allows for actual deep conversation and ideation to occur, vs. the current 30 minutes where there's awkward silence and confusion on what all would even been possible to discuss in the time allotted (when the meeting doesn't already get immediately hijacked into more pressing project discussion).\n\n**Cara McLean:**\nStart Doing: no recommendations at this time\n\n\n\n\nStop Doing: believing in \"five minute\" tasks, BUT do still encourage the team to time block with discipline to work to those self-imposed limits\n\n\n\n\nKeep Doing: thinking long-term and aligning the team on the same. The Marketing Strategy Summit was a fantastic opportunity to integrate relatively new members and get us all rowing in the same direction, partners included. The best is yet to come!\n\n**Carlo Viray:**\n**Start:**\nIf we’re planning to turn up the volume on pipeline generation, I’d love to work together on ways to automate more of the qualification process so we’re spending time on the right opportunities, not just any opportunities. It’s more important that we drive the right pipeline than just hit a number with deals that aren’t worth pursuing.\n\n\n\n\n**Stop:**\nI think the approach we’ve taken with ABM and outbound has been a struggle. The messaging hasn’t been landing, and the cold email strategy is risky. We need messaging that’s empathetic and aligned with the Rise8 way, not something that feels like it was AI-generated and gets us blacklisted. The last thing we want is someone’s first impression of Rise8 being a cold email to a Colonel filled with attachments they didn’t ask for. The RB2B outreach hasn’t been effective either. We need to rethink outbound in a way that feels authentic to who we are, not just doing it because we were told we need outbound metrics.\n\n\n\n\n**Keep:**\nKeep pushing for more demand and inbound. Being able to shape customers before a deal ever hits the street puts us in a much stronger position than trying to force-fit ourselves into every competition. Even when we do compete, having agencies proactively reach out for market research is a way better signal than having no contact at all. The more we can build those relationships early, the better our chances of winning and delivering meaningful outcomes.\n\n**Kristin Pearson:**\nI'm excited to see the next level of Marketing awesomeness your expanded team can drive.  If I had any suggestion, it would be to just look out for maintaining the ease of coordination with your team that we've been spoiled with.  I appreciate being able to say \"here's what I need\" or \"let's ideate on x topic\" to your team and always having that outreach lead to way better thoughts and outputs than I could come up with on my own.  It would be great to keep that going without everyone outside Marketing having to learn each new person's role in depth and spend cycles navigating who and how to reach out.  Again, not a problem I see now, just noting the potential that comes with increased complexity.\n\n**Vanessa Ten-Kate:**\nKeep giving the team the autonomy and trust to move projects forward—that support and confidence really helps us do our best work. Continue setting clear communication and expectations so each person understands their role and what success looks like. And keep helping us stay focused by making priorities explicit and being comfortable pausing lower-priority items. That kind of clarity lets us focus on what truly matters without feeling stretched thin by more projects and requests than we can reasonably take on at once.\n\n**Sal Aziz:**\nJordan sets the entire course for the Marketing team's growth and strategy charting the course to $120 million in 2028 which is the lens that must guide our strategy and decisions today.\n\n\n\n\n**✅ Keep Doing**\n- **Leverage Articles and Email as Reliable Traffic Engines:** Given that Articles (+37.36% lift) and Emails (+37.03% lift) are highly effective and the most frequent/reliable sources of traffic lift, we should continue emphasizing and optimizing content creation and direct communication efforts.\n- **Utilize Campaign Saturation (Multi-Channel Coincidence)**: Continue to direct the team to use Campaign Saturation—coordinating multiple, reinforcing activities (like events, emails, and LinkedIn posts)—to create powerful, high-traffic days, as exemplified by the Prodacity 2025 event success.\n\n\n\n\n**🛑 Stop Doing**\n- **Stop Working in Measurement Silos:** Proactively engage the team to define our collaborative rhythm and reporting cadence for 2026. The goal is to maximize efficiency by automating data pulls, allowing the team to shift focus from “busy-work” (e.g. manual reporting) to high-impact activities.\n- **Eliminate Low-Impact, Non-Revenue Activities:** Dedicate all resources to programs that reliably generate pipeline, accelerate sales velocity, and directly fuel the $54M revenue goal for 2026.\n\n\n\n\n**🚀 Start**\n- **Put the Foundations in Place to Be Data and Revenue Driven:** To get an established and predictable view of pipeline and effectively forecast, we must have the data available to us and systematically applied to the Marketing funnel. For example, to understand how much pipeline a campaign will contribute, **we must know MQL to SQL conversion rates as well as SQL to Opportunity conversion rates, and lastly win rates**. This requires our systems to adapt to track this data and apply it so we can effectively measure and predict our Marketing efforts.\n- **Proactively Operationalize Messaging for Portfolio Acquisition Executives (PAEs):** Lead the team to formally align all high-level messaging to the WAS Scorecards, specifically framing Rise8's offerings as direct drivers of schedule certainty and commercial capability integration. This proactive alignment will directly empower Growth and Sales to communicate value in the precise language of the new DoD decision-makers.\n\n**McKinnon Pearse:**\n**Keep:** \n- Sharing strategic vision and context to help newer team members understand how day-to-day work ties to the big picture and broader business goals.\n- Being willing to make bold adjustments when needed to improve results, even if it creates short-term friction, because it strengthens long-term outcomes.\n- Maintaining a focus on outcomes and growth, ensuring marketing initiatives drive measurable impact.\n\n\n\n\n**Stop/Start:**\n- Given my limited exposure so far, I don’t have any strong observations for changes at this point.\n\n**Bryon Kroger:**\nKeep taking feedback and growing. You've really taken to growth in a way not many others have. Also, we ship outcomes was dope. \nStop doubting yourself. Start going all in.\n",
  "generation_timestamp": "2025-12-04 17:48:03"
}