{
  "employee_name": "Joseph Andrews",
  "accomplishments": "Kept hiring velocity and quality during rapid growth\nDelivered benefits and vendor transitions communications to employees\nLaunched people-ops programs that scale knowledge and performance",
  "enps_comments": "**Jeff Muller:**\nJoe had a huge 2025 taking on people ops responsibilities while continuing to ensure our recruiting pipeline.  Continue to be super impressed with Joe's judgement when taking on new areas of responsibility.\n\n**Brian Jennings:**\nJoe is fantastic to work with - very easy to collaborate with to solve our recruiting and hiring problems together. He's always flexible and can find ways to continue to push on when we hit roadblocks. I've also seen Joe spend time trying to grow and level up our people ops practices bringing in new concepts to how we approach hiring, interviewing and evaluation.\n\n**Jennifer Lopez:**\nJoe continues to be one of the most reliable and values-aligned leaders in the organization. He has built the People Ops and recruiting function from the ground up, consistently delivers at a high level, and leads with a rare blend of kindness, grit, and integrity. His impact on candidate experience, team morale, and organizational execution is undeniable. As he continues to build confidence in his voice and bring his insights more boldly into leadership-level conversations, I believe his influence will expand even further. Joe is a high-output, high-character leader I would enthusiastically rehire.\n\n**Rob Monroe:**\n- Never shies away from giving or receiving feedback - love that you are always direct and clear\n- Always keeps us honest when it comes to maintaining company culture, and higher degrees of integrity during hiring or firing situations\n- Theres no doubt that Joe can handle high stress situations and finding a way to crush it as a team of one - He's come through for us several times already. However, I worry that the heroism is no longer sustainable for our current company size, and as our company grows/changes we're seeing that our existing people operational processes, policies and systems are beginning to break down. I believe available capacity is real risk to what I'm about to say, but I'd love to see Joe be more proactive with maturing People Ops and HR related capabilities, so that other departments can focus more on their primary objectives.\n\n**Wayland Pearce:**\nI would enthusiastically rehire this Riser because he consistently shows up, gets things done, and keeps our people operations running smoothly. He handles a lot on his own, stays organized, and keeps things moving even when the workload is heavy. He even jumps in on his days off when something urgent needs attention, which really shows his passion and dedication. He communicates clearly, treats everyone with respect, and makes hiring and onboarding feel easy for the rest of us. He’s reliable, steady, and a huge part of why things run as well as they do.\n\n**Max Reele:**\nYou are incredibly committed to your job and the company while being a complete pleasure to work with. I think there are areas for improvement within our hiring practices and know that you're targeting the changes to make those improvements.\n",
  "start_stop_keep": "**Jeff Muller:**\nOne of Joe's challenges in 2026 will be building out the new recruiting structure (TAPs supported by recruiters) while continuing to manage People Ops responsibilities.  At the same time, we'll want to continue to look for opportunities for Joe to continue his professional development.\n\n**Brian Jennings:**\nStart: It would help me in my role if I knew I had a consistent place I could look to understand a current snapshot of our talent pipeline and up-to-date information for everyone. We have a google spreadsheet but information in there can be outdated and hard to keep track of who has offers, who is at what stage of the interview process, and who dropped out of the pipeline taking a job elsewhere.\nStop: Can't think of anything\nKeep: Keep putting the candidates first. You are thoughtful and don't make unnecessary rules - it allows us to bring in the right talent for roles.\n\n**Jennifer Lopez:**\n**Start sharing more of your perspective in senior-leader settings.**\nFrom what I’ve observed, your insights are thoughtful and often spot-on. Bringing your voice forward a bit more visibly (even when the room is full of strong personalities ) would add meaningful value.\n\n**Rob Monroe:**\n**Start**\n- Prioritizing and blocking off time for business case development, and continuous improvement initiatives that help scale People Ops and HR capabilities\n**Stop**\n- None at this time\n**Continue**\n- Being candid, concise, and kind\n\n**Wayland Pearce:**\n**Start:**\nStart setting clearer boundaries for yourself. You’re incredibly dedicated, but you deserve time to unplug. Giving yourself real downtime will help you stay energized and avoid burnout.\n**Stop:**\nStop taking everything on alone. You handle so much, and it’s okay to let others help so you’re not carrying the whole load by yourself.\n**Keep:**\nKeep bringing the same passion, consistency, and care you show every day. You take on a huge amount of work and still show up for people even on your days off. That level of dedication keeps things running and makes a big difference for the whole team.\n\n**Max Reele:**\nStart: (1) Keeping a more organized and transparent pipeline of all hiring activity with current status clearly indicated for all candidates and position vacancies. \n\n\n\n\nStop: Trusting the process for initial vetting. Raise the bar for candidates to make it through initial vetting and into the actual interview pipeline. This can include rigorous top grading interviews and several reference checks.\n\n\n\n\nKeep: Objectively telling the other directors and company leaders what you need to be successful.\n",
  "generation_timestamp": "2025-12-04 17:48:03"
}