{
  "employee_name": "Kristin Pearson",
  "accomplishments": "Implemented needed roles for improved, scalable customer success - full time CSMs, domain SMEs, CS Ops. \n5 CSMs hired, 2 let go, 100% of accounts covered with 175%/300% current team as billable. Transitioned role collateral from geared to volunteer CLs to professionals spanning multiple accounts. \n2 domain SMEs hired after 2 accounts that could benefit identified. \nHired Ops Manager with agreement to share with Growth to fully leverage our systems and data as it becomes a company imperative. \nAll hires came by way of referrals.\n\n\n\n\nMajor focus on proactively identifying risks and working mitigations - experimented with different types of reporting, health scoring, and intervention mechanisms. Partnered across other departments including reshaping needs as fundamental roles shifted from PL to DL occurred.\n\n\n\n\nImproved leadership awareness of account health and alignment towards renewal activities - iterative quarterly Account Health Score refinement, Account Strategy documentation and sessions, stakeholder mapping, Customer Fit Scoring implementation, and refined async account comms",
  "enps_comments": "**Carlo Viray:**\nEver since you joined Rise8 I’ve been super thankful and appreciative of everything you’ve done. You’ve brought so much structure, thoughtfulness, and maturity to how we operate, both internally and with clients. You’ve been absolutely crushing it, even though renewals haven’t gone the way we hoped (a lot of that has been outside your control or influence also)\n\n\n\n\nWorking with you is always easy and enjoyable. You’re direct, dependable, and someone I genuinely like partnering with. I trust you, and I know that when you say you’ll handle something, you will.\n\n\n\n\nThe constructive feedback I have is really more about what I’ve observed from afar as we all try to figure out the new structure between you, Adam, and Max. Right now I’m struggling to understand what Customer Success and Delivery look like together moving forward. I know you two are still defining it, but from my side, the biggest area where I need clarity is around handoffs from contract award, customer engagement, and ongoing follow-up.\n\n\n\n\nThe Greiser “homework assignments” situation was rough for me because you asked whether I should take ownership, and I didn’t have the context for that conversation at all. It put me in a weird spot because I didn’t know what the expectations were or how to respond. And that ties into the broader pattern we keep hitting across leadership where we’re all stepping into situations and asking, “Wait, who owns this?” It came up again with the FORGE licenses and funding comms, not necessarily your fault, but it highlights the lack of clarity we’re all running into. I don’t know the solution yet, but I want to call out the pattern because it’s something we’re consistently bumping into.\n\n**Jeff Muller:**\nA ton of progress in 2025 developing our CS function, especially as we were able to bring on dedicated CSMs.\n\n**Riya Patel:**\nI love working with Kristin. I'll save some commentary for the next question but one thing I especially appreciate about Kristin is how she communicates the bigger picture and provides the CSMs a more real time picture of what is going on in the company and what to expect. I never feel caught off guard by a company decision or announcement, because Kristin is really good about communicating ahead of time and it reduces a lot of churn and confusion.\n\n**Sharon Hamilton:**\nKristen is the personification of an A player. She models a growth mindset for her team and when the Customer Success team encounters a difficult challenge she doesn't complain; she immediately initiates a process to develop new team abilities, intelligence, or operational playbooks to ensure they can handle similar challenges successfully in the future. She empowers her team to make critical decisions without unnecessary layers of bureaucracy. She actively resists implementing rigid, unnecessary rules that would slow down timely team support and customer success efforts.Kristen keeps it real with her team and leadership regarding the true state of customer health, outcomes, and leading indicators. She quickly identifies opportunities for pivots, and she takes full ownership of all results without making excuses or shifting blame to other departments. She consistently challenges her teammates and peers directly on performance or strategy while delivering high-quality, actionable feedback. Her approach is balanced, ensuring the recipient always knows their development and well-being are cared for. Kristen is an exemplar of integrity, always ensuring that the team's actions and recommendations are what is right by the customer (even if it's challenging internally), the team, and the company.\n\n**Max Reele:**\nKristin is a top professional at healthily managing team dynamics, organizing across departments, and breaking down complex problems for driving step-by-step plans for solutions.\n\n**Rachel Del Vecchio:**\nFrom what I've witnessed in a cross-department, KP does an amazing job providing context and thoughtfulness on behalf of the customer and customer experience.\n\n**Bryon Kroger:**\nOn \"challenges directly and provides quality feedback without making others feel like they aren’t cared for\" I've seen some instances, especially lately, where you don't challenge things directly and instead either avoid the issue or take more of a passive or indirect approach. In a couple cases the passive approach, because you also tend to be fairly aggressive (in a good way), comes out in a way that is passive aggressive and frustrating to your peers. I've not had it happen with me, so I recommend checking in with your peers on it. I'm also not sure I can pinpoint why, and this is something I really only started to see this year, especially recently.\n",
  "start_stop_keep": "**Carlo Viray:**\n**Start:**\nAs you bring in your CSMs and I build out more of Growth — especially as Clayton and Shanna take more ownership of deals instead of everything going through me or Bryon — let your CSMs know they can give direct feedback to my team. They don’t need to go through you, and it doesn’t need to funnel up to us at the director level unless it’s actually a director-level thing. Same with Sharon or Riya to me. They should feel totally comfortable coming straight to me if something is off or they have feedback.\n\n\n\n\n**Stop:**\nSigning me up for tasks when I don’t have context or when it isn’t clear where I fit. Haha. That Greiser situation is a good example. \n\n\n\n\nThe other thing that will always be tricky is when staffing and allocations get messy and we end up with unhappy partners or clients. The Deloitte situation was the first real example of that, where they were understandably frustrated that we didn’t staff in time. I know that isn’t all on you — it’s on Delivery and the hiring pipeline too — but it puts people like us in bad conversations with the client or partner. Anything we can do to reduce those situations going forward would be huge.\n\n\n\n\n**Keep:**\nKeep making Customer Success better and keep pushing for renewals. Your communication has been great both internally and externally, and I really appreciate how thoughtful and consistent you are. Keep challenging the leadership team too, you bring perspectives that help us see around corners and think differently, and that’s something we need as we grow.\n\n**Jeff Muller:**\nOne item that will continue in 2026 is clearly defining swim lanes for CSMs and DLs and creating the processes for them to collaborate effectively.\n\n**Riya Patel:**\n(Kristin's favorite question :) ) \nStart/Stop: There's not really anything I would recommend starting or stopping. I think this year was a lot of building the foundation for CSMs and next year will be about maintaining those practices and building in the reps to make the work valuable to customers and Rise8. \n\n\n\n\nKeep doing: Keep communicating consistently on initiatives that will affect the CSMs, keep bringing in some strategic conversations within our weekly workflow, and keep supporting the CSMs like you do!\n\n**Sharon Hamilton:**\nStart: a CS bookclub! \nStop: Cant think of a stop.\nContinue: Looking for ways to improve processes and playbooks.\n\n**Max Reele:**\nStart: Taking responsibility for senior level engagements as our resident expert in client relations. It will be beneficial to own some individual relationships with senior level customers, but may require further exposure to government contracting strategies and/or technical architectures.\n\n\n\n\nStop: Distributing tasks without first creating a draft of the product. This provides the team with a much stronger foundation and gives you an opportunity to contribute strategically in new areas for potential growth.\n\n\n\n\nKeep: Providing strong feedback across the leadership team and building company-wide process/communication like the Account Spotlights. Those are a couple of your strongest qualities that I admire and will continue to learn from.\n\n**Rachel Del Vecchio:**\nStart: Brainstorming with marketing more! I want to create cool customer experience programs with you! \n\n\n\n\nStop: I got nothin! \n\n\n\n\nKeep: Bringing your perspectives to every conversation. It's a much needed voice in the room!\n\n**Bryon Kroger:**\nKeep: getting the processes and data in place and running smoothly. I'm excited to see what Vitally does for us, too.\nStop: you can put down the delivery hat now! but that means it's time for you and Max, and your CSMs, to get really tight on the roles and responsibilities of CS vs Delivery\nStart: Getting CSMs focused on *all* the things required for success in a govtech context. Some of it is toil. But we've got to do it.\n",
  "generation_timestamp": "2025-12-04 17:48:03"
}