{
  "employee_name": "Andrew Knife",
  "accomplishments": "Modularized the SecRel pipeline so that it can be re-utilized on different efforts within Rise8. This work can be utilized on an effort like ATTV to assist Rise8 in bring value to customers quickly with a pipeline that has been proven.\n\n\n\n\n   Provided essential technical guidance to multiple team members on challenging problems, including helping troubleshoot postgres container deployment with security constraints, supporting various infrastructure issues, and guiding the team through security policy implementation.\n\n\n\n\n   Consistently led daily stand-ups, weekly syncs and larger portfolio and stakeholder facing meetings with organization and clarity, maintaining team coordination and communication. This leadership ensures the team stays aligned, blockers are identified early, and knowledge sharing happens regularly.",
  "enps_comments": "**Schuyler Reinken:**\nAndrew's stellar performance is well known and widely appreciated. He can bounce between several tasks at once and drive outcomes in multiple dimensions. The only major growth point would be to make sure the code, Dockerfiles, and scripts are more modular enough and reusable. There are several instances of code being produced by AI several times, all slightly differently, creating the possibility for subtle issues and bugs.\n\n**Michael Estoy:**\nDrew, working with you daily has given me a front-row seat to your ability to see the big picture and anticipate how different factors affect our pipeline before anyone else does. You're our canary in the coal mine who spots issues like Artifactory file size limits that could make our pipeline inoperable. This proactive, systems-level thinking is invaluable.\n\n\n\n\nYou're a trailblazer who isn't afraid to lead into unknown territory. Whether it's automating runner creation or hardening our software supply chain, you take ownership of complex, ambiguous problems and bring them to the finish line. The kudos from our team retrospectives say it all: You're the Swiss Army Knife who shows up everywhere we need you most, from helping teammates debug typos to ensuring our pipeline infrastructure stays secure and operational.\n\n\n\n\nWhat impresses me most is how you balance being a force multiplier for the team while maintaining focus through WIP limits. You've built trust to handle bigger challenges, and I'm excited to see you take on even more strategic, transformative work in the coming year.\n\n**Chris Brodowski:**\nI can't say enough about Drew so I will attempt to keep this focused.  Long story short, he is an absolute superstar in every way.  His technical skills, amiable personality, leadership mindset, ability to focus on both the fine details and long-term goals of the program as well as the mission of the company all at the same time is simply unbelievable.  In my opinion, he has outgrown his current rank.  It would be inconceivable to let a guy like this go after the conclusion of the FORGE program.  If he isn't an A Player, then I simply don't know what an A Player is...and I believe I know an A player when I see one.\n\n**Sean Herbert:**\nOutcomes in production hasn't been meet on the FORGE program due to delays in obtaining DAF Cloud Works accounts. \n\n\n\n\nAndrew has been an amazing team mate, he always assists in anyway he can and continues to be proactive in identifying problems and resolving them before customers or other members of the team identify them. Highly recommend for promotion over myself.\n\n**Ashley Pearce:**\nAndrew is a solid performer and an even better Riser. He strives to make the team better, is always willing to step up when necessary, and never complains even in the most stressful situations.\n\n**Pedro Torres:**\nAndrew brings a combination of a SME, leadership potential, easy to work with, and an absolute \"A\" player mentality to the table. He is frequently sought-after for complex engineering topics, and volunteers to lead projects, meetings, briefings, etc. Very happy to work alongside Andrew.\n",
  "start_stop_keep": "**Schuyler Reinken:**\nKeep: Generally being awesome\nStop: Working too many angles? Don't want you burning yourself out.\nStart: Exploring more long term implications of the code produced. Just because it works doesn't mean it will always continue to work in all cases, and getting that closer to reality can produce big impacts.\n\n**Michael Estoy:**\n- **Start:** Taking even bigger risks and leading more strategic, program-level initiatives from conception to completion. You have the technical depth, systems thinking, and team trust to tackle the ambiguous and high-impact challenges. Don't wait for permission because you're already shaping direction.\n- **Stop:** Limiting the size of your dreams and what you believe you're capable of achieving. Your track record proves you can own and deliver transformative solutions. Think bigger about the problems you want to solve and the impact you want to create.\n- **Keep:** \n   - being our systems thinker who spots risks and opportunities before others do. Keep building automation that has strategic, program-level impact. \n   - being the teammate who shows up to help others while maintaining your focus on high-value work. \n   - elevating yourself and the entire team through your technical leadership and collaborative spirit.\n\n**Chris Brodowski:**\nStop: I think he might be overextended a bit.  He might be taking on more things, both at Rise8 and elsewhere, that he should, and we want him for the long-term. This company should never, ever let him go.  \nStart: Not sure what to put here.\nKeep: He is excellent in pairing, always ready to help no matter what the need. Always ready to pitch in at a moment's notice.\n\n**Sean Herbert:**\nStart: Senior Platform or CI/CD Engineer\n\n\n\n\nStop: Sometimes you can be a little too hard charging and take away opportunities maybe others wanted to take on. This could be work tickets, presentations/ demos, etc. \n\n\n\n\nKeep Doing: Keep learning and asking for feedback, you seem very eager to improve anyway you can.\n\n**Ashley Pearce:**\nKeep doing everything you're doing! You are absolutely killing it and I couldn't be more excited to work alongside you.\n\n**Pedro Torres:**\nLeadership, PM opportunities\n",
  "generation_timestamp": "2025-12-04 17:12:06"
}