{
  "employee_name": "Ashley Pearce",
  "accomplishments": "",
  "enps_comments": "**Michael Estoy:**\nAsh, your willingness to step up and support the Cyber team during extended absences is a testament to your commitment to mission success. You dove in and applied your knowledge of the Risk Management Framework to unblock critical work. Your ability to operate effectively in ambiguity has kept momentum going when it could have stalled. This combination of technical expertise, persistence, and team-first mentality makes you an invaluable team member.\n\n**Schuyler Reinken:**\nAshley is a dedicated and intelligent worker, but I am not truly familiar with the ATO documentation that she generates, and cannot give a reasonable objective evaluation of the work she does. I know that when FORGE was starting up, she was able to provide the leadership necessary to get our Cyber team up and running and help coordinate between Secrel and Cyber, which was an enormous help.\n\n**Pedro Torres:**\nAshley is a cybersecurity professional with a wealth of experience in the field. I look forward to continue working with her and growing as an analyst under her leadership.\n\n**Octavia Leon:**\nAshley’s been killing it this year. She built the GRC playground and kicked off the RMF practice group, which have both made a huge difference for the team. She’s always sharing knowledge around RMF and cATO, breaking things down in a way that actually helps everyone level up. On calls and standups, her technical insight and attention to detail always shine through. Ashley really sets the standard for what it means to be an A Player and represents Rise8 in the best way possible.\n\n**Andrew Knife:**\nAshley is an excellent performer trending toward Best in Grade in several key areas, particularly in \"Do What Works\" and \"Keep it Real.\" Her methodical approach to security work, combined with excellent boundary-setting and transparency, makes her a reliable and effective team member. Her collaborative style and willingness to help other teams demonstrates flexibility and commitment to the broader mission. Continued focus on knowledge sharing and mentoring will amplify her impact.\n\n**Jeremy Steinbeck:**\nIn an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year\n",
  "start_stop_keep": "**Michael Estoy:**\n- **Start:** experimenting with more curiosity-driven approaches to de-risking your work. When you hit what seems like a blocker, challenge whether it's a constraint or just the current framing of the problem. Try smaller experiments to test assumptions earlier because sometimes the obstacle is in how we're thinking about the problem, not in the circumstances themselves. This will amplify your already strong problem-solving skills.\n- **Stop:** buying into self-limiting beliefs. You've already proven you can master new domains like Policy-as-Code, lead organization-wide initiatives, and establish new practices at Rise8. Trust your capabilities and the evidence of your impact.\n- **Keep:** applying your deep understanding of RMF to tackle ambiguous problems. Your ability to receive a complex challenge, brainstorm multiple approaches, and then start making progress without perfect information is a valuable strength. Keep building on the groundbreaking work you've done with Policy-as-Code, Compliance-as-Code, and the GRC practice.\n\n**Schuyler Reinken:**\nKeep providing leadership to our ATO efforts! I wish I could give more feedback on other particulars, but I just don't know enough about it.\n\n**Pedro Torres:**\nKeep exploring PaC/CaC and helping us to revolutionize how policy and compliance are enforced and implemented.\n\n**Octavia Leon:**\nKeep doing everything you’re doing, you’ve clearly outgrown the expectations of your current role and are already operating at a Staff level. The GRC playground, RMF practice group, and the way you consistently share knowledge have had a huge impact on both the team and the mission. You lead by example, bring a ton of expertise to every conversation, and raise the bar for everyone around you. I’d love to see you continue leaning into that leadership space and owning more strategic initiatives since you’ve more than proven you’re ready for that next step.\n\n**Andrew Knife:**\nKEEP DOING:\n✓ Methodical approach to testing and validation - your discipline ensures quality and catches issues early\n✓ Collaborative partnership with teammates on security controls - this pairing is highly effective\n✓ Setting healthy work-life boundaries - your transparency about hours and availability is excellent modeling for the team\n✓ Clear communication about availability and workload - this helps the team plan effectively and respects your time\n\n\n\n\nSTART DOING:\n→ Sharing more about pipeline troubleshooting learnings with the broader team - you gain valuable insights that could benefit others\n→ Leading a brown bag or knowledge share session on policy as code - your expertise would be valuable for the wider organization\n→ Mentoring others in security control implementation - you have strong skills that could develop junior team members\n→ Maximize pairing opportunities with teammates outside of your area of expertise - these pairings could provide invaluable experience resulting more effective and outcome oriented work\n\n\n\n\nSTOP DOING:\n✗ Working excessive hours - maintain the boundary-setting you've already demonstrated; it's healthy and sustainable\n\n**Jeremy Steinbeck:**\nIn an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year\n",
  "generation_timestamp": "2025-12-04 17:47:59"
}