{
  "employee_name": "Brandon Shouse",
  "accomplishments": "- Wrapped up the KM contract, pairing with the incumbent team until my last day there. This makes other contractors want to work with us and sets a good example for future transitions. We all have had those transition experiences that were unpleasant.\n- Innovated several aspects of the FORGE platform, which will be integral to its success. These show our customers that we have the technical know-how to succeed and continue to support day 2 OPs.\n   - SSO w/ Keycloak that supports basic auth with OTP as well as CAC authentication\n   - Identified several areas where our particular deployments were causing problems in our clusters, getting us past some recurring issues/outages\n   - Knowledge sharing and leveling up the team via technical writing and demonstrations, enabling the team to go faster \n- At the start of the FORGE contract, while new folks were onboarding, handle some of the meetings and technical discussions with FORGE senior leadership.",
  "enps_comments": "**Dylan Bossie:**\nProbably the team GOAT for advocating and implementing best practices in terms of tech stack and automation\n\n**Eric Whitman:**\nBrandon is a solid A Player on FORGE. He has a wealth of knowledge and frequently owns lines of work on the project. He does a great job at calling out risks before they happen and always is thinking long term from his experience which is very valuable.\n\n**Nick Luckey:**\nBrandon consistently delivers exceptionally high-quality work. The output is always well-thought-out, meticulously executed, and clearly demonstrates their commitment to excellence. Their standard of delivery significantly benefits the entire team's productivity and overall success.\n\n\n\n\nBrandon is a true pleasure to collaborate with. They are highly responsive, reliable, and approach every interaction with a positive and constructive attitude. Myself and other team members have a great appreciation for the outstanding caliber of work Brandon produces.\n\n**Asare Nkansah:**\nI've selected \"Neutral\" because while Brandon possesses valuable skills, his level of engagement and presence on the team has been inconsistent.\n\n\n\n\nOn the positive side, Brandon is a very kind and nice person to work with. When he is engaged in a task, his technical skills are excellent, and his range of experience has been helpful to the program. I also appreciate that he is always willing to jump into the game and contribute when asked directly.\n\n\n\n\nHowever, his frequent time off/absence in daily standups can make it challenging to maintain momentum and feel consistently connected as a team. This sense of disconnect is sometimes amplified by a perceived lack of engagement and smaller things, like keeping his camera off during meetings. My main wish is for him to become more proactively invested in the team's mission and take more initiative to jump into challenges on his own. While his skills are an asset, this proactive engagement is what's needed to elevate his impact from contributing to truly driving our team's success.\n\n**Jerod Culpepper:**\nExtremely proficient technically and super helpful!\n\n**Nick Weiss:**\nBrandon's been a great asset to the team. he's reliably able to complete the work he takes on, leans on his domain knowledge to help anticipate potential issues, is great about sharing his learnings or knowledge with the team, and is always willing to help a fellow teammate. I would enthusiastically work with or rehire Brandon again.\n\n**Steven Bair:**\nBrandon has established himself as a strong Sr PE on the program, consistently demonstrating the Grit and autonomy required to drive complex initiatives. He is a highly effective autonomous worker who leverages his experience from previous programs to quickly generate necessary artifacts without request, such as architecture diagrams and PPSM.\nHe has shown a willingness to take on substantial bodies of work—including our hardened image strategy, secrets management comparisons, backup strategies, and the Nessus/ACAS scanning solution. Crucially, Brandon embodies the value of Do the Right Thing; he proactively collaborates across teams like Cyber and SecRel to ensure solutions are architected correctly the first time, rather than rushing and creating debt that hurts us later.\n",
  "start_stop_keep": "**Dylan Bossie:**\nStart: \n- Speaking up more/leading more with your valuable technical insight. Our team would be in a great spot if we worked off of more of your ideas\n- Being more visible with status updates and documentation\n\n\n\n\nStop: \n- Idk\n\n\n\n\nContinue: \n- Advocating for automation in all the things\n- Knowledge sharing on your work\n\n**Eric Whitman:**\nKeep up the great contributions at FORGE and owning certain lines of work! Keep speaking up when needed for any risks/etc that arise--you do a solid job at that and you don't ever shy away which is always appreciated and valuable. I think my only suggestion would be to try and pair/KT your lines of work in the future. That will help with knowledge silos in the future when we need to fix things (or if you win the lottery!).\n\n**Nick Luckey:**\nBrandon should keep maintaining their current, exceptionally high standard of work.\n\n**Jerod Culpepper:**\nStart - I would love to see you take on more leadership role within the team.\n\n\n\n\nKeep - Leading the way on IaC. Your TF modules are *chef's kiss*\n\n**Nick Weiss:**\n- Continue to share your knowledge and help the team navigate potential issues before they arise.\n- Start providing more feedback about any major concerns you may have with decisions we're making as a team or a portfolio.\n\n**Steven Bair:**\n- Keep identifying areas in the development of ACDC where you can lead the charge. As a senior PE, use these opportunities to not just deliver outcomes, but to upskill your fellow teammates along the way, fostering a growth mindset across the team.\n- Keep producing strong documentation. This is critical for our learning velocity. Your documentation serves as a guide for future iterations, enables new PEs to onboard quickly, and provides transparency regarding the \"why\" behind our architectural choices.\n- Keep up the tight collaboration with other teams and your fellow Senior PEs / PM (Nick and Asare). The backlog is large and the team moves fast; continue working with your peers to spread the load effectively so we can maintain speed without sacrificing quality.\n",
  "generation_timestamp": "2025-12-04 17:47:59"
}