{
  "employee_name": "Branden Van Derbur",
  "accomplishments": "- Significantly improved my domain knowledge from beyond our team sphere and into the platform sphere. This has allowed me to anticipate challenges from our platform early on and account for them, driving for a better product by communicating these challenges, providing solutions, and identifying problems early on for the larger domain. \n- Foster a team environment where direct, kind feedback and humor coexist with accountability. Teammates have consistently noticed my courage to challenge ideas and speak my mind freely. This has improved team health, strengthened collaboration, and encouraged others to stay curious and vocal as well, also based on peer feedback received.\n- Evolved into one of the team’s most dependable engineers based on peer feedback, described as “ultra-competent,” “most reliable,” and a “go-to” for confidence in product stability. Consistently lead tickets from start to finish, providing valuable updates while pairing, and ensuring outcomes ship successfully to production.",
  "enps_comments": "**Luke Strebel:**\nI think that you're just like one of the most reliable guys on the team. If there is something going on, whether it's checking pod Health, making sure Runners are online, or checking the database, you are one of my go-to guys to get confidence that the app is working the way we need it to. That's a really hard thing, and honestly, not a very easy thing for developers to do. The \"Branden now\" has the right habits to be an amazing anchor or team lead in six to eight months because you're already thinking more than just the story that's in flight.\nYou're kind of in a catch-22 because you're **exceeding all my expectations** for what an engineer should be, but now I've put you at like the anchor level expecation, the true \"Best in Grade\" status, and I can see that there's some growth that you have to do to get to that point. Your intangibles are so good. Your maturity from the first SD elements production issue to the most recent one is amazing. Last time, you were more auxiliary, helping in the background. This time, you took the lead on a pretty complex thing. You're also willing to give direct, actionable feedback to your peers, which is an exceptional **A-Player** trait.\nOn area to continue to refine is your communication of work in progress. This has only happened twice and there were a lot of moving parts (both personal and professional, which I dont want to ignore - but it's a good example of where you can grow) but sometimes you might say, \"I'm really close\" or \"I'm almost done\" on a story, and then it'll stretch one to five days. I think if you were the best version of yourself or a \"Best in Grade\" engineer, you wouldn't make those statements unless they were actually true and they're proven by being done that same day. That little of a miss on those just shows theres still some space to master your craft.\nI know SecRel wasn't really your core domain when you started on it, but I think you're doing an **exceptional job growing.** I think when you first started, you're like, \"I don't know python. I feel like I can't really contribute at all to this team\" to being one of the most resilient, reliable guys to deliver software to our users. The **next step** is to take this leap into... \"Hey, I spent this week as interrupt... and I saw these behaviors by our users... and I don't think we're really supporting them.\" or \"I went to this conference or believe this thing will create tons of **outcomes** for our users.\" I want to hear that. That's that other signal that you've stepped beyond the top five percent—you're pushing six-month roadmap agendas or you're helping prioritize things that might get lost. Thinking about \"outside time and space\" is your next Frontier.\nI think you're extremely **'Bold.'** You and Sally are the two that I think would be most comfortable posting in any room giving any type of feedback. I think y'all, that's a superpower that both of you have. I have, no, I doubt that you're gonna **'Do the Right Thing.'** You also **'Keep it Real'** with a sense of humor that I find similar. In some ways, like it's sort of dark, but it's also a way it like makes the room feel safe, because you're not always walking on eggshells trying to say the perfect thing. I really like that. \nYou have **'Grit'** and **'Do What is Required'**—you do the hard things, both in your personal life and with the stuff that we've been having to release. It's been hard man, and I just respect the shit out of you because you're showing up every day. You also have an awesome **'Growth Mindset,'** like bringing back those AI learnings to our team.\n\n**Sally Yoo:**\nI would enthusiastically rehire Branden. He is an extremely valuable team member who is a good**** design ally and provides great technical support to colleagues. He is appreciated for his patience, helpfulness, and ability to be vulnerable and communicate his needs. He demonstrates resilience by bouncing back from tough periods. He is not scared to give or seek feedback, which is crucial for the team's continuous improvement.\n\n**John Zubiri:**\nBranden has grown to have a voice and he shares his thoughts and ideas in various team meetings. He is collaborative and easy to work with. I appreciate that he is quick to chime in or respond to tenant questions. He is gaining more experience and becoming a well-rounded engineer.\n\n**Scott Carlson:**\nDefinitely pushes himself and others to higher performance and getting outcomes in prod. Gives feedback even when it's constructive/improvement-needed ones and requests feedback frequently from the team. Executes stories with alignment to the acceptance criteria and expected outcomes. Doesn't shy away from harder stories and problems with many uncertainties (SDE clone, Banana Peels vulnerability teaming). Branden loves Rise8's mission and volunteers on EAT to help improve it. I haven't seen anyone learn as fast as Branden can. He's very knowledgable about the tools we use and doesn't shy away to learn at a deeper level.\n\n\n\n\nHe is a future leader of software/platform teams and is well positioned to accept more leadership responsibilities with more experience working and building things.\n\n**Dylan Doub:**\nBranden's quick learning and willingness to fail and learn is essential as an engineer. He will pick up any task and be very knowledgeable about it by the end.\n\n**Jeremy Arzuaga:**\nIn an effort to balance customer needs with completing a large number of reviews, I did not allocate enough time to provide useful feedback that's different from what we've discussed during out last speedback session\n\n**Kyle Dozier:**\nI have thoroughly enjoyed working with Brandon. Brandon does not shy away from challenges, but embraces them with passion and eagerness. I've gotten to see him grow as a CICD engineer, developer, and platform engineer. I've gotten to struggle alongside him on the VA, dealing with vendor shenanigans and contract chaos. I've enjoyed diving into new AI workflow flows on TaK and beyond. I've come to appreciate his optimistic, yet down to earth and just REAL approach to life and work.\n\n**Noah McHugh:**\nBranden is an exceptional engineer, he is able to be dropped into something new and gain his bearings and immediately get to work without needing to be walked through. He works great with others, able to pair and effectively communicate, never letting anything get in the way of outcomes.\n",
  "start_stop_keep": "**Luke Strebel:**\nFor **start/stop/keep:** **Start** pushing six-month roadmap agendas; use your insights to help prioritize things that might otherwise get lost. **Start** bringing insights from interrupt/support week back to the team to inform strategy and outcomes. **Keep** being the \"thermostat\" for the team. Your reliability, ownership, and positivity during an incident are A-Player traits. **Keep** being bold. Your superpower is being comfortable giving feedback in any room. **Keep** your sense of humor. It helps the team feel safe.\n\n\n\n\nYou rock, Branden. Thrilled to have you on my team.\n\n**Sally Yoo:**\n**Keep:**\n- Keep giving teammates feedback and continue asking for feedback\n- Keep communicating your needs and maintaining the vulnerability that allows the team to support you. \n- Continue delving into AI and bringing your learnings to help the team (i.e. WikAI).\n**Start:**\n- Start taking on a role, shared with other anchors, to support Luke (the Product Manager) by advocating for user needs and collaborating with him on product syncs or working through problems, potentially on a switch-off basis.  \n- Start working to get better at written documentation, such as by writing notes during meetings or starting a Slack thread to share out information.\n- Start advocating for yourself and the other guys by saying, \"Hey, I want to know what's going on?\" to ensure everyone stays engaged.\n\n**John Zubiri:**\nKeep: Being vocal and present, sharing ideas\nStart: Consider leading more in pairing on implementation decisions, patterns\nKeep: Working on skills aligned with your track\n\n**Scott Carlson:**\n**Start**: Learn more about DDD and API design best practices. \n\n\n\n\n**Stop:** Just be mindful about how much time spent outside of team activities during Lighthouse contract transition\n\n\n\n\n**Keep:** Being curious, volunteering, speaking up during IPM, communicating well, leading pairing,\n\n**Dylan Doub:**\nBranden should keep his willingness to learn and pick up any task and teach those around him\n\n**Jeremy Arzuaga:**\nIn an effort to balance customer needs with completing a large number of reviews, I did not allocate enough time to provide useful feedback that's different from what we've discussed during out last speedback session\n\n**Kyle Dozier:**\nKeep: Embracing and improving our AI Workflows and sharing them with the rest of rise8\n\n\n\n\nKeep: Vocalizing your thoughts and concerns across internal and client channels.\n\n\n\n\nKeep: Vouching for yourself and for what you want out of your career.\n\n**Noah McHugh:**\nStart getting involved in more company projects for greater visibility\n\n\n\n\nKeep pushing your use of AI and knowledge regarding it forward, its an incredibly powerful tool to have, and you're just at the beginning of what you're able to do with it.\n",
  "generation_timestamp": "2025-12-04 17:47:59"
}