{
  "employee_name": "Coty Allen",
  "accomplishments": "LHDI Maturity Roadmap\nAI Coding for Terraform modules to deploy containers into ECS\nLHDI Architecture to Scale",
  "enps_comments": "**Brent Baumann:**\nCoty possesses a breadth and depth of technical knowledge that is truly exceptional among his peers. This technical authority enables him to **Be Bold**, making highly informed statements and recommendations that constructively challenge conventional thinking and \"the way it's been done before.\" His commitment to **Keep it Real** is evident in his willingness to defend unpopular but necessary opinions when they are clearly in our customers' and the program's best interests. This honesty is invaluable; I know I can always count on Coty to be transparent and not hold back crucial information.\n\n\n\n\nCoty has been an invaluable partner on the program. Our collaboration has allowed us to effectively split duties and align seamlessly on shared goals. We both bring different, complementary perspectives to various situations, and together we have formed a highly effective team. I am genuinely excited to see the level of accomplishment we will achieve in our next phase of work.\n\n\n\n\nCoty has demonstrated tremendous grit through two recent challenging program transitions. Instead of dwelling on difficulties or complaining, Coty focused entirely on how to solve the next problem and help the team operate effectively with the resources we have, rather than on what was lost. This commitment to finding solutions embodies the principles of **Do the Right Thing** and **Do What is Required** for seamless program continuity.\n\n\n\n\nBeyond his technical contributions, Coty has an infectious, energetic, and highly positive attitude, making him a genuine pleasure to work with. He is a shining example of **Always be Kind**; he is consistently approachable and readily available to jump on a call, whether the issue is simple or requires a deep dive into challenging problems. His willingness to consistently engage and assist colleagues makes him an invaluable resource to the entire organization.\n\n**Paul Fretz:**\nI didn’t have the opportunity to work closely with Coty, but it’s clear he had leadership’s ear throughout the year. He has a vast amount of knowledge and is always willing to share his thoughts and opinions. I enjoyed the times I did get to work with him. I’m interested to see what his role will look like on the new contract, especially with Deloitte expected to be the primary point of contact instead of the stakeholders themselves. Leadership clearly respects Coty and what he brings to the table, which gives him a strong voice and meaningful influence.\n\n**Jodie Nkansah:**\nCoty is a valuable senior SRE whose extensive industry knowledge and sizable backlog of experience translate directly into heightened engineering quality and stability for LHDI. He shines as an organizational resource and mentor, demonstrating a genuine passion for empowering the next generation of engineers. His one-on-one pairing sessions are effective, positioning him as a great teacher who successfully transfers complex domain knowledge. Coty is also skilled in assessing the strategic risks within large systems and communicating these complex assessments. His ability to identify and articulate potential risks and pitfalls is crucial for proactive planning and securing the stability and scalability of LHDI.\n\n**Ron Golan:**\nCoty is incredibly passionate and truly cares about his work, and doing the right thing. He advocates strongly when he thinks there is a problem, and because he's been in the industry a long time he knows the best practices and the ideal way to do things. However, I think that is also what gets him into trouble, and is the area for growth. In my opinion he needs to be more aware that stakeholders listen to what we say, and that he has real influence; that knowledge needs to play more of a role in what he chooses to advocate for, and how. I believe that Coty has a tendency to catastrophize about problems that are not emergencies, stakeholders listen to that and make decisions, and that has a material impact on projects. \n\n\n\n\nI also think there needs to be much more of a bias for action - you cant just point out problems so strongly, you need to play an active role in solving them.\n",
  "start_stop_keep": "**Brent Baumann:**\n> I strongly recommend Coty continue his role as an influential voice within the program. His unique combination of deep technical knowledge and varied perspective is essential for shaping Lighthouse's future. As the program navigates the current major transition, his commitment to sharing his expertise will be crucial for maintaining stability and setting a clear technical course for scaling out the platform.Continue being an exceptional teammate, effective sounding board, and steadfast advocate for doing things the right way, particularly when navigating difficult decisions or challenging circumstances. This commitment to principle is invaluable to the team.I encourage Coty to begin focusing on the execution and delivery of production outcomes related to the high-impact ideas generated this past year. While the strategic vision is strong, the next critical step is to translate those concepts into tangible, successful results that overcome the challenges encountered previously.\n\n**Paul Fretz:**\n**Start** – At times, Coty can adopt a “sky is falling” mentality. I’d encourage him to focus more on solutioning rather than raising alarms or leaning into panic. Because he has leadership’s respect, I think he could also use that influence to push back more when priorities seem misaligned or decisions feel questionable.\n**Stop** – After working with Coty for as long as I have, I understand him and how enthusiastic and excitable he can be. I’ve come to appreciate that energy. However, for people who don’t know him as well, that enthusiasm can sometimes come across as argumentative—even when that’s not his intent.\n**Keep** – Keep striving to improve Lighthouse. Coty has deep expertise and a strong ability to recognize gaps, scalability issues, platform risks, priority tradeoffs, and a clear vision of what Lighthouse could become. I’d love to see him continue pushing toward that future.\n\n**Jodie Nkansah:**\nKeep leveraging your deep industry experience and knowledge. Your background is an asset to the team and program, providing valuable context and insight into the complex nature of LHDI. Keep making yourself available for one-on-one pairing and mentoring. Pairing session with you are effective. Your ability to clearly explain complex topics makes you a great teacher and resource to junior engineers. Keep demonstrating your passion for the craft and industry and for empowering others. This reinforces a culture of learning and technical excellence. \n\n\n\n\nStop allowing passionate technical deep-dives to unexpectedly extend beyond the allotted time or scope during meetings. While your knowledge is immensely valuable, long, detailed tangents and monologues can inadvertently take up disproportionate air time, making it difficult to transition to necessary collaboration, capture input from others, or keep the agenda on track. \n\n\n\n\nStart utilizing brief, high-level summaries when communicating risks or technical opinions in larger forums. You can always offer to deep-dive in a separate follow-up session or document, ensuring necessary information is shared without overwhelming the current discussion. This practice has the additional benefit of creating and holding space for other voices.\n\n**Ron Golan:**\nThis coming year, I would love for you to better take into account organizational realities in the problems you choose to talk about and solutions you recommend, and playing an active role in moving forward those recommended solutions.\n",
  "generation_timestamp": "2025-12-04 17:48:00"
}