{
  "employee_name": "Derek Dombek",
  "accomplishments": "Last year was a ton of learning and execution! It was my first time ever in a GRC role, and I was able to learn how the cATO space should operate from an organizational level as a whole. I got to contribute a ton in every little piece along the way, but the main focus ended up being around fundamentally building automations needed for GRC into pipelines. At the USPTO we were the pioneers for their cATO program, so of course everything was focused on getting the product into the customers' hands, in their production environments.\n1. We were able to deliver to USPTO product teams daily reporting for the ISSOs and Assessors around each of their system-level (VPCs, EC2's, IAM, Networking, etc.) component findings through automation (zero user interaction for finding these components, using Python and AWS Audit Manager), which is a giant piece to the NIST-800-53r5 catalog in about two months, with success metrics following shortly after. That was our MVP start to getting value and impact to move their organization faster. No more manual screenshots for them that take forever! Of course, there was a ton we could improve on in the future, which would have led to more outcomes, more frequently.\n2. Just before I left the USPTO contract, I was able to successfully deliver active tracking and reporting on pipeline findings and vulnerabilities. This was the work I personally led and owned as a team member. As an MVP and based on guidance from the stakeholder, we chose not to use gate checking just yet on code deployments (Product teams needed time to catch up with all their current vulnerabilities before gates happen). Our main mission and impact was getting each product team's pipeline to report their findings (they were already properly scanning), accurately (Python), to a central location (AWS Security Hub), with an easy reusable way to onboard with our system (GitLab CI Components). Right when I left is when teams just started to adopt the tool that I developed. So, I was unable to collect the success metrics, but I am comfortable saying, through conversations with my previous teammates, that this tool is already providing value to the customer while I'm gone through having better visibility into their CVE and runtime postures.\n3. \"TAK!\" After being removed from the USPTO contract, I was on the beach for a hot minute, and this project really made me feel at home and welcome during the transition period. Everything that was being done just kind of clicked with me, and I ran with it immediately. From day one, it all made sense to me because we had already built a similar system over on the USPTO pipeline work, except with components (similar to templates, but not quite). Of course, Branden and Kyle were working together on it before I got onto it to set the foundation, but I believe I was able to really add value when I adjusted the pipeline to use GitLab's new default way of security scanning using their internal policies. No more trusting custom scripts for scanning that hopefully reliably work. This made the pipeline run much more accurately.",
  "enps_comments": "**Noah McHugh:**\nDerek is just great to work with. Able to dive right into anything in his way and figure it out without any hand-holding needed.\n\n**Kyle Dozier:**\nI haven't had much opportunity to work with Derek yet, mostly just the handoff and a bit of follow up on the TaK CICD work. That being said, everything I've seen has been good. Derek is friendly, professional, and humble. He's clearly skilled, communicates clearly, and has a passion for his work. I hope I get the opportunity to pair more with Derek in the future.\n\n**Branden Van Derbur:**\nBasing this response on limited experience with Derek. I would absolutely rehire him, but this answer would move to strongly agree with more work experience as a pair.\n\n**Scott Carlson:**\nI’ve only paired with Derek for 1 week now, so need more time to observe behaviors, but from what I’ve seen so far, Derek is very knowledgeable and eager to share and apply this to our current team. He’s been approached by new processes and new-to-him technologies (not sure Power Bi really counts as a “new technology”) and took that as opportunities to improve. There was also a bit of pain for onboarding with the VA, and I haven’t heard one bit of blaming or complaining about documentation that was out-of-date or inaccurate. He shows up and is willing to adapt to the team norms especially since it’s different than being the single Rise8 subcontractor on a project.\n\n**Sally Yoo:**\nI would enthusiastically rehire Derek. He is doing well and his current understanding is where it should be given the complex domain. His proactive efforts to get hands-on experience and build context show promise.\n\n**Luke Strebel:**\nDerek's brand new to the team, only about a month in, so I don't have a lot of concrete examples with him yet. My initial impressions are very positive. I feel like Derek's pretty bold; he asks lots of good questions and seems to be paying attention.\nI definitely think he's super **kind** with the way he talks to the team. He finds ways to ask questions that aren't confrontational, and his attitude is always **curious**. He is focused on \"doing the right thing\"—some of the questions he asks are specifically trying to understand the customer implications and how it's policy-compliant, which is **exactly the right thing to be focusing on** for this team.\nThe main feedback for you is about onboarding. The \"gold standard\" here for me was Scott. He onboarded extremely quickly and within two months started taking ownership of things like interrupt, monitoring Slack, and built enough trust that we recommended him to become the anchor. The *way* he did this was by being proactive: he started making a Mural to describe the experience he saw, to communicate \"am I understanding this correctly?\" He was also just really good about it: if there was **an action item** and he didn't know how to do it, he would **just take it, ask questions along the way, and then deliver it himself**. He wouldn't pass the buck.\nThat's what shows you're onboarding really, really successfully. The other thing Scott did well was, if there was a question, he just pinged me, and I'd jump in to pair and talk through the domain. With this team, **progressive disclosure is okay for like three months, but then at some point, you need the full fire hose.** Productivity and ownership are super super critical for this team. \nI'm hoping your experience on TAK, where there wasn't a lot of guidance, is something you can **bring here**. That will set you up for Success here as well because, as you've seen, we consistently have 3- or 5-point stories. That amount of ambiguity just **requires communication.**\n",
  "start_stop_keep": "**Noah McHugh:**\nKeep doing what you're doing. Start diving into more projects that you're able to get your hands on to broaden your reach.\n\n**Kyle Dozier:**\nKeep: Taking opportunities to work on new projects, pairing with new people, and learning new technologies.\nKeep/Start (I didn't get to se how much he is already doing): Embracing the new AI workflow. Improving them.\n\n**Branden Van Derbur:**\nStart:\n- No notes\nStop:\n- No notes\nKeep:\n- Bringing a great attitude to pairing\n- Asking questions about the domain\n- Seeking a deeper understanding if our processes\n\n\n\n\nI want to put this here as I don't think it falls into the three questions - I would be cautious about critiquing methods or team implementation straight away without a full understanding or viewpoint of the system and larger domain. An example is our implementation of SDElements and our assessor workflows. A critique was made that assessors should be using SDE a certain way and that we aren't implementing that feature for them when the answer was, SDE is strictly to track compliance, not actually go and enforce it with a technical solution itself. This isn't a bad thing, I would just heed caution that we should be mindful of the full stack and implementation before telling the team we are doing something wrong.\n\n**Scott Carlson:**\n**Start**: Escalate more to the team if things aren't working during onboarding or if there are gaps and help us document them in an onboarding document. Maybe even re-writing the VA onboarding doc (with AI?) could be useful to cover gaps.\n\n\n\n\n**Stop**: Make sure to communicate to your pair daily schedules/interruptions to keep things flexible and make sure you're on the same page\n\n\n\n\n**Keep**: Being chill and eager to learn and try new things. Keep sharing things that worked and didn't work on past contracts to see how we can apply things here in Lighthouse.\n\n**Sally Yoo:**\n**Keep:**\n- Keep up your enthusiasm to get as much hands-on experience as possible in multiple areas of the domain, this will really help solidify context.\n\n**Luke Strebel:**\nFor your **start/stop/keep:** **Start** being proactive by adopting the behaviors that made other teammates onboarding successful: take full ownership of action items from start to finish, even if you don't know how to do them (don't pass the buck), and create visuals like Murals to confirm your understanding and communicate it back. **Start** learning the pipeline and all the domain stuff. And definitely **Keep** asking those good, curious questions.\n",
  "generation_timestamp": "2025-12-04 17:48:01"
}