{
  "employee_name": "Dylan Doub",
  "accomplishments": "I was heavily involved in the development of the daily Aqua runtime scans. By building daily, automated security scanning, we are making sure that we are providing consistent security findings to assessors to give actionable feedback to their teams.\nI helped research and push FIPS compliant IronBank SD Elements images to our environment to stay ahead of the curve with our compliance when the platform is moving toward FIPS compliance.\nI helped enhance our team's ability to see and react to errors and issues. We refactored our DataDog logging for clarity, added critical PagerDuty alerts to notify us of pod failures, and modified our CRM database and PowerBI dashboards to track and visualize \"first_detected\" and \"last_detected\" data from our scans to help track MTTR.",
  "enps_comments": "**Branden Van Derbur:**\nThis is a hard question to answer. I'm basing this answer on the overall birds-eye assessment of Dylan from a growth perspective. I will absolutely acknowledge that Dylan has grown over the year, however, maybe not at the pace expected for the team(?). This would be an agree if Dylan at this point and time could pick up a ticket and run with it solo without much need for assistance or clarifications, however, I'm not confident in this current ability as of today.\n\n**Luke Strebel:**\nDylan, you have a really infectious energy. One of the things I loved was when we did the \"fun time\" bracket; I felt like you were the most engaged in that meeting than in any meeting we've had. My first thought was, \"How do I get *this* Dylan in pairing? How do I get him in IPM?\" I can see that you have strong opinions, and I want to find ways to get them out in our day-to-day domain work. This is the main gap in **'Be Bold'**—you've mentioned you second-guess yourself, but we need that \"fun time\" bracket energy and confidence in our domain discussions.\nI would **'enthusiastically rehire'** you for a role at Rise8 100%. I think I might have had you on a slightly different Rise8 contract before throwing you into the deep end on SecRel if we were to start over, but you're developing into a strong contributor! So please, **keep** bringing that infectious energy, and let's **start** channeling it into the domain.\n\n**Sally Yoo:**\nI would enthusiastically rehire Dylan. He is a knowledgeable and kind peer who has demonstrated patience and good judgment (recognizing when design input was needed) during the DARS work. He has consistently shown good dev pair qualities and practiced good follow through.\n\n**Jeremy Arzuaga:**\ninitiative and skill set for this particular role is what lead me to a lower a rating. More discussed below.\n\n**John Zubiri:**\nI would like to see Dylan take more initiative and be more proactive. He has been on the team for a while and it is hard to see him take ownership of creating value and outcomes. Dylan has a good personality and he is easy to talk to. He has grown better at being more vocal in team meetings and I would like to see that growth translate to his technical and implementation skills. I believe he has potential to be a great A-player but I would like to see more courage or desire to really drive and get things done.\n\n**Scott Carlson:**\nDylan is a great teammate to work with. He’s very humble, kind, and easy to get along with. He shows up and communicates well. During pairing he helps me challenge my assertions when going through challenging business logic and had the grit to continue on until the task was done.\n\n**Derek Dombek:**\nI've only been working on the VA Secrel team with Dylan for the past few weeks and have only paired with him a couple days but when we're all in the same meetings our personalities seem to really click! He's very respectful and considerate of others, Always willing to help and be there for the team. Seems to have gained a good grasp of everything thats going on domain wise. Not fully sure where he shines or lacks engineering code wise yet but I'm sure I'll find the out soon enough when we are paired together in the future more.\n",
  "start_stop_keep": "**Branden Van Derbur:**\nStart:\n- Asking more questions, even if you feel you have a grasp on something.\n- Seeking more opportunities for challenges that force you to view our domain from the broader picture, rather than the fine lens\n- Being more assertive in driving tasks and asking to the take the reigns, especially on tickets where domain context/knowledge might be strained. Use this as an opportunity to fail fast and recover fast, and learn with your pair.\n\n\n\n\nStop:\n- Being afraid to speak your mind\n\n\n\n\nKeep:\n- Bringing a positive and fun attitude to the team\n- Delivering meaningful actions to the team\n\n**Luke Strebel:**\nI've seen a lot of improvement from when you first started, and you're doing a lot better work with more meaningful contributions. The thing that concerns me, and what we have to be **'Real'** about, is the SD Elements risk policy story. I felt that Branden had to lead that entire feature. When I came in and asked questions, I was hoping those conversations would have already happened. It was a red flag because it showed a gap in assumptions about what \"good\" looked like for the rollout.\nThat release was not up to the standards I expect. It shouldn't require product to come in and help troubleshoot. I expect a pair to be able to find those domain-specific issues. This is the **'Do What Works'** bar: if some of our other domain knowledgeable engineers were the pair this week, I think I wouldn't have had to ask those questions. I know you'll **'Do the Right Thing'** and want to do right by the customer, but to do that, you have to understand them at that deeper level.\nTo get there, you have to own your **'Growth Mindset'** path. When we last spoke, we discussed a 1-on-1 or a skills matrix, but we never did it. I was hoping you would be the one to own that and schedule it. That's the first step.\nThe second is to change *how* you work. Instead of just nodding in agreement, I need you to **start** drawing out your understanding. Take a second and try to draw it out in a visual, maybe in a mural, and then get that validated. This helps me write better ACs and gets us on the same page.\nFinally, you need to own **'What is Required'** from start to finish. You do a good job during interrupt, but don't pass the buck. **Start** owning the task, ask questions, close the loop, finish the story, and then *write the outcome* for it. The team needs to own our **'Outcomes,'** and I need you to kick my @ss if they aren't being celebrated!\n\n**Sally Yoo:**\n**Keep:**\n- Stay curious about user research and product strategy, ask what's going on and how you can help.\n- Keep working on becoming an expert on the Secrel domain.\n\n\n\n\n**Start:**\n- Flexing your current knowledge of the domain by helping new devs catch up on concepts.\n\n**Jeremy Arzuaga:**\nIn the time working with Dylan I think he's been trying to understand the code base as quickly as possible. I think there's a lot to learn. Dylan has definitely been more vocal in IPMs as time went on.  I do think more ownership over stories is necessary. It was sometimes unclear what progress was made when not pairing.  At times I felt like I was giving a lot of direction and correction when working on a stories together.    More focus on learning sql, python, and k8s is going to be crucial to be successful.\n\n**John Zubiri:**\nStart: Leading more in pairing and implementation. I think this is key to accelerating your growth.\nStart: Voice any thoughts or questions you have when the team is deciding on implementation patterns, structure, details\nKeep: Contributing and feeling comfortable voicing your thoughts. Over the year you have been growing your voice and I would like to see more presence and opinions from you\n\n**Scott Carlson:**\nDylan needs to be more bold in taking initiative outside of pairing time (bias for action than waiting for agreement or approval). He needs more courage to take appropriate risks, internalize learnings from those actions, and fix things quickly when they’re wrong. Our team always has each others’ backs and can help pivot and fix things when we get things wrong. This boldness and courage will also help during pairing to take the wheel when needed instead of waiting for it to be given to him.\n\n\n\n\nI would love to see Dylan get more comfortable being in uncomfortable positions. I would love to see him speak up more and take the wheel on his own more. I'd also love to see him take stabs at designing solutions for stories and also Pre-IPM. He’s a smart guy and a very helpful pairing partner. Keep all that up!\n\n**Derek Dombek:**\nStart: From being new I've noticed somish lack of technical documentation on the team from an onboarding perspective. Since you've gained a good grasp pretty quickly on how a bunch operates, taking sometime to document your past and present experiences would help the new comers and even the tenured folks on the team tremendously!\n\n\n\n\nStop: You seem to have a tun of knowledge about all our working systems and would love to get your personal perspective on things some more. Its impossible to tell right now but definitely keep from second guessing, just do. We're all bound to make mistakes along the way but those mistakes are how we get better.\n\n\n\n\nKeep: I'm sure you hear this all the time but always keep that authentic kindness about you! The way you interact with others is very welcoming and pleasant to be around. Makes it easy for new people like me to approach you for sure.\n",
  "generation_timestamp": "2025-12-04 17:48:01"
}