{
  "employee_name": "Jeremy Steinbeck",
  "accomplishments": "**Accomplishment 1: Bootstrapped and established the FORGE Cyber Practice as a Product Manager.**\n- **Impact:** This directly supports Rise8's mission to assemble high-performing teams by creating a necessary and sustainable capability. It allows Rise8 to deliver on brand promises by offering comprehensive security services and enables growth into new, security-focused client work. I worked closely with the more senior PM to help set up the cyber team to work more effectively like a product team. This has positively impacted the value streams that outcomes that the Rise8 FORGE cyber team has achieved. \n**Accomplishment 2: Drove critical action and achieved success on the FORGE program.**\n- **Impact:** Despite unclear initial requirements, I ensured the cyber team is on track to meet critical milestones, which will directly lead to mission success for the client. This reinforces Rise8's reputation for delivering outcomes and secures our standing with a key customer. Before I joined the team there was no clear path to success and the team was floundering. I help steer the team in the right direction. \n**Accomplishment 3: Restored and created trust with the client when it was in jeopardy.**\n**Impact:** This stabilized a critical client relationship, securing future work and embodying the value of Do The Right Thing. Strong, trusting customer relationships are foundational to Rise8's ability to fulfill its promise. By showing up every day and representing Rise8 as the SME in Cloud, RMF and Security Engineering we have gained the trust of the client.",
  "enps_comments": "**Octavia Leon:**\nJeremy embodies the A Player — dependable, sharp, and always willing to help out the team. He tackles tough problems without hesitation and keeps things moving in the right direction. He’s got great follow-through, solid communication, and a good attitude that makes working with him easy. I’d definitely rehire Jeremy without a second thought.\n\n**Steven Bair:**\nJeremy joined the program while it was already underway and immediately demonstrated grit by immersing himself and hitting the ground running. He brings a wealth of wisdom regarding cybersecurity, RMF, and DoD platform delivery that has been invaluable to our success.\nHe has gone above and beyond to do what is required, stepping into dual roles as both Team Anchor and PM. In this capacity, he has excelled at prioritizing work, documenting strategy, and ensuring radical transparency in who is doing what. Perhaps most impressively, Jeremy has been a stabilizing force during team shifts. He presents a consistent, calm face to external stakeholders, building a high degree of trust with a challenging audience—proof that he knows how to manage relationships to achieve outcomes. He also embodies a growth mindset, taking feedback in stride and taking immediate action to improve.\n\n**Joshua Pritchett:**\nJeremy is currently operating at a high capacity, effectively navigating a project with high complexity (resistant stakeholders, large cyber scope). He stands out for his willingness to challenge the status quo to drive results, while possessing the emotional intelligence to recover and strengthen relationships during difficult periods.\n\n**Ashley Pearce:**\nJeremy is a phenomenal Riser and I look forward to everything he will do at Rise8.\n\n**Pedro Torres:**\nJeremy's decades of experience in cybersecurity has made him a sought-after subject matter expert in complex cybersecurity topics and issues. Under his leadership I've felt that I've made significant contributions towards ATO requirements. I'd be happy to continue working under his leadership, and having him as a mentor.\n\n**Samuel McQueen:**\nJeremy has been the backbone for Cyber on the FORGE Program. His knowledge and willingness to take on the hard task has been critical to our team. He has shown excellent planning and leadership skills throughout the time I have worked with him.\n\n**Benjamin Alvarez:**\nJeremy has been doing great as the Cyber Lead, communicating customer requirements and proactively identifying potential concerns with current tasks.\n",
  "start_stop_keep": "**Octavia Leon:**\nKeep doing what you’ve already been doing. Your consistency, attention to detail, and willingness to help others really stand out. You bring a calm, steady presence that makes complex situations easier to handle. I’d love to see you keep leaning into mentorship and sharing your expertise with the cyber team as a whole since you’ve got a lot of practical insight that helps others level up. The only thing I’d say to start doing is to take more visible ownership of your wins, you do amazing work and it's something that should be recognized.\n\n**Steven Bair:**\n- Keep being that deep well of knowledge. Your expertise is massive, but the grace with which you share it is what makes you a true Riser. I look to you as an example of how to maintain reason and focus amidst chaos.\n- Keep maintaining that calm, consistent voice. You have done an incredible job aligning multiple parties and gaining trust under pressure. Your demeanor is a perfect example of temperance and is vital for our stakeholder management.\n- Keep feedback loops tight, but Start escalating to leadership more quickly when that feedback doesn't produce change. We value radical truth, and if a blocker persists, we need to know so we can help resolve it.\n- Keep up-skilling those on your team to reduce the number of plates you are spinning. To maintain a sustainable dream team, you need to be able to hand off responsibilities without worry. We need to protect you from burnout so you can take the time off you deserve.\n\n**Joshua Pritchett:**\n- **Start** acting as a \"force multiplier\" by delegating authority. Empower your senior engineers to own entire domains rather than just distributing tasks. This trust builds their confidence and frees you to focus on strategic influence rather than day-to-day execution.\n- **Start** enforcing an \"action over semantics\" boundary when clients get bogged down in terminology. Stakeholders often lose sight of the actual delivery goals by obsessing over definitions. When this happens, pivot the conversation back to tangible execution to ensure the focus remains on unblocking the mission rather than debating words.\n- **Consider** shifting from being the central \"source of truth\" to the architect of shared knowledge. While your deep expertise is a huge asset, holding architecture and compliance details centrally can create a bottleneck. Codifying these answers will allow the team to operate independently and help protect you from burnout.\n- **Continue** challenging the status quo to drive delivery. Your willingness to push back on government stakeholders to ensure we are shipping value, even when it creates friction, is a vital quality. You balance this necessary friction with the emotional intelligence to maintain relationships, which is rare.\n- **Continue** upskilling the team to build a high-performance culture. You have successfully fostered a team that is laser-focused on high-quality delivery. Continuing to mentor and grow the technical capabilities of those around you is essential for the team's long-term success.\n\n**Ashley Pearce:**\nMy only suggestion would be to work toward being able to give feedback directly to Risers. It's important to ensure Risers are aware immediately when/if there is an issue before escalating to leadership. This gives the Riser the chance to correct the behavior and/or provide feedback of their own.\n\n**Pedro Torres:**\nKeep doing what you're doing, you're awesome!\n\n**Samuel McQueen:**\nJeremy keep doing what you are doing, I would suggest that you take time off and don't stress yourself out as much or work until you are burned out. Work wise you have been instrumental to our team meeting its goals thank you.\n\n**Benjamin Alvarez:**\nContinue engaging the team and the customer, identifying nexts steps and providing the knowledge when needed. When the team is more mature I think Jeremy should start allowing the rest of the Cyber team to take on more responsibilities and focus more on engineering tasks\n",
  "generation_timestamp": "2025-12-04 17:48:02"
}