{
  "employee_name": "John Zubiri",
  "accomplishments": "Helped develop and architect our PowerBI runtime assessment dashboard that assessors use.  This dashboard is still a work in progress but it is a functioning tool that the assessors use as an overview of the state of tenants security. They appreciate the dashboard and the stakeholders appreciate the dashboard for measuring platform accepted risk.\n\n\n\n\nI led the engineering work to decommission Snyk and migrate our pipeline to using CodeQL without affecting tenants. The transition went smoothly and as a result our team had an outcome. We have submitted quite a few outcomes. I believe roughly 14 if I track correctly. Stakeholders and leadership are very pleased with us. There is a desire to keep Rise8 on the Lighthouse program. This is one accomplishment I'm proud of is leading this work and seeing it be successful, smooth, and well received.\n\n\n\n\nOur team had a bit of turnover this year and as someone with the most experience I helped train new members to be valuable contributors to the project. That led us to work smoothly and without interruptions.",
  "enps_comments": "**Luke Strebel:**\nJohn is one of the **most competent Engineers** the team has had the privilege of working with. He is going to get the story done, whether it is well-written or not, and he isn't going to complain about it. Instead, he gives **constructive, team-first feedback** in retro or speedback. As the most senior engineer on the team, he is in a great position to help the team improve.\nHis decision to turn down the anchor role helped me re-align this expectation/ratings based on being a \"Best in Grade\" *developer*. He has **best-in-grade contributor**. A key example is his external awareness—surfacing concerns about the platform team, Andrew Bunker, and the GitHub migration. This is a Top 1% skill, but it's feedback that is often only shared in retros or 1-on-1s, rather than proactively.\n\n\n\n\nThe things that would take John to the \"next level\" a year from now (or if he wanted to be an anchor) are about \"closing the loop.\" He's great at seeing potential issues; the next step is helping to track them and define the action items. A specific area for this is to be more proactive with **tech debt**; as the most senior dev, his help is needed in managing this, especially with the GitHub migration.\n\n\n\n\nThe other key \"next level\" item is to **help write and own *outcomes*.** He needs to be part of the collaboration to push back and ask, \"Why are we doing this? How is this helping the user?\" Right now, the dev team needs to have more accountability and ownership of that final outcome, including presenting it. Lastly, it's unclear what his current personal growth goal is, and that's a key part of his continued development.\n\n**Branden Van Derbur:**\nJohn's a critical asset to this team and it shows in everything he does.\n\n**Scott Carlson:**\nJohn is a critical team member and leader. I frequently look to him for guidance and for evaluating impact of architectural decisions. He always does right by the team and customer. He always speaks up in group discussions. He’s very chill and easy to work with.\n\n**Dylan Doub:**\nJohn brings a vast amount of expertise and thoughtfulness to the team which makes working with him easy and a great learning experience as well.\n\n**Sally Yoo:**\nI would enthusiastically rehire John. He is a valuable and highly supportive team member who is consistently helpful, patient, and insightful. He has already begun stepping up to co-lead Tech Lead tasks with Scott**** and is a reliable teammate who will always \"say it as it is\" when things need to be changed.\n\n**Jeremy Arzuaga:**\nCan't say enough great things about John. Wish we got to pair more over the last few months. He's easy to work with and determined to ship valuable features that improve security of LH. He takes initiative and does what's required. I think he handles uncertainty really well especially when it came to evaluating new security products\n",
  "start_stop_keep": "**Luke Strebel:**\n- **Start:** Proactively tracking and surfacing tech debt and platform concerns (not just identifying them) and helping to define the action items.\n- **Start:** Helping to write, own, and present the *outcomes* for your stories, and pushing back on the \"why.\"\n- **Start:** Sharing your \"outside the story\" insights (like the platform risk) proactively (e.g., pre-ipm, ipm, uat), not just in retro.\n- **Start:** Sharing your personal growth goals so the team can help you close that gap.\n- **Start:** Make an conscious effort to make sure our newer engineers and (especially Scott) have deep context about how our app is designed. Help us know where the skeletons in the closet are so we can prioritize fixing them!\n- **Keep:** Your \"Best in Grade\" competency. You are one of the most reliable engineers on the team.\n- **Keep:** Your constructive, team-first feedback in retro.\n- **Keep:** That external awareness (platform risks, etc.). It's a top-tier skill.\n\n**Branden Van Derbur:**\nStart:\n- Encouraging insight from newer teammates during domain design meetings such as IPM, etc to keep them included and focusing on broader pictures\nStop:\n- No Notes\nKeep:\n- Encouraging top quality work\n- Being a great mentor for the team\n- Being a great fella to work with\n- Bringing a great vibe to the team\n\n**Scott Carlson:**\n**Start/Stop**: At the beginning of a pair swap, maybe talk about approach on how we want to pair for the story. One pairing session felt a bit directionless on how we're going to implement and also how to share the driving (I'm also to blame for that). We have some team members that need to be a bit more bold and have a bias for action. Sometimes identifying expectations for the pair will help for these people.\n\n\n\n\n**Keep**: I rely heavily on John's experience and depth of knowledge in the VA Lighthouse space. He steps up and speaks out during IPM and huddles to make sure we're doing the right thing the right way. Keep that up! John also is great at making sure the team doesn't have silos. John is great at going with the flow and pivoting on the spot if needed.\n\n**Dylan Doub:**\nStart: Bringing more of your knowledge and thoughts as a senior member of the team to the table. You can be a little quiet sometimes, but when you speak up, your input is incredibly valuable.\nStop: There are no behaviors that I believe you should stop.\nKeep: Diving into problems trying to understand everything\n\n**Sally Yoo:**\n**Keep:**\n- Keep giving insightful feedback to the team and being direct in your communication\n- Maintain your helpful and patient approach when explaining things to new people.\n\n**Jeremy Arzuaga:**\nStart\n- would love to see if you be the anchor. I think it's a crucial next step for growth and showing your leadership skills\n\n\n\n\nContinue\n- Leading stories and making sure they get across the finish line\n- Providing your perspective during pre-ipm and ipm \n- being a great peer to work with\n",
  "generation_timestamp": "2025-12-04 17:48:03"
}