{
  "employee_name": "Justin Joseph",
  "accomplishments": "1. **Leading Cross-Program Cloud Architecture for Space Force Teams**\nThis year I was the only Rise8 engineer fully embedded with the Nebula customer team, which put me right at the center of how Space Force is trying to modernize and deliver. That let me take everything we learned on Nebula and turn it into clear guidance and repeatable patterns that other Rise8 and Space Force teams could actually use. A big part of that was helping Gateway understand what a real path to production looks like on Nebula and making sure they had a foundation that would actually work at scale.\n\n\n\n\nI also played a key role in shaping what FORGE’s infrastructure looks like today. A lot of the early architectural decisions and secure AWS patterns came directly from the lessons we proved out on Nebula. By sharing that knowledge and helping FORGE get set up the right way, we now have multiple Space Force programs aligned on a modern, secure, and consistent approach to building and shipping software.\n\n\n\n\n**2. Leading All Internal Rise8 AWS Management During Rapid Growth**\n\n\n\n\nThis year I became the sole AWS technical lead for AWS related work that entered our Rise8 ecosystem. All account onboarding, technical setup, architecture patterns, and long term AWS strategy started and ended with me. We brought in roughly twenty to twenty five new accounts in six months, and I personally ensured each one had a secure and scalable landing zone, proper guardrails, and the right foundation to succeed. I owned the entire pipeline, which allowed the partnership side of the business to grow quickly without stalling on the technical work.\n\n\n\n\nSean was originally hired as director of tools and was a huge help, but after his departure the responsibility for our AWS infrastructure and onboarding tool set fell entirely back to me. Despite that, nothing slowed down. I kept every system running, continued onboarding new accounts, and maintained the automation and patterns that the business depends on. It has been a heavy lift, but it allowed Rise8 to keep expanding partnerships and delivering value without missing a beat.\n\n\n\n\n3. **Building Automation and Standing Up a Complete IL2 Environment for Nebula**\n\n\n\n\nAnother major accomplishment this year was standing up a full IL2 environment for Nebula completely from scratch and turning it into an automated, secure, and repeatable system. I built the core networking, SSM and DHMC setup, logging pipelines, cross account access patterns, flow logs, landing zones, and all of the guardrails we rely on. The focus was on automation first so Nebula would have a foundation that is reliable, scalable, and easy to reproduce as the mission grows.\n\n\n\n\nThis work will open the door for more companies to onboard into the Space Force ecosystem with fewer barriers and a much smoother path to production. By having a modern IL2 environment ready to go, Nebula can support more launches, onboard partners faster, and reduce the friction that usually slows down adoption. All of this directly strengthens Rise8’s mission of accelerating secure delivery and giving teams a clear and simple path to prod.",
  "enps_comments": "**Kyle Dozier:**\nI have been co-managing our IT Cloud infrastructure with Justin for over a year now. He is consistent and persistent, always on his game. I appreciate that he is direct and to the point in his requests, feedback, and general communication. He prioritizes well under pressure and response quickly in crisis. He is a valuable member of rise8.\n\n**Wayland Pearce:**\nI would enthusiastically rehire this Riser because he’s been a huge help to me and to the company. He manages our AWS environment with a level of calm and confidence that makes everything feel easier. Even though he’s not on my team, he never hesitates to jump in, answer questions, or walk me through things I don’t have experience with. He’s patient, easy to work with, and always willing to explain the “why,” not just the “how.” He makes complicated stuff feel manageable, and I really value how dependable and supportive he is.\n",
  "start_stop_keep": "**Kyle Dozier:**\nKeep: Being direct and consistent in your work and comms.\n\n**Wayland Pearce:**\n**Start:**\nStart pushing for a dedicated person on the IT/Ops side so you don’t have to be the bottleneck for every AWS-related task. You shouldn’t have to carry all of that alone, and having the right support will free you up to focus on the deeper engineering work you’re great at.\n**Stop:**\nStop downplaying how much you do behind the scenes. You take on a lot, and the impact is real don’t sell yourself short.\n**Keep:**\nKeep being the steady, patient, and incredibly helpful person you’ve been. The way you jump in, walk people through problems, and make complex work understandable has been a huge help. Your reliability and willingness to support others makes a big difference company-wide.\n",
  "generation_timestamp": "2025-12-04 17:48:03"
}