{
  "employee_name": "Kenny Slater",
  "accomplishments": "Building trust with the customer: I believe by taking the initiative to travel multiple times to meet with our customer face to face early in the contract is a key driver of why Bifrost WILL be successful. I also believe that I have built relationships with a sister project called Project 6 which delivers strategic advantage. Project 6 has a higher priority than Bifrost and by building that relationship, I have artificially raised our priority piggybacking off their precedence. I always ensure that all customer facing engagements represent Rise8 to the highest standards.\n\n\n\n\nBuy in on the Bifrost ATO strategy: This is a work in progress, however I have 1. Developed the ATO strategy and 2. Briefed our ATO strategy to our customer over 5 separate times, each time with key stakeholders and changing with their feedback and guidance for approval. This has been a challenging task as getting approval for a CI/CD platform that delivers Government and 3rd party applications using a 3rd party contracted tool (Palantir Mission Manager) to multiple classifications is not an easy task. I believe the odds are stacked against us for a plethora of reasons (customer not wanting to give us our own ATO, customer not wanting to approve GitLab, customer not wanting to approve DevSecOps within their boundary, etc.) but I truly believe we are getting closer and closer to approval and I will not stop until we get everything we need and want. \n\n\n\n\nPositioning myself as a key player within the Bifrost and RMF team: I humbly believe that within my short time here, I have worked hard to gain the trust (from the team) in making big decisions that affect the Bifrost mission. I have earned the respect of my peers and leadership to brief the customer and engage in company RMF discussions on a consistent basis. I have written the majority of Bifrost policy and security related documentation. I feel comfortable engaging with leadership and capturing Bifrost's interests.",
  "enps_comments": "**Dan Sanker:**\nHe is a key driver for the team, consistently advocating for us to do the hard work needed to get things across the finish line. Just as importantly, his positive attitude and friendly demeanor make him an excellent collaborator and a pleasure to work with. He has a rare combination of skills that builds confidence: his resume shows he *can* do the job, while his words and actions provide *certainty* that he's doing it right.\n\n**Chris Johns:**\nKenny is the indispensable subject matter expert responsible for navigating the project's most significant challenge: achieving the Authority to Operate (ATO). His contributions span high-stakes political strategy, deep technical compliance execution, and critical efforts to maintain team clarity and process efficiency. He is the anchor for all Risk Management Framework (RMF) and security accreditation efforts. Kenny has repeatedly taken the initiative to engage high-level stakeholders and define the project’s complex path through bureaucracy, viewing the challenge as \"high risk, high reward\".\n\n**Bryce Nguonly:**\nYou have been insanely helpful, I've never had the opportunity to work with someone so close to the ATO effort before. But I see how helpful it is to have someone dedicated to that effort, from actual paperwork to aligning epics to cover for cyber requirements, your work helps breakdown engineering into more digestible pieces.\n\n**Tiyyiba Zahid:**\nI completely agree. Kenny consistently delivers high-quality work, demonstrates strong ownership, and is a collaborative teammate who elevates those around them. He embodies Rise8’s values through his proactive communication, growth mindset, and focus on impact. I would enthusiastically rehire him for his role and trust him to take on even greater responsibility in the future.\n\n**Clark Pain:**\nKenny does whatever it takes to get the job done. He's invested tons of time and stepped way out of his comfort zone to find ways to support the team. I would absolutely jump at the chance to work with him again.\n\n**Delaney Coveno:**\nKenny is doing a fantastic job leading our ATO efforts and sharing his infosec and RMF knowledge with the team. He also does a great job balancing sharing his knowledge and process without information overloading the rest of the team. He is passionate about his work and great to work with.\n\n**Erica Chang:**\nThe Bifrost team has been very lucky to have Kenny leading the RMF side of the project, especially with his extensive experience with ATO packages. Kenny is always willing to do what is required and has advocated doing the right thing since the very beginning of the project. While we continue to iron out the ATO path with our government stakeholders, he keeps the team encouraged with our progress and puts everyone at ease. Given that our path continues to be murky, he's always working to figure out different avenues for our path forward. He's willing to go out of his way to have conversations with people, helping the team build relationships with folks like Jason Pinto and the Warp Core ISSMs, who were initially thought to possibly be detractors. These conversations have been invaluable as we ended up with more advocates on what are deemed higher priority projects to the program office, opening up more options for us to explore for accreditation. Kenny is an essential member of the Bifrost team.\n\n**Jeremy Viray:**\nKenny's impact on the team has been both grounding and energizing. His expertise is evident in the way he confidently guides complex conversations, highlights risks with precision, and lays out well-reasoned solutions and fallback options. He brings a sense of stability and direction that elevates the entire team’s performance. Kenny is the kind of teammate you want beside you on any challenging project.\n\n**Ashley Pearce:**\nKenny is always willing to jump in when needed and is great at really breaking down RMF and ATO related terms and practices. He was my right hand when it came to building up the RMF practice and I couldn't be more thankful.\n\n**Jeremy Steinbeck:**\nIn an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year\n",
  "start_stop_keep": "**Dan Sanker:**\nStart:\n- Proactively identifying and championing the automation of your manual tasks. Your deep experience with ATO packages and change requests is a huge asset. Your next level of impact will be to *start* treating those manual tasks as automation opportunities for our SWEs, not just as work you have to do yourself.\nStop:\n- Stop (or at least, be the first to challenge) the default acceptance of these manual processes. It's tempting to just get them done, but I'd like you to stop and ask, \"How can the engineers contribute to this so we *never* have to do it manually again?\"\nKeep:\n- Being the person who advocates for getting things across the finish line. That results-oriented drive is critical.\n- Providing that \"certainty\" in your work. Your high-quality, reliable output is what allows the team to move fast.\n- Keep that positive attitude and friendly demeanor. It makes the team better and is a huge part of what makes you so effective.\n\n**Chris Johns:**\nKeep Doing:\n- Keep prioritizing and driving the production of core compliance documentation.\n- Keep advocating for the integration of compliance checks directly into the automation pipeline.\nStart Doing:\n- Start translating security requirements into actionable tasks and knowledge transfer sessions for the engineering team.\n- Start building the clear, concise messaging product regarding the platform’s value proposition.\nStop Doing:\n- Stop allowing the lack of formal approval to dictate the speed of internal compliance documentation efforts.\n- Stop needing to manually enter and manage compliance data that could be automated.\n\n**Bryce Nguonly:**\nYou have definitely been very active in engineering discussions despite it not being your trade. But having you in those discussions, offering opinions from a compliance and cyber security point of view has been tremendously helpful. Having you learn about the engineering efforts has vastly improved how our team tackles architecture diagrams all the way down to more technical efforts like what kinds scans can we run. \nGoing forward it might also be helpful to hop in a breakout room with a pair whose story might be more cyber/compliance focused just to help them think and align on a solution. Having your perspective is like adding another dimension of smarts to our team. \nAlso, I love when you breakdown the ATO discussions to layman's terms. It helps someone like me understand the details of what is actually going on. In the beginning you spoke a little to broadly just saying that you had the paths covered, but over time you actually broke down what documents you had prepared/worked on which painted a better picture onto what was happening from your side.\n\n**Tiyyiba Zahid:**\n**Keep:** Maintaining his strong focus on compliance and ATO success. Kenny’s ability to navigate complex RMF requirements, find creative paths forward, and keep the team aligned with security expectations has been instrumental to our progress. His persistence, deep understanding of cybersecurity principles, and solution-oriented mindset continue to set a high standard for excellence. It’s clear from his leadership, technical insight, and strategic thinking that he has the capability to excel in a higher-level cyber role, and I believe he would thrive in positions with expanded responsibility and decision-making authority.\n\n**Clark Pain:**\nKeep being flexible in finding solutions to the challenges the team faces. Keep engaging with empathy and curiosity. Keep having open conversations with people and helping the entire team learn. Next year, I'd love to see you coach Tiyyiba to her grow into an internal expert/leader as well as be capable of representing the team externally.\n\n**Delaney Coveno:**\n- Start: More frequently voicing the connection between our team priorities at the epic level and the security reasoning behind why something is a priority. For example, I only recently made the connection that our observability stack is so important because of security requirements. \n- Continue: Being a great teacher and being supportive of his teammates. Sharing his RMF knowledge with the team. Thoughtfully contributing to team ceremonies. Being actively involved in architectural conversations from the security perspective.\n\n**Erica Chang:**\n- **Keep** building on technical knowledge of the platform - the more you know, the more you can inform the team on any process/feature that needs to be implemented before we're in too deep on a specific feature.\n- **Keep** sharing/educating the rest of the team on RMF - the more we know, the more we can implement security and compliance earlier. Graham's departure especially opens up the need for this and people are receptive to learning more about RMF. \n- **Start** incorporating automation to parts of the RMF process - this should ease some of the burden on yourself/Tiyyiba as we continue to expand our customer base and you'll be able to focus on less manual tasks.\n\n**Jeremy Viray:**\nI love that you take the time and ask questions to understand the moving parts that aren't in your immediate domain so that you could have a bigger picture understanding of the project as a whole, keep doing it! I've never worked with an InfoSec Analyst before so I'm not entirely sure what to suggest you start or stop doing. However I do believe you're setting the bar high, keep killing it.\n\n**Ashley Pearce:**\nContinue being you! Expand your knowledge and and share it out with all Risers as often as possible.\n\n**Jeremy Steinbeck:**\nIn an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year\n",
  "generation_timestamp": "2025-12-04 17:48:03"
}