{
  "employee_name": "Kyle Dozier",
  "accomplishments": "Keeping the VA Platform Afloat (On Team Pinky) during contract changes. \n\n\n\n\nTaK - Developing the CI/CD pipeline, in ~2 weeks! \n\n\n\n\nEmbracing and Improving AI Workflows, then sharing them out with others",
  "enps_comments": "**Hafeez Rahman Mohammed:**\nI would enthusiastically rehire Kyle because his **commitment and resilience** have been truly exemplary. Even while navigating significant personal challenges (such as the recent RV issues) he consistently showed up, maintained a high standard of work, and proved to be a highly **reliable and dependable** team member. Beyond his hustle, Kyle is always **helpful and responsive** to team needs, making him a positive force who **actively contributes** to moving our shared goals forward. His dedication makes him an essential part of our workflow, and he is a Riser I want to keep working with.\n\n**Luke Strebel:**\nKyle's a top-tier developer, one of the best guys I've worked with. He's able to go deep into a vertical and see it through to the end, but he also has that rare talent of realizing he's too deep and knowing he needs to zoom back out and think about things at a high level. He's extremely knowledgeable and technical, which is easily seen by his work on TAK and the trust Rise8 put in him by pushing his name for the Pinky engineering lead position. He’s also a great go-to guy for a different perspective or to talk through problems, both technically and interpersonally. I think he does a great job prioritizing his family in a way that still makes him an effective developer—he has a passion for the work, which is becoming rare to find.\n\n\n\n\nIf Kyle had stepped into that Pinky leadership role, he would have been challenged in new ways. He has great peer-to-peer soft skills, but to be \"Best in Grade,\" he would have had to grow his peer leadership. His patience would have been tested, and it would have been hard because he'd have to give up flexibility and keyboard time for pairing and task management. That's the \"Top 1% Kyle\"; it's the gap he can choose to grow into, but it's not the role he's in. The other key area for growth is giving feedback *directly* to others. I get good feedback from him about other leads, but I don't know if he gives that same feedback to them. That's a challenging thing, but it’s critical. If you bring feedback back to Rise8, someone will ask, \"Have you told them?\" If not, it can undercut your argument and make you look like a complainer. You have to protect yourself and make your team better.\n\n**Branden Van Derbur:**\nKyle is always awesome to work with and I look forward to pairing with him when I have the chance.\n\n**Brent Baumann:**\nKyle is a phenomenal and indispensable asset to the team, consistently delivering high-quality, impactful results under pressure.\n\n\n\n\nKyle embodies the principles of **Grit** and the spirit to **Be Bold**. He entered the program during a highly challenging time and successfully rose to meet every obstacle. Critically, he has continued to persevere through the current difficult situation that followed, taking on every demanding task and consistently enduring hardship without complaint. He has single-handedly saved the program on numerous occasions, demonstrating a commitment to **Do What is Required** that consistently exceeds expectations and substantially improves the platform through quick, effective implementation of solutions.\n\n\n\n\nGuided by the principle to **Do the Right Thing**, Kyle helps the team **Keep it Real** by addressing difficult issues head-on. He is always kind and maintains a positive, eager-to-solve-problems attitude, making him an essential and highly welcome member of the team.\n\n\n\n\nKyle demonstrates an exceptional willingness to collaborate with colleagues across the team, readily offering support and sharing his knowledge. He approaches complex problems with an eagerness to learn and an adaptable mindset, viewing every challenge as an opportunity to master new skills and improve the platform. His ability to quickly assimilate information and apply new solutions is a significant force multiplier for the entire program.\n\n**Coty Allen:**\nI think Kyle got the short end of the stick on LHDI this year.   Kyle did everything expected of him, but the situation was not in his favor and was beyond what a single engineer can solve.   Kyle persevered through a tough year, and I acknowledge the effort that took.\n\n**Noah McHugh:**\nExtremely knowledgable, adaptable, and a great person to work alongside.\n\n**Justin Joseph:**\nKyle has consistently stretched himself above and beyond to keep the team moving, especially when we have had gaps or shifting priorities. I have only ever heard positive things about him, and my own interactions with him match that completely. He is always willing to help, always ready to set aside what he is doing to support someone, and brings a steady and positive energy every time. It has been genuinely great working with him.\n\n\n\n\nHe is also very forward thinking and I have seen him come up with ideas that push us toward better automation, smarter processes, and a stronger team overall. He is always learning, always open to trying something new, and truly invested in helping everyone grow. I am a huge fan of his attitude and the way he shows up for the team.\n\n**Darrell Mudd:**\nKyle has been a key member of our PE/CICD interview team this past year.  Kyle has continued to lean-in and volunteer to take on interviews (sometimes on short notice) whether it's the actual interview itself or reviewing video recordings and providing a \"second opinion\".  This is greatly appreciated as we often are faced with timing constraints and need to make a sound decision quickly on candidates.  Kyle is prompt in submitting his feedback into Greenhouse/ATS, and is often accompanied by a quick Slack message.\n\n\n\n\nI had an opportunity to observe one of Kyle's recent video recordings and was impressed with how he navigated the interview script.  Came across very professional, personable/genuine... took an appropriate amount of time at the end of the interview to open the discussion to the candidate and provided thorough answers to their questions.  These experiences help drive positive Rise8 employer brand impressions and candidate experience.\n\n**Mike Gehard:**\nI haven't worked directly with Kyle on a team, but I've observed his work through Slack and occasional conversations about his AI initiatives on the VA project.\n\n\n\n\nKyle demonstrated strong initiative when he adapted Matt's solutions repository to work with Github Copilot instead of Claude Code to fit within his VA project's constraints. What impressed me most was his focus on mission outcomes—he didn't just experiment with AI for its own sake, but made it directly applicable to delivering value for his team. He took action without waiting for permission, which exemplifies the \"get stuff done\" mindset. He continues to push AI adoption forward to help his team ship outcomes in production faster.\n",
  "start_stop_keep": "**Luke Strebel:**\nFor next year, my number one suggestion is to **start** shaping the contract transition proactively. Don't let change happen to you; be the change and build the team you want. This is a chance to set clear expectations from day one. **Start** being the one to track your suggested solutions from start to finish. Don't let them linger in the tech debt backlog; take ownership and finish them. And **start** pushing on product or engineering leads—give them that feedback and help build the leader you need. Finally, continue to be a super-tenacious teammate. You have a great \"problem sensor\" and you suggest great solutions, which is invaluable. Because you're not in that lead role, I'm not holding you to that \"Top 1%\" bar.\n\n**Branden Van Derbur:**\nStart:\n- No Notes\nStop:\n- No Notes\nKeep:\n- Pushing to expand AI knowledge and workflow\n- Being an awesome pair\n- Smashing barriers down when they appear\n- Bringing a great attitude to the team\n\n**Brent Baumann:**\nKyle has shown significant recent improvement in communicating last-minute personal conflicts affecting his work schedule. Building on this positive momentum, I think he should continue focusing on proactive schedule communication in the coming period. Specifically, when anticipating missing work for personal reasons, reaching out to stakeholders and management *earlier* will allow us to adjust priorities collaboratively, minimize potential downstream impact, and refine our resource planning.\n\n\n\n\nI strongly encourage Kyle to continue demonstrating his initiative and bold problem-solving approach. His ability to consistently be bold and do what works to solve complex problems and improve the platform is a significant asset. Maintaining this drive to improve the things around him consistently will ensure his continued high impact on the team.\n\n**Coty Allen:**\nKeep:  Pushing the program to improve while protecting yourself and your capacity to be effective every day.\n\n**Noah McHugh:**\nStop worrying too much about things outside of your control, I know its hard to, but at a certain point you are wearing yourself into the ground.\n\n**Justin Joseph:**\n**Start:**\nI would love to see you take the reins on more of the ideas you bring up and really run with them. You have a great instinct for what will make us better, and the ideas you have shared so far have all landed in the right direction. Lean into that even more. Propose more, take ownership where you feel inspired, and do not hesitate to push forward on the things you believe can improve how we operate. I think you have a lot of impact still to unlock, and I would love to see where you take it.\n\n\n\n\n**Stop:**\nI do not have anything meaningful for you to stop doing. I have not observed any habits or behaviors that get in the way of the team or your impact. From everything I have seen and heard, you show up in the right way and contribute positively, so there is nothing I would call out here.\n\n\n\n\n**Keep:**\nKeep attacking challenges the way you always do. Keep looking for ways to improve our overall Rise8 operations and our efficiency as a team. I love your ideas and the way you think about problems. You are a very talented engineer and have been a huge help in keeping us on track, keeping us accountable, and supporting the team wherever you can. You have been a real bright spot this year, and I would love to see you continue bringing that same energy into next year.\n\n**Darrell Mudd:**\nKeep:  proving genuine, positive candidate experience by virtue of the interviews you run.  This provides a \"day in the life\" and selling point for why candidates would want to join Rise8.\n\n\n\n\nStart:  you may already be doing this, but I do see some interviewers, in their write-ups provide a list of Pros / Cons / Conclusions which has been a great way to synthesis the feedback and perhaps determine leveling in some instances.\n\n**Mike Gehard:**\n**Start:**\n- Being more visible about your AI work on Slack. Share your wins, learnings, challenges, and questions as you go—not just polished summaries after the fact. Your work at the VA could inspire other teams to experiment with AI and show them what's possible within government constraints.\n- Actively leading AI adoption conversations within your VA projects to accelerate getting outcomes in production.\n\n\n\n\n**Stop:** Nothing specific—keep building on what's working\n**Keep:**\n\n\n\n\n- Focusing on mission outcomes when experimenting with AI. Your approach of making AI work directly applicable to VA project needs (rather than just exploring for exploration's sake) is exactly the right mindset.\n- Taking initiative within constraints and finding creative solutions that move the mission forward.\n",
  "generation_timestamp": "2025-12-04 17:48:03"
}