{
  "employee_name": "Scott Carlson",
  "accomplishments": "1. **Runtime Monitoring Pivot:** After thoroughly testing third-party tools (Orca, Wiz) and finding them unfeasible for the secure release and auditing processes, I led the pivot to an in-house solution using CRM and PowerBI/PowerApps. This action directly increases the client's security posture by expanding our runtime monitoring into areas outside the team's traditional scope.\n2. **Proactive Tenant CI/CD Partnership:** I identified a client CI/CD process that introduced hundreds of non-actionable vulnerabilities, and proactively worked with tenants to resolve it. This demonstrates Rise8's focus on client outcomes (actual risk reduction) rather than just delivering tools, helping the client focus on a smaller, actionable set of real vulnerabilities.\n3. **Base Image Vulnerability Bottleneck:** I identified a key bottleneck where inherited base image vulnerabilities caused a weekly deployment blockage for tenant teams. I designed an ideal solution that, once implemented, will clear a major roadblock, increase client deployment velocity, and shift user behavior toward better security hygiene instead of just suppressing alerts.",
  "enps_comments": "**Luke Strebel:**\nI'm just floored with how impressed I am with how quickly you onboarded.\nNot everyone would have felt comfortable becoming the anchor as quickly as you did, and I want to acknowledge that was **a huge leap** and a risk for you to take, and you have been **crushing it**. The anchor role adds the responsibility for the health of the team and all the \"sprawl\" outside the backlog, and you are doing a really good job of it.\n\n\n\n\nYou embody what it means to be an A Player. Sally noted very early on, \"If you need something done, just ask Scott. He'll get it done.\" That's the key skill. The ability to just take an action, not pass the buck, and find a way to get it completed is what I saw and why I wanted you as an anchor. You **'Do What is Required'** and **'Do the Right Thing'**—a perfect example is when you came right back online after your doctor's appointment and hung on until we were through that release. That showed great grit.\n\n\n\n\nYou've also set the standard for onboarding; I'm telling Derek, \"Whatever Scott did, you need to do, too.\" You started making Murals to understand the flow from your own lens and get feedback. No one else has done that. It's clear you came in with a deep engineering background and you \"know how to build software,\" even if you don't know the specific tool. You're a funny, nerdy guy, but you also have a maturity that the team needs, and you **'Keep it Real'**—I really respect how you're willing to push back in retro on things like scope creep, which makes us a better-performing team.\n\n\n\n\nMy only \"fear\" is that I don't have good insight into how *you* are doing with the role, so we need to find ways to check in on your health. The \"Scott a year from now\" growth path is about staying at this 1% level. Moving forward things like **Outcomes** and DORA metrics should be things that you identify and push for—not because you were asked, but because you were *curious* as an anchor about how to prove our delivery is healthy. That's the difference between \"now\" and \"a year from now.\"\n\n\n\n\nTo continue to earn this level, the next step is to grow your network, go to conferences (like Jeremy did when he found Nucleus), and influence the one-year roadmap. This will help you **'Do What Works'** at a strategic level. A good way to balance this would be to use your interrupt week as your dedicated \"anchor week.\" You can step back from the backlog, do those nebulous tasks, and then be a heads-down engineer the other weeks.\n\n**Sally Yoo:**\nI would enthusiastically rehire Scott. He has significantly stepped up into the Tech Lead role, demonstrating growth in his leadership capabilities. He successfully led the DARS v2**** delivery and is a great advocate for A-Player values by embodying them in his work. Scott is an excellent collaborator, is a confident representative for the team, and is a huge asset to the engineering perspective.\n\n**Jeremy Arzuaga:**\nScott quickly came up to speed with what we were working on at LH and contributed to the team almost from day 1. He's a great teammate and easy to pair with. He's proactive, continues stories when not pairing and isn't shy to speak up on his idea. This was super crucial when trying to redesign the CRM to support runtime MTTR tracking\n\n**Dylan Doub:**\nScott exemplifies what a senior engineer should be for a team.\n\n**Branden Van Derbur:**\nScott is a powerhouse and is always incredible to work with. He demonstrates clear knowledge and experience, and shares that with the team.\n\n**John Zubiri:**\nScott is a great engineer. I appreciate how he comes off as very relaxed and easy-going. He is very talented and capable on our team. I think he's a great example of a kind and collaborative teammate that gets stuff done. He has been very vocal and collaborative when it comes time to discussing implementation details or backlog stories. He isn't afraid to discuss things and he's always open to discussing things which I appreciate. He is a really good person to have on your team. Very technically capable.\n",
  "start_stop_keep": "**Luke Strebel:**\nFor **start/stop/keep:** **Start** formally adopting the \"interrupt week = anchor week\" model to focus on DORA, roadmap, and other anchor tasks. **Start** growing your external network (e.g., conferences) to influence the long-term roadmap. **Start** proactively communicating *your* stress/overwhelm; let's find a regular way to check in. **Keep** that \"I'll get it done\" ownership. **Keep** your proactive curiosity (like the DORA metrics). **Keep** creating visuals (like Murals) to confirm your understanding.\n\n**Sally Yoo:**\n**Keep Doing:**\n- Keep leading the team on discussions, such as the GH Action discussions, using visuals and maintaining a highly collaborative and engaging environment. \n- Keep up the great improvement in confidence; you are less uncertain and are a great advocate for the engineering perspective in Prod Syncs and other forums. \n- Continue your excellent follow-through and exceptional pairing, and keep being the confident representative/dev anchor.\n**Start:**\n- Start intentionally setting aside \"Collab Time\" to act as a sounding board for Luke, even for non-engineering ideas, and specifically help him with user research. \n- Seek out more opportunities for internal Rise8 community involvement, such as giving a Lightning talk or volunteering for EAT.\n- Continue to ask questions and get deep understanding of the domain as you grow into the Tech Lead role.\n\n**Jeremy Arzuaga:**\nContinue\n- Being the voice for engineering improvements and how SecRel can be re-used out of LH\n- being proactive when it comes driving stories to completion\n- Being vocal about your opinions as it's been really helpful in pivoting the product direction to help solve runtime monitoring\n- Teaching others and leading the team\nStart\n- have SecRel dogfood the process\n- look for opportunities outside of AppSec to improve security of LH\n\n\n\n\n\n\n\n\nDon't have anything for stop.  I look forward to seeing what else y'all can to over on LH.\n\n**Dylan Doub:**\nScott onboarded and learned the systems on this team incredibly quickly and grew into the anchor position naturally and should keep stepping up for any task and being willing to fail and learn from those failures like he has been. He's been a key component on the success of this team from the moment he started onboarding.\n\n**Branden Van Derbur:**\nStart:\n- Identifying ways to encourage participation from quieter/newer team members during domain meetings such as IPM or roadmap review. \nStop:\n- No notes\nKeep:\n- Being an absolute beast of an engineer\n- Being a 'ground' for the team with your calm, collected demeanor and approach to everything we do\n- Being kind and courageous at all times\n- Being a great mentor with a gentle approach \n- Bringing a great attitude to the team\n\n**John Zubiri:**\nKeep: Your attitude and personality, you are always calm and collected which is appreciated\nKeep: Your work ethic. Appreciate you being always ready to go and collaborative\nStart/Keep: Working on pro-dev and staying well-balanced. In our project's tech stack you don't want to get stuck being an expert at just these tools, we need to stay well-rounded\nKeep: Asking for feedback and being open to have those convos with the team, appreciate that you help others feel more comfortable too\n",
  "generation_timestamp": "2025-12-04 17:48:05"
}