{
  "employee_name": "Tiyyiba Zahid",
  "accomplishments": "**AFWERX Contract**\nAs part of the AFWERX engagement, I played a key role in guiding multiple application teams through the RMF process, translating complex DoD compliance requirements into clear, actionable steps tailored to their engineering workflows. Our team’s collaborative approach helped one application achieve an Interim Authorization to Test (IATT) before contract closeout, demonstrating measurable progress toward secure deployment. The AFWERX customer expressed strong appreciation for our partnership, emphasizing their desire to continue the engagement due to the value and clarity we brought to their authorization efforts. The customer was very happy with the work we did on the contract. \n\n\n\n\n**Advanced Professional Development** \nI invested significantly in my professional growth this year. I earned industry-recognized certifications including CISM and AWS Solutions Architect – Associate, and recently began studying for my Certified Kubernetes Administrator (CKA) certification. These credentials enhanced my ability to bridge technical depth with security governance, contributing to more credible and informed engagements with customers and engineering teams. I also attended a Women in Cybersecurity conference, gaining valuable insights, mentorship, and connections within the broader security community.\n\n\n\n\n**Team Engagement**\nBeyond project work, I contributed to Rise8’s culture by helping organize the company offsite, joining the swag team, and leading the Paint & Sip class and Unconference session. These efforts strengthened team connection, creativity, and alignment with Rise8’s values of collaboration, growth mindset, and fun, fostering the type of culture that fuels our mission-driven delivery.",
  "enps_comments": "**Bryce Nguonly:**\nBeing from the engineering side, I admittedly dont get as much natural interaction to the compliance/cyber side as I would like to. Its something that I wish our team tapped into more, cross functional activities/learnings with the infosec analyst. \nDespite not having much daily interaction, its very comforting to know that the ATO portion of Bifrost is in good hands and that you are actively keeping up to date with those discussions, documentation, and onboarding materials.\n\n**Chris Johns:**\nTiyyiba is an essential member of the team, serving as a primary executor for the critical security and compliance track alongside Kenny Slater. Her focus is on translating complex compliance frameworks into actionable, repeatable documentation and processes for application teams to onboard efficiently. Tiyyiba takes ownership of creating the foundational documents necessary for the project's Authority to Operate (ATO) and application onboarding. She is leading the effort to create a straightforward SSP document template for applications to onboard.\n\n**Clark Pain:**\nTiyyiba has been a fantastic resource for the team and I have thoroughly enjoyed working with her. She brings an awesome attitude to everything she does and is always looking for ways to support the team. I would absolutely love to work with her again.\n\n**Dan Sanker:**\nTiyyiba has been a true force multiplier for our team. Her impact is clear and significant. Coming from another program, she has brought a deep understanding of the company landscape and a powerful network of relationships.\nShe consistently knows who to talk to across the organization to get things done, which is an invaluable skill that accelerates our entire team's progress.\n\n**Delaney Coveno:**\nTiyyiba has jumped in and provided great support on the ATO journey. She worked closely with Surefire on security requirements and got that done quickly. When asked, she is always willing to talk about her work.\n\n**Erica Chang:**\nTiyyiba initially joined the team as surge support, and we've been very lucky to have her, where now it would be very difficult for the team if she left. She has been instrumental in creating documentation needed for our ATO package, pulling together the application team SSP template and getting it filled out by the Surefire team in an incredibly short amount of time. She also created a Trello board for security onboarding, which she's been able to share with other teams outside of Bifrost for RMF context. She's been very proactive since joining the team, and has been someone we can lean on for compliance expertise.\n\n**Jeremy Viray:**\nTiyyiba brings a cool, calm, and collected energy that clearly reflects the depth of her expertise. I don’t think there’s been a single security question she hasn’t been able to answer, and she delivers those answers with clarity, confidence, and patience. Her presence brings a sense of stability and reassurance to the team, especially when we’re navigating complex or high-pressure areas.\n\n**Kenny Slater:**\nTiyyiba is an amazing addition to the team. It was one of those situations where you didn't know what you were missing until you got it. I was surprised to learn Tiyyiba was not a Senior in her position. She operates as a Senior and in my opinion deserves to be promoted.\n\n**Samuel McQueen:**\nTiyyiba is a top performer, her attitude and commitment to the programs she has been on as well as her willingness to contribute within the company is second to none. She has been consistent throughout her time with Rise8.\n",
  "start_stop_keep": "**Bryce Nguonly:**\nIts valuable when you do speak up during engineering heavy discussions. I think that your opinion holds a lot of weight because of your insight on whats required from an engineering perspective. \nIt would also be cool to get share outs of what have been researching/working on. Just like how theres engineering share outs, if you learn/document anything worth noting, you should schedule a small share out after standup. I think it would really help the team keep up to speed on all facets of Bifrost.\n\n**Chris Johns:**\nKeep Doing:\n- Keep owning and finalizing core compliance artifacts for the platform and applications.\n- Keep driving application onboarding efforts and engaging with application teams.\nStart Doing:\n- Start dedicating time to technical investigation and validation of compliance tooling.\n- Start transforming static documents into automated processes using GitLab capabilities.\nStop Doing:\n- Stop manually drafting documentation content for repeatable requirements\n\n**Clark Pain:**\nKeep bringing your positive attitude to everything you do. Keep staying flexible and creative with how you tackle the problems that are thrown at you. Keep finding ways to support the team! For next year, I'd love to see you find opportunities to lead your section both internally and externally. You have lots of experience and skills and I'd love to see them put on display.\n\n**Dan Sanker:**\nStart:\nI would strongly encourage you to start proactively inserting your voice and opinions into our team meetings. Your insights on our work and your knowledge of the organization are critical, but I fear that I and others sometimes talk over you because you tend to wait for a clear opening. Please start claiming that space in the conversation, even if it means interrupting—your perspective is too valuable to miss.\nStop:\nStop waiting for that 'perfectly defined opening' to join a conversation. We need your voice and your ideas in real-time, so I'd love for you to stop hesitating and just jump in.\nKeep:\nKeep being that force multiplier. Absolutely keep leveraging your cross-team relationships and organizational knowledge. That skill is a unique and powerful asset that helps our whole team succeed.\n\n**Delaney Coveno:**\n- Start: Tiyyiba could more frequently share out her RMF work with the rest of the team. Frequent, brief sessions keeping the team in the loop would be helpful to keep us all on the same page.\n\n**Erica Chang:**\n- **Keep** expanding your cybersecurity expertise - the team will be leaning on you and Kenny more, especially with Graham's departure, so it's a great opportunity to increase your scope of impact. \n- **Keep** looking for ways to ease some of the eventual documentation building that's coming for accreditation. You're already doing this, and it will definitely help to have some of it off your plate when it's crunch time.\n\n**Jeremy Viray:**\nYour composure helps the team feel confident even in high pressure situations regarding security, I really appreciate that about you. I think your expertise could help shape early decisions before they solidify, reducing rework and improving alignment. I'd love to see you take more lead in some of these conversations\n\n**Kenny Slater:**\nStart: NA\nStop: NA\nKeep Going: Keep doing what you're doing. You are on a great track and a wealth of knowledge at your level. I have full confidence that you are on a career path that will move you through the ranks.\n\n**Samuel McQueen:**\nI would recommend Tiyyiba keep doing what she has been doing in all facets. She has done invested in herself with professional development over the year and would like to see her continue to do so.\n",
  "generation_timestamp": "2025-12-04 17:48:05"
}