{
  "employee_name": "Cara McLean",
  "accomplishments": "1. Rise8 website copy overhaul: contributed to new/revised webpages to better communicate who Rise8is , what we do, how, and for whom. Collaborated with SMEs across Rise8 to ensure accurate language for complex topics. Drafted new copy for Prodacity, We Ship Outcomes, and ShipSummit pages.\nImpact = by metrics that matter, TBD; but contributed to increasing Brand awareness/interest and our effort to increase clarity in our messaging/communication\n\n\n\n\n2. PR: collaborated with our partners at REQ for 6x bylines in targeted publications (5 Bryon/2 Carlo), 4x podcast interviews (3 Bryon/1 Mike G (post-production)), 5x press releases, and 1x award (Inc. 5000).\nImpact = by metrics that matter, TBD; but contributed to Pillar One, increasing visibility to targeted audiences to showcase how Rise8 helps gov agencies modernize and elevated Bryon/Carlo as thought leaders in the space\n\n\n\n\n3. Reviewed/revised/edited marketing assets including, but not limited to, Case Studies, Prodacity Blogs/Emails, Landing Page Ad Copy, SWF 2.0 White Paper, Mission O/S scripts, and Solution Video scripts for consistency, clarity, adherence to Brand tone/style.\n     Impact = by metrics that matter, TBD; but contributed to increasing Brand      \n     awareness, assets for Growth/Sales enablement, and outcome-based \n     storytelling",
  "enps_comments": "**Rachel Del Vecchio:**\nCara is the steady rock of the marketing team 💪 her context and perspective is invaluable!\n\n**Marc Fishman:**\nCara remains a keystone on the marketing team. For someone who hold part-time hours, her presence is always felt full-time. She is a clear and caring communicator. Her work is completed, and shared on time, and always on brand. She is able to shape our communications to hold a specific ill-defined tone that simply *is* the brand. Far beyond the reaches of any AI-output, she's been integral in tapping into the GovTech language to ensure that the copy we use (in ads, posts, website copy, et al) feels *of the brand*. In today's age, so often co-opted by other tools... she brings a human touch that is necessary for our continued success.\n\n**Vanessa Ten-Kate:**\nCara should keep bringing her calm, steady presence to the team. She consistently works well under pressure and maintains a level-headed approach that helps ground the rest of us. Her reliability, attention to detail, and willingness to jump in wherever needed make her an invaluable teammate. She also does a great job self-managing while keeping others informed, which creates strong alignment across the team. \n\n\n\n\nI’d encourage Cara to hold her boundaries when needed to respect her 20-hour schedule, so she’s not feeling the need to respond off-hours or while on vacation. Her dedication is clear, and protecting her time will help her stay energized and sustainable in the long run.\n\n**Sal Aziz:**\nCara consistently demonstrates strong organizational skills, attention to detail, and a proactive approach to managing key marketing assets and vendor relationships. She shows excellent brand stewardship by negotiating with external partners for co-branding opportunities and cost-effectiveness on purchased assets. Furthermore, she is a valuable contributor to internal content development, providing detailed, strategic suggested revisions for documents like the \"OSIT 1-pager DRAFT\" to ensure messaging is clear and accurate. Her prompt follow-up on press opportunities and proactive identification of additional requirements for submissions (like the USCG Marketplace Solution Brief) demonstrate a high level of responsibility and execution.\n\n**McKinnon Pearse:**\nYes, I would enthusiastically rehire her. Although I haven’t worked with her extensively yet, she has consistently demonstrated reliability, quick follow-through, and a strong commitment to producing great work. She is a great team player with a calm, steady demeanor and a clear desire to keep improving. Her responsiveness and positive attitude make her an asset to the team.\n\n**Jordan Dilworth:**\nWhen looking at our values, learn the fastest jumps out.  Experimentation, growth-mindset and fast-paced.  These are the biggest opportunities for Cara as in the grand scheme of things, she is still very, very early in her marketing career and experience.  Confidence and Conviction build over years.  She tried extremely hard, she means well, she's a great teammate and influence on the group - and that matters.  Production and impact and results also matter and there are still development opportunities to tie outputs to impact.\n",
  "start_stop_keep": "**Rachel Del Vecchio:**\nStart: Giving more feedback on the copy that comes your way. Sometimes it's not just a copy-editing need but an evaluation of the message itself. Is it communicating the right thing overall? \n\n\n\n\nStop: I got nothin! \n\n\n\n\nKeep: Showing up with your positive, get ship done attitude!\n\n**Marc Fishman:**\nContinue to be a team player operating at top speed. \nContinue to make 20 hours a week feel like 50 with all you take on and complete.\nContinue to make new members feel welcome.\nStart sharing more of your GovTech insite with the newer members of the team, and sharing as much as possible in team meetings. The more we learn about the space, the better all our work will become.\n\n**Vanessa Ten-Kate:**\nCara should keep bringing her calm, steady presence to the team. She consistently works well under pressure and maintains a level-headed approach that helps ground the rest of us. Her reliability, attention to detail, and willingness to jump in wherever needed make her an invaluable teammate. She also does a great job self-managing while keeping others informed, which creates strong alignment across the team. \n\n\n\n\nI’d encourage Cara to hold her boundaries when needed to respect her 20-hour schedule, so she’s not feeling the need to respond off-hours or while on vacation. Her dedication is clear, and protecting her time will help her stay energized and sustainable in the long run.\n\n**Sal Aziz:**\nAs we grow, Cara is essential for ensuring that every piece of Marketing content meets our increasingly high standards for quality and performance.\n\n\n\n\n**✅ Keep Doing**\nThese are the core functions you should continue to execute and strengthen:\n- **Maintain the \"Big Picture\" View:** Continue to \"understand the big picture\" , ensuring individual tasks across content, programs, and social don't deviate from the overall strategy.\n- **Review for Customer-Centricity:** Keep filtering activations through the lens of the Ideal Customer. Your detailed review helps ensure that our content and creative execution are grounded in an \"empathetic understanding of the customer and market\".\n\n\n\n\n**🛑 Stop Doing**\nTo optimize efficiency and elevate the team's output, consider stopping or changing these practices:\n- **Stop Correcting Errors that Should be Caught Earlier:** Collaborate with content and program leads to establish a tighter QA process, ensuring basic copyediting and fact-checking are handled upstream. This allows you to conserve your valuable time for ensuring high-level brand and tone alignment in every activation.\n- **Streamline the Sign-Off Process:** Drive organizational efficiency by automating and streamlining the sign-off process for smaller content pieces. Dedicate your energy to implementing a clear rhythm and cadence that leverages tools for compliance, freeing up time to focus on strategic, high-impact activations.\n\n\n\n\n**🚀 Start**\nThese new activities will support the strategic objectives of accountability and efficiency in 2026:\n- **Start Co-Defining Brand Guidelines for \"Revenue First\":** Partner with the team to define and document the brand and tone standards specifically for how we talk about **revenue impact** and our \"Revenue First\" mindset. This ensures consistency when elevating the conversation from busy-work to impact.\n- **Start Documenting Brand Standards in Shared Tools:** To support the objective of co-designing a more efficient system, start documenting key brand standards, messaging nuances, and tone guidelines within the team's content management or project tools. This scales your expertise and prevents the need for constant, manual intervention.\n\n**McKinnon Pearse:**\n**Keep:**\n- Executing quickly and reliably, which makes collaboration smooth and efficient.\n- Maintaining her calm, positive demeanor, which helps create a supportive team environment.\n\n**Jordan Dilworth:**\nStart really getting into AI editing and GPT building to leverage the tools to improve quality, and move faster.\nStart believing and trusting in your work so the CEO doesn't have to review immaterial changes so he can focus on the big changes - if he needs to review it again at all!\nKeep being open with shifting roles and jumping into whatever needs to be done with a great attitude.  The only constant is change, and you're always willing to support our various project needs.\nStop - and this is a hard one - completely rewriting articles or paragraphs that result in minimal change to the impact.  This is the biggest time killer IMO and oftentimes entire articles or paragraphs are rewritten and the net positive gain is not worth the effort.  Change for impact, or change for accuracy.\n",
  "generation_timestamp": "2025-12-04 17:48:00"
}