{
  "employee_name": "McKinnon Pearse",
  "accomplishments": "**1. Supporting and elevating the CEO’s LinkedIn presence**\n- I began drafting posts and shaping content for our CEO’s LinkedIn early on, helping strengthen his voice and visibility.\n- **Impact:** Refined and enhanced his thought leadership presence and market credibility, supporting his role as an SME and increasing his follower count by 5% since October.\n\n\n\n\n**2. Quickly adapting to a new strategic marketing environment**\n- I ramped up rapidly in an unfamiliar environment—learning our priorities, audience, GTM strategy, and competitive landscape.\n- **Impact:** Allowed me to contribute sooner to social strategy, content planning, and messaging aligned with Rise8’s mission and growth goals.\n\n\n\n\n**3. Building relationships and taking ownership of key deliverables**\n- I built strong cross-functional relationships and contributed early to key initiatives, including planning for the Weapon Systems Software Summit and creating CEO enablement materials.\n- **Impact:** Improved team alignment and supported high-priority marketing needs, helping amplify Rise8’s brand and mission execution.",
  "enps_comments": "**Rachel Del Vecchio:**\nStill new to working together but I am so happy you're on the marketing team! It's great having a reliable person on the team to hand things to and you've been crushing it.\n\n**Vanessa Ten-Kate:**\nSince McKinnon joined the team just last month, I haven’t had enough time or exposure to meaningfully observe her across these categories. This isn’t a reflection of any concern; in fact, the early signals I’ve seen from her have been positive across the board. It’s just too soon to offer fair or accurate assessments, and I want to ensure any feedback I provide is grounded in real observations rather than assumptions.\n\n**Marc Fishman:**\nFar as I can say: McKinnon was brought in because she was such a strong candidate from the get-go. As such, she's still very new to the team, so I personally can't say I've seen specifically great project work from her yet. But that's literally due to the fact that she and I have not yet really worked together specifically on any project. \n\n\n\n\nSo, from my vantage point: McKinnon is still the amazing hire we made, and I am looking forward to working with her on projects in the coming year so I can see that prowess in person.\n\n**Cara McLean:**\nMy ratings for questions 1 - 11 reflect the limited interaction I've had with McKinnon based on her recently joining the team. Please consider them in that light. For example, I believe McKinnon is passionate about our mission, but I haven't had the opportunity to observe her work through tasks or projects that required perseverance. I also believe McKinnon has the integrity to do right by the customer, company, and team. I'm looking forward to working with her as we continue to set course for 2026 and beyond and having her perspective based on her experience with DoD/gov.\n\n**Sal Aziz:**\nMcKinnon is a highly capable organizer and consistently demonstrates strong logistical management skills, particularly in the areas of event planning and vendor coordination. Her communication is proactive and detailed, which is evident in her effectiveness at managing last-minute event schedule changes and successfully coordinating large external vendor orders. She handles all necessary documentation and is adept at negotiating shipment timelines, which contributes significantly to smooth execution. Furthermore, McKinnon proactively seeks opportunities for process enhancement; a key example is her initiative to introduce the Value Stream Mapping process to the Marketing and Delivery teams, demonstrating a commitment to improving overall team efficiency.\n",
  "start_stop_keep": "**Rachel Del Vecchio:**\nStart: Speaking up in meetings! You bring a unique perspective. Let's hear it! \n\n\n\n\nStop: I got nothin! \n\n\n\n\nKeep: Asking questions! It's necessary for context and I'm glad you bring them up.\n\n**Vanessa Ten-Kate:**\nIt feels too early for me to offer specific start/stop/keep recommendations. What I can say is that her early engagement and attitude have been great, and I’m looking forward to seeing her grow into her role as she has more time and opportunities to contribute. For now, I’d simply encourage her to keep leaning in, asking questions, and getting comfortable in the team and our workflows. As she settles in, clearer patterns will emerge—and I’m confident they’ll be strong ones.\n\n**Marc Fishman:**\nThe best I can say for now is be the McKinnon we saw in the interviews that landed you with the team: confident, creative, and passionate. Bring your best ideas to the table, and never be afraid to contribute in meetings. I've seen every team member in marketing declare a strong thought or opinion only to eat crow a minute later... and it's genuinely led to some great breakthroughs, and lessons learned.\n\n\n\n\nStop second-guessing yourself if you're holding back. The notion being our team is \"flat\". Everyone's voice matters. Everyone's background has value to our mission. So, speak up and speak out. The more ingredients in the pot, the tastier the stew!\n\n**Cara McLean:**\nStart: boldly take ownership of our social media knowing you have the support of a full team to collaborate with on content, graphics, and anything else you may require or have questions about. \n\n\n\n\nStop: based on the limited observation period, no recommendations at this time\n\n\n\n\nKeep Doing: based on the limited observation period, no recommendations at this time\n\n**Sal Aziz:**\nMcKinnon’s focus on social engagement and distribution will be the key to achieving a \"Revenue First\" mindset by driving high-quality engagement that will help Rise8 elevate to the next level.\n\n\n\n\n**✅ Keep Doing**\nThese are the areas where you're already excelling and which should be amplified in 2026:\n- **Maintain Focus on Distribution Strategy:** Continue to be the resident expert on distribution strategy for our core content. Your input on leveraging the work from the Brand & Content Manager and Product Marketing ensures the great narratives reach the right \"bureaucracy hackers\".\n- **Proactive Listening for Engaging Content:** Keep up your excellent habit of \"listening for how the themes and campaigns can be translated into engaging social content\". This proactive translation is what ensures our high-level strategy connects with the audience on a daily basis.\n- **Collaboration with Campaign Calendar Development:** Continue to be a key voice ensuring that the Tier 1, Tier 2, and Tier 3 activities mapped out in the campaign calendar have a clear social and distribution component from the start.\n\n\n\n\n**🛑 Stop Doing**\nTo improve efficiency and impact as we grow, consider stopping or limiting these activities:\n- **Stopping Manual, One-Off Social Requests:** If this is a current practice, work with the team to stop responding to one-off, reactive requests for social amplification that are *not* tied to the core messaging or a \"Big Rock\" campaign. This will free up time to focus on strategic distribution planning, which is higher impact.\n- **Limiting Content without Clear Revenue Metrics:** Stop investing significant time amplifying content that does not have a clear path or attribution metric contributing to the \"Revenue First\" mindset. Every activity should constantly ask: \"How does this activity contribute to the revenue goals?\".\n\n\n\n\n**🚀 Start**\nThese new activities will help align to the strategic objectives for 2026:\n- **Start Defining Social/Amplification OKRs:** Take the lead on proposing Key Results (KRs) that directly measure the impact of social/distribution efforts on the Marketing OKRs.\n- **Start Creating an \"Amplifier's Handbook\":** As the team evolves into a clearer, more accountable structure, start documenting the distribution and social content workflow. This will define the collaborative rhythm and reporting cadence making your process a documented best practice for the team.\n- **Start Advising on Turning \"One-Offs\" into Sustained Momentum:** Actively advise on the pre-work challenge: *How do we turn 1-off announcements into sustained campaigns?*. Your expertise is uniquely suited to creating an amplification schedule that maximizes a \"moment\" (like the FORGE press release or IDIQ email) and drives sustained momentum.\n",
  "generation_timestamp": "2025-12-04 17:48:03"
}