{
  "employee_name": "Rachel Del Vecchio",
  "accomplishments": "1. Supported a really kick-ass Prodacity, including its promotion, the onsite experience for sponsors and speakers, and the post event communications plan - including the follow up webinar and 9 email newsletter series.  This event is a pipeline driver for Rise8 and positions Rise8 as industry leaders. \n2. Stood up the ABM program, enabling growth to experiment with cold outreach with key decision makers at SDA and BMC3I in USSF. This included creating several case studies, building a USSF GPT, learning and using Clay to pull stakeholder information, supporting key meetings with General Purdy.  \n3. Events - Evaluated and leveraged events to support Rise8's growth and branding initiatives (including ABM), enabled teams to make their time onsite successful by providing smooth logistics support, clear objectives and talking points, and collateral.",
  "enps_comments": "**Clayton Spakes:**\nRachel is incredibly dependable and keeps our world organized in a way that makes everything else easier. She brings a ton of structure and clarity to the team, especially when things get chaotic, and I know I can count on her to keep communication tight across different efforts. She’s great at taking messy, ambiguous work and giving it shape. As we continue to tighten up ABM and our program rhythm, I’d love to see her lean a bit more into the day-to-day project management side—pushing timelines, closing loops, and driving momentum without waiting for everything to be perfectly aligned. She’s already a strong contributor, and with just a few tweaks, she’s set up to have an even bigger impact next year.\n\n**Cara McLean:**\nI genuinely enjoy working with Rachel. Her ideas for activations, campaigns, or solutions/opportunities are bold and creative. She is mission obsessed and has the courage to provide candid feedback when necessary to move objectives and goals forward. 100% A Player as evidenced by 11/11 Best in Grade ratings above.\n\n**Marc Fishman:**\nIt's hard to consider this team *without* Rachel on it. Her voice carries in every meeting. She brings her \"A\" game to every opportunity, and a pragmatic view of work that is necessary for success. Simply put, when Rachel is on a project: plans are made, actions are taken, work is reviewed, outputs are presented, and impacts are discussed (when and where applicable).\n\n**Jordan Dilworth:**\nRachel has stepped into a new role mid-year and has development opportunities.  She's been asked to lead programs which is a newer area of focus and the role isn't perfectly aligned with her background and experience.  While the above ratings may not meet her expectations of self, I would expect anyone in a new role that they haven't had before to largely be in a time of development for the first 12 - 18 months and want this to be viewed as normal.  For my rating to shift to 'Agree' or 'Strongly Agree' on rehiring in this role specifically, the expectation would be that Rachel is a solid performer or team leader in all of the above categories, which would mean she is starting with the end in mind, working backwards to develop integrated programs that generate pipeline, reporting on campaign performance bi-weekly at a minimum and using the insights to adjust course and begin to create levers of 'if we do X, Y happens'.  She'd also be taking a more active role in agency accountability and quality to elevate their performance to meet our standards.\n\n**Carlo Viray:**\nRachel, having you on the team has been awesome, and I know Jordan is incredibly thankful for everything you’ve taken off his plate and everything you’ve been able to run on your own. One thing I’ve talked to Jordan about and also mentioned to my own team is that you’re running a lot of projects, and so much of your work depends on Growth getting you inputs, content, or decisions so you can move things forward. When we’re deep in proposals or juggling competing priorities, I can tell it leaves you feeling blocked or unsure of how to get what you need from us. You should always feel comfortable giving direct feedback to me and to the team when that happens.\n\n\n\n\nI also told Clayton and Shanna that they need to be better teammates to you and be quicker to give and seek feedback. At the same time, something that might really help all of us is having the marketing priorities fully visible, aligned, and easy for Growth to follow. We don’t live inside ClickUp the way your team does, so it’s easy for things to fall off our radar or just get lost in the shuffle. Growth absolutely can and should be a better partner to Marketing, and I want you to hold us accountable. Be direct with us — it helps us improve and it helps you get the support you need.\n\n**Riya Patel:**\nn/a - hit max cap\n\n**Sal Aziz:**\nRachel demonstrates a highly proactive and detail-oriented approach to both marketing operations and strategic coordination.\n\n\n\n\nShe exhibits strong ownership in managing complex vendor relationships and internal processes, as evidenced by her leadership in the multi-step inventory reset and SKU alignment with the logistics vendor to ensure the smooth rollout of the “We Ship Outcomes” employee order.\n\n\n\n\nFurthermore, she acts as a central coordinator for key strategic initiatives, including managing executive travel logistics for high-value customer events (SpacePower) and actively curating and sharing relevant strategic information, such as the GovExec Brand Health Snapshot and internal IDIQ campaign documentation, to keep the team informed for planning purposes.\n\n**Vanessa Ten-Kate:**\nRachel is an integral part of the team, and I’d love to see her keep doing what she already does so well. She is honest, direct and thoughtful in how she communicates and provides feedback; she builds strong relationships with both teammates and stakeholders; and she brings a strategic lens that helps us evaluate whether our work aligns with the bigger picture. Her willingness to offer support whenever someone asks is hugely appreciated and her organization and ability to self-manage make her incredibly reliable.\n\n\n\n\nThe team recognizes and appreciates her dedication, but she should feel comfortable protecting her own space when she’s off the clock and not feel the need to immediately respond to messages. Giving herself that buffer will make her work more sustainable and support her long-term success.\n\n**McKinnon Pearse:**\nYes, I would rehire her. She is exceptionally smart, confident in her role, and deeply knowledgeable about the business. Her ability to move quickly and drive clarity has a significant positive impact on the team’s momentum. Even in the short time I’ve worked with her, her expertise and leadership have been clear and valuable.\n\n**Kristin Pearson:**\nCan't sing Rachel's praises loudly enough!  It seems like there isn't an aspect of Marketing she doesn't directly touch/lead, and despite the huge workload that brings, she is always organized, proactive, and delightful to interact with.  Rachel has upped our account game in many ways, both by being a great partner and open to ideas/asks, as well as looking for opportunities and driving initiatives herself.  Fantastic, must retain teammate!!\n",
  "start_stop_keep": "**Cara McLean:**\nStart: no recommendations at this time\n\n\n\n\nStop: no recommendations at this time\n\n\n\n\nKeep Doing: continue to generate or identify bold, creative ideas; you have been critical to identifying and selecting some very valuable partners to create mission impact and I look forward to your collaborative leadership as we bring many of those functions in house while charting the path forward. Stay optimistic and gritty!\n\n**Marc Fishman:**\nKeep allowing the new team members to define *their lanes*, and give the work that once was yours to them to find success.\n\n\n\n\nStart drawing the line in the sand more where a \"Rachel Project\" exists vs. a \"Sal\", or \"Vanessa\" project. \n\n\n\n\nKeep being an amazing and supportive teammate. \n\n\n\n\nKeep striving for outcomes and impacts.\n\n**Jordan Dilworth:**\n- Keep\n- Learning the GovTech landscape and who the key players are, what they care about and trying to understand the customer and our market.  Rachel does this better than anyone on the team and is a valuable asset in conversations about roles, responsibilities and challenges.  Being the voluntary CL helped, and engagements like OSIT help.\n- Finding ways to make things better - the on-site patches are examples where you want do elevate the experience above v1.0 based on your knowledge and impact you'd like the experience to have.\n- Engaged with CS on customer marketing opportunities like awards.  This made a big impact with the relationship which is key to future contracts and something as simple as word of mouth and the perception of Rise8.\n- You do SO many things well and we're used to seeing you be thoughtful and intentional with your actions.  While the new role has elevated expectations and development opportunities, I'd like you to KEEP being intentional in your new areas of focus.\n- Start\n- Delegating more and allowing others to step up, whether it's me (Jordan) or pushing Marc and Cara to do more - they're capable and can handle it.  With McKinnon now as well, delegation - at the right time and trusting that others will do their jobs when they're empowered to do so will alleviate the mental load that comes with spinning 11 plates at the same time.  You carry 3 plates, not 11.  Hand the other plates off and let them carry them to the table to serve you the dish that they prepared - and if it sucks, send it back!  I know you weren't able to delegate as much to Christian and that bummed you out so you tend to stay involved in everything, which is exhausting.\n- Holding agency partners to a higher standard by pushing back on unsatisfactory quality deliverables like poor copywriting for emails, ad copy and more.  Set the standard for them, with clear deadlines and be the driver of Agencies like you were with the Growth Team on ABM at the start.\n- When building a campaign, start with clear objectives first, audience targeting, and RACI.  We Ship Outcomes is a good example of campaign planning to create the campaign that maps to the experience.\n- A simple experiment.  We did X and Y was the result.  Put the smallest program in market, fast, to learn.\n- Believing that Speed and Quality is achievable. The most recent example is the rebranding of Academy to ShipSummit and that doing so would delay things by a week... but we did it in a few days!  As we split roles more and let people own certain pieces, we can move very fast.\n- I'd like to perform a time study.  I'm not 100% sure, but starting to be more mindful of your time and where it is going may open up some opportunities. I recently uploaded my calendar into GPT and the output was really interesting to see where I spend my time and provide immediate opportunities.  Anecdotally, I bet we'd find opportunities (as most do) to have your time more spent on creation and outcomes vs. consumption.\nStop\n- carrying the burden of other people's roles/jobs. With a larger team, Rachel has to let things go and as Bryon puts it 'let certain fires burn'.  Relinquishing PR unless it's explicitly customer awards, relinquishing content creation (case study project management at this point) and managing the relationship with Jen Nieto are few examples.  The burden of trying to do everything to make sure everything gets done is high, and it's created a short-term lack of focus, which we knew it would as the team moves through the storming phase of figuring things out.\n\n**Carlo Viray:**\n**Start:**\nPlease give feedback directly to me and the Growth team when you feel stuck, blocked, or like we’re not giving you what you need fast enough. At the same time, sharing Marketing priorities and timelines in a way we can all easily see and align on would help us balance those asks with the proposal engine. It makes it easier for us to know where we need to focus and what’s most important at any given time.\n\n\n\n\n**Stop:**\nMe, Clayton, and Shanna all feel the same way about the outbound ABM email approach. I think we need to revisit that whole strategy, especially the initial cold email to pitch sequence. Some of it might be the timing with the shutdown, but I really don’t think this type of outbound is going to be effective, and it could potentially create brand risks we don’t see right away. I’d love for us to take a fresh look at it together.\n\n\n\n\n**Keep:**\nKeep being awesome and genuinely so fun and easy to work with. I love your personality and energy — we literally danced the night away in Nashville at Prodacity with Jen, and I will forever take credit for getting you on the green tea shot wave. You have a lot on your plate, but everything you’re doing is important and is making a real impact on how we move forward as a company. As the Marketing team grows, both Jordan and I are going to depend on you to help bring new teammates into the Rise8 way of thinking and operating. We’re built different, and you help others understand that.\n\n**Riya Patel:**\nn/a - hit max cap\n\n**Sal Aziz:**\nRachel’s the bridge between our strategy and its execution into pipeline-generating campaigns. As we evolve, Rachel’s ability to drive a \"Revenue First\" mindset through actionable campaigns is critical to hitting our $54 million revenue goal in 2026.\n\n\n\n\n**✅ Keep Doing**\nThese are the areas where your current efforts are driving value and should be amplified:\n- **Championing Outbound, ABM, and Customer Marketing:** Continue to be the voice and expert for outbound channels and strategies like ABM, ensuring that campaign themes are translated into concrete, multi-channel plans.\n- **Focus on Generating Pipeline:** Keep your focus squarely on how campaigns generate pipeline. This directly supports the need for a \"Revenue First\" mindset for all marketing activities.\n- **Leading the Campaign Calendar Mapping:** Maintain your leadership role in mapping strategic themes to the H1 2026 \"Big Rock\" Thematic Campaigns. Your expertise ensures these \"Big Rocks\" become calendarized and actionable.\n\n\n\n\n**🛑 Stop Doing**\nTo maximize strategic focus, consider limiting or changing these practices:\n- **Stop Accepting Fuzzy Key Results (KRs):** Elevate campaign planning by ensuring all KRs directly connect to the finalized Marketing OKRs and prioritize Revenue results. This solidifies our commitment to being accountable to Revenue, not MQLs or SQLs.\n- **Stop Working in Measurement Silos:** Proactively engage the team to define our collaborative rhythm and reporting cadence for 2026. The goal is to maximize efficiency by automating data pulls, allowing the team to shift focus from “busy-work” (e.g. manual reporting) to high-impact activities.\n\n\n\n\n**🚀 Start**\nThese new activities will elevate your role and ensure the activation of the 2026 strategy is robust and measurable:\n- **Start Building “Revenue First” Metrics into Campaign Templates:** Proactively design the campaign calendar template to explicitly require the answer to: \"How does this activity contribute to the revenue goals?\". This embeds the \"Revenue First\" mindset into the execution process.\n- **Start Leading the RACI for H1 Initiatives:** Take the lead to clarify campaign ownership and roles. You should be integral in driving RACI to ensure clear roles & responsibilities for every \"Big Rock\" campaign.\n- **Start Co-Designing the Reporting Cadence:** Partner to define the new Collaborative Rhythm and Reporting Cadence. This is essential for moving past manual reporting and ensuring everyone looks at the same scoreboard.\n\n**Vanessa Ten-Kate:**\nRachel is an integral part of the team, and I’d love to see her keep doing what she already does so well. She is honest, direct and thoughtful in how she communicates and provides feedback; she builds strong relationships with both teammates and stakeholders; and she brings a strategic lens that helps us evaluate whether our work aligns with the bigger picture. Her willingness to offer support whenever someone asks is hugely appreciated and her organization and ability to self-manage make her incredibly reliable.\n\n\n\n\nThe team recognizes and appreciates her dedication, but she should feel comfortable protecting her own space when she’s off the clock and not feel the need to immediately respond to messages. Giving herself that buffer will make her work more sustainable and support her long-term success.\n\n**McKinnon Pearse:**\n**Start/Stop:**\n- I don’t have any major “start or stop” items at this stage. My time working with her has been brief, and most of what I’ve seen is tied to her high speed and strong competence, which are strengths.\n\n\n\n\n**Keep:**\n- Maintaining fast-paced, confident approach, which sets a strong standard and helps push projects forward.\n- Leveraging deep understanding of the business and marketing strategy, which is incredibly valuable for guiding priorities and shaping outcomes.\n- Demonstrating strong leadership within the team, especially in how she drives clarity, direction, and momentum.\n- Offering additional context when assigning work, especially as I’m still ramping up and learning the function. Even small amounts of background help me execute more effectively.\n- Continuing to share expertise proactively, as her depth of knowledge helps accelerate learning and improves team alignment.\n\n**Kristin Pearson:**\nTo Rachel's credit, because she's so talented in many ways and has a huge capacity for diverse workloads at once, she is covering SO MUCH.  I'm curious what this next year looks like as the Marketing team grows and hope that Rachel can offload some segments of her workload.  She's already embraced her ABM role and really knows our accounts well - I'm excited to see what further ideas and contributions look life if she has the time to focus and go even deeper.  Thank you for all your hard work!!!\n",
  "generation_timestamp": "2025-12-04 17:48:04"
}