{
  "employee_name": "Sal Aziz",
  "accomplishments": "1. Completed Discovery calls with PMM key stakeholders to understand challenges and now PMM will help address. Next steps will be to develop and socialize a PMM Charter\n2. Revamped OSIT one-pager for use by CFC (formerly SpOC) to internally promote OSIT and therefore Rise8. Sales tools like this will help the Marketing flywheel for USSF and beyond\n3. I've gained a foundational understanding of Rise8, the domain, competition, buying behaviors and customer journey. I definitely need to deepen that understanding but feel that I've established a solid base from which to build",
  "enps_comments": "**Cara McLean:**\nAlthough still relatively new to the team, Sal's contributions to discussions on current projects and strategy for the future have been impressive and impactful. Sal has done the work to build a solid foundation of understanding who Rise8 is, what we do, and how we seek to be seen across gov and industry. When necessary, he's tactfully disagreed and provided additional considerations based on his professional experience and the information he's gathered on Rise8 to date. He is already an asset to team and I look forward to seeing the impact he'll continue to make as one of our team members and as a Riser. Notably, Sal's on-boarding interview was well-prepared and thorough; I appreciate that included some education on Product Marketing up front to structure the conversation.\n\n**McKinnon Pearse:**\nBased on what I’ve observed so far, I believe Sal will be a strong leader—I would rehire him. He is intelligent, asks thoughtful questions, and brings a knowledgeable, outspoken perspective to discussions, which adds value to cross-functional conversations. While I haven't had the opportunity to see the full scope of his work, his engagement and curiosity suggest he’s building a solid foundation to make a meaningful difference in his role.\n\n**Vanessa Ten-Kate:**\nSince Sal is still very new to the team, I haven’t had enough time or interaction to genuinely observe him across the various competencies yet. Early impressions have been very positive—it’s just too soon to provide feedback that would be fair, accurate, and grounded in real examples rather than assumptions.\n\n**Rachel Del Vecchio:**\nYou're doing awesome!\n\n**Marc Fishman:**\nTo denote: it's been a bit too early to assess everything above. Sal has only been on the team for a few \"real\" weeks at the time of this review. That being said, he was hired for a reason, and it shows. While I wasn't a part of his interviewing, I can see whole-heartedly why he was brought to the team. \n\n\n\n\nI sincerely look forward to seeing his projects and contribution grow in the coming year.\n",
  "start_stop_keep": "**Cara McLean:**\nStart: as you overhaul services positioning and messaging or outcomes-based storytelling, please also consider it as an opportunity to educate the rest of the team so that we all continue to grow and improve\n\n\n\n\nStop: based on the limited observation period, no recommendations at this time\n\n\n\n\nKeep Doing: continue to research and explore new information and sharing it as applicable with team\n\n**McKinnon Pearse:**\n**Keep:**\n- Asking thoughtful and thought-provoking questions and sharing insightful commentary. \n- Sharing insights with the team for added valuable context \n- Contributing to positive team relationship \n\n\n\n\n**Stop/Start:**\n- Given my limited exposure so far, I don’t have any strong observations for changes at this point.\n\n**Vanessa Ten-Kate:**\nIt’s a bit early for me to offer specific start/stop/keep recommendations for Sal, given how recently he joined. What I can say is that his initial engagement and attitude have been strong, and I’m looking forward to seeing him settle into the team and contribute meaningfully.\n\n**Rachel Del Vecchio:**\nStart & Stop - I got nothin. Can't wait to incorporate your positioning and messaging changes next year. \n\n\n\n\nKeep: Asking the hard questions and identifying the gaps!\n\n**Marc Fishman:**\nKeep being unapologetic about sharing your \"hard takes\". \n\n\n\n\nKeep your pragmatism in tact; it helps us as a team to stay focused on the bigger mission(s) at hand.\n\n\n\n\nStart being proactive in helping to define what specifically \"is\" a Rise8 PRODUCT; as I personally am still not 100% certain on what they are (given that we are a service-based-company). \n\n\n\n\nKeep being a great teammate through and through.\n",
  "generation_timestamp": "2025-12-04 17:48:05"
}