{
  "employee_name": "Vanessa Ten-Kate",
  "accomplishments": "I feel like I’ve already been able to make a meaningful start. I’ve started to work on humanizing how we show up on social—both for Rise8 and for Bryon—because at the end of the day, there’s a real person on the other side of the screen. Helping the brand feel more approachable and real will help create a stronger sense of connection with our audience.\n\n\n\n\nI also did a social audit, competitor analysis, and researched the audience and market (which is still ongoing) so I can better understand where we stand and what opportunities we have. All of this is helping me shape a clearer, more intentional strategy for how we show up and grow our presence going forward.",
  "enps_comments": "**Jordan Dilworth:**\nBeing so new to the role, it is hard to observe some of the behaviors listed above.  Overall, early indications are positive and trending towards being a consistent A-Player.  A few highlights so far are jumping into the production and post-production of Mission O/S, running Bryon's social media with McKinnon and taking that over from Ryan Rotolo to better align with the Rise8 brand, and even a quick hitter blog turnaround for the Hegseth article or copy/tone docs for ShipSummit or learning the CMS with Sweven to get the case studies published.  Learn by doing is certainly a strength.  This is ahead of expectations based on time in role and provide reasons to get excited about your contributions in 2026.\n\n**Rachel Del Vecchio:**\nStill new to working together but am SO glad you're here!\n\n**Marc Fishman:**\nSimply put, Vanessa *feels* like a Riser through and through. She brings a pragmatic passion to her work that is infectious. While still very new in her role, I've observed her desire to take on projects work quickly, and to do so without being tepid. She communicates clearly, and has no qualms about sharing her opinion professionally. \n\n\n\n\nThere's not much more to say in that respect. She was hired recently, and I personally see why she was on a daily basis.\n\n**Cara McLean:**\nAlthough relatively new to the team, Vanessa has already had an immediate impact. Streamlining operations to elevate Bryon's brand, creating solid content that requires little revision or editing, and recommending bold actions (LI Livestream) to garner attention and visibility for Rise8, she reflects our core and pay-to-play values in every action and interaction. I'm excited to see where her vision for Brand and Content takes us in 2026 and beyond!\n\n**Sal Aziz:**\nVanessa demonstrates a strategic and proactive approach to content and brand alignment. She actively contributes to the refinement of key documents, as seen in her suggestions to structure content (such as on contract vehicles) and her quick action to add a clear Call to Action and relevant internal backlinks to the \"End of Acquisition\" blog post. She also shows strong organizational and leadership skills by initiating and coordinating key internal and external events, including the \"Practioners Academy / Practice Leads Talk\" and the \"LinkedIn Live: ShipSummit\". Her focus on a consistent brand narrative and cross-team alignment was a key theme in her discussions on the role of Product Marketing, demonstrating her strategic focus and commitment to the company's messaging.\n\n**McKinnon Pearse:**\nYes, I would enthusiastically rehire her. She brings a highly strategic and creative approach to her work, consistently delivering high-quality output at impressive speed. Despite joining two months ago, she operates with the confidence and insight of someone who has been with the company much longer. She contributes thoughtful ideas, elevates group conversations, and sets a high bar for quality. Her leadership in executing creative ideas— like our first LinkedIn Live and taking over strategic vision for Bryon's brand so early on (and doing it successfully!)—showcases her ability to take ownership of strategic initiatives, follow through, and drive results. She is a strong team player with a positive, collaborative style, and has already become an invaluable part of the team.\n",
  "start_stop_keep": "**Jordan Dilworth:**\nKeep: Keep being curious and observant of external campaigns or inspiration to find unique ways to elevate Rise8 in B2G marketing, and learning the process to get things done.  We can be faster, we can be better, and keep finding ways to make us better!\nStart: Further flexing your strategic -> executional side to simplify and bring cohesiveness, or at least understanding if it all can't fit together nicely, to the marketing team on what our Content and Community strategy and priorities are and how we'll grow the brand through content and community building efforts in 2026.\nStop: too soon to provide specific feedback\n\n**Rachel Del Vecchio:**\nStart & Stop: I got nothin - You're asking the right questions and onboarding beautifully! \n\n\n\n\nKeep: Sharing your unique perspective! Really enjoying having your voice in the room.\n\n**Marc Fishman:**\nStart presenting new ideas that stem from your experience, even if it comes from out of the GovTech sphere. I feel like the entirety of the team will approach ideas and back off from them just as quickly because it might 'challenge a norm' in the space. \n\n\n\n\nKeep sharing your opinion, and asking for what you need without fear.\n\n\n\n\nKeep working to define *your lane*, and proactively introduce new projects you want to see happen.\n\n\n\n\nKeep working to define the lines in the sand between Rise8 and the Bryon Kroger brand (and soon to include the 'Seven Falls' concept).\n\n\n\n\nKeep your positive attitude and good nature.\n\n**Cara McLean:**\nStart: my one recommendation here would be to identify what you can delegate to McKinnon, Cara, and Marc as we continue to align on processes, big rocks, etc. and start tasking accordingly\n\n\n\n\nStop: N/A\n\n\n\n\nKeep Doing: Everything you've been doing since Day 1! Glad to have you on the team!\n\n**Sal Aziz:**\nVanessa and the strength of our content will be integral to our inbound success and help Rise8 achieve the objective of expanding our brand awareness and position Rise8 as thought leaders in our space.\n\n\n\n\n**✅ Keep Doing**\nThese are the areas where current efforts are driving value and should be maintained:\n- **Owning the Narrative and Inbound Engine:** Continue to be the steward of the brand story and the core content engine. This ownership is essential for ensuring all marketing activities are aligned and authentic.\n- **Integrating Flagship Content (e.g., Mission O/S):** Keep pushing for the production of high-quality, differentiating content like the potential \"Mission O/S\" material. These efforts support the translation of high-level strategy into tangible value.\n- **Focus on Compelling and Authentic Content:** Continue to ensure that the content is both compelling and authentic, as this is what cuts through the noise and builds a powerful, market-leading narrative.\n\n\n\n\n**🛑 Stop Doing**\nTo better support the team's move to a \"Revenue First\", consider limiting or changing these practices:\n- **Stop Accepting Ambiguous Messaging:** As the team finalizes the Core Differentiating Message, push to stop creating content that is not clearly filtered through the lens of the Ideal Customer. Ambiguous stories will not help us own the single, most important idea in the minds of the customer.\n- **Stop Operating in a Measurement Silo:** As the team evolves, adopt new metrics that link directly to Revenue OKRs.\n\n\n\n\n**🚀 Start**\nThese new activities will maximize your impact in support of the 2026 strategic objectives:\n- **Start Co-Designing H1 Campaign Content with PMM:** Actively collaborate with Product Marketing to ensure messaging is grounded in real customer pain points and accurately reflects our service offerings. \n- **Start Mapping Content to Revenue First Metrics:** Work with Marketing Programs to define content KPIs that support the \"Revenue First\" mindset. This means establishing a system to consistently ask, \"How does this activity contribute to the revenue goals?\"\n\n**McKinnon Pearse:**\n**Start**\n- Continuing to share more of her strategic thinking upfront, as it helps guide the team and provides valuable clarity for newer team members.\n- Delegating where possible, since she takes on a lot and her high standards might benefit from spreading knowledge and ownership across the team.\n**Stop**\n- I don’t have any significant “stop” items at this time. From my perspective, her approach and contributions have been consistently strong, especially given how new she is.\n**Keep**\n- Delivering high-quality, creative work at speed, which sets a strong model for the team.\n- Maintaining her positive, collaborative attitude, which makes cross-functional work smooth and energizing.\n- Holding high standards for quality, which elevates the overall brand and the team’s output.\n",
  "generation_timestamp": "2025-12-04 17:48:06"
}