{
  "employee_name": "Alexandra Brierton",
  "accomplishments": "**1. Driving technical compliance and product clarity for Tracer + enabling FORGE portfolio alignment**\nI’ve strengthened Tracer’s technical foundation by driving alignment around OSCAL and CCI implementation, improving usability, and ensuring compliance with government standards. In FORGE, I enabled two A-player PMs and contributed to a service design model that has improved UX clarity across the cloud platform and pipeline. My feedback and influence also helped enable the leadership restructure that unlocked meaningful progress for the entire portfolio.\n**2. Building critical internal systems: Knowledge Hub + Helpdesk**\nI designed and launched the new Rise8 Knowledge Hub and implemented the unified Helpdesk system used across the company. The Helpdesk has already processed **1,128+ tickets** in 7 months, eliminating scattered, inconsistent processes and enabling cross-department collaboration at scale. This work strengthened company-wide alignment, onboarding, and operational efficiency as we scale—earning me the **Flywheel Award** for delivering continuous momentum.\n**3. Advancing toward a unified Employee Portal + leading design research for Dotwork implementation**\nThis year, I drove two major internal initiatives that lay the foundation for a scalable, connected employee experience:\n- **Internal Site → future Employee Portal:** I expanded the Internal Site to unify critical tools, Outcomes in Prod, navigation, and eventually Dotwork-powered data. I proposed a long-term Employee Portal vision to the CEO, who expressed interest and is working to add it to future overhead planning.\n- **Dotwork service design research:** I led the service design research for our Dotwork MVP, mapping how strategy flows into tasking across Rise8’s leadership rhythms. I coached a junior designer, partnered with PM, synthesized insights, and presented our findings to the entire leadership team. This work will drive the roadmap for automating and connecting leadership and delivery team workflows that today are manual, disparate, and high-friction.",
  "enps_comments": "**Dave Chapman:**\nThis product team thrives because of Alex—she is our absolute MVP. Her design intuition is unmatched, particularly her vision for complex interactions which she brings to life with incredible speed and attention to detail. Alex also makes me better; she provides motivational feedback that keeps me positive, honest, inspired, and taking action. She is indispensable.\n\n**Mary Pollin:**\nI would enthusiastically rehire Alexandra without hesitation. She is a top performer who consistently demonstrates the qualities of an A Player. Her ability to consistently deliver high-quality work, coupled with her deep understanding of the Tracer product strategy and vision, makes her an incredible asset. Specifically, she is highly effective at asking the right questions that drive clarity and ensures the team is aligned with the overall strategy and vision for Tracer. Alexandra was key to the pivot focusing Tracer on eMASS interoperability. She demonstrated exceptional resilience and a dedication to the mission by quickly beginning new designs, even after significant prior effort was invested in the previous direction. This shows she prioritizes the mission outcome over personal effort or attachment to prior work. Finally, she is known for working very hard and reliably delivering quality work as a practitioner.\n\n**Michael Silverman:**\nAlex is an exceptional designer and a key partner to the engineering team. She successfully navigates a high-ambiguity environment, designing for a vast, complex domain with an evolving user base. She collaborates seamlessly with Product and Engineering to translate heavy requirements into intuitive UX. Her deep research into RMF nuances—including OSCAL, SDE, CCIs, and assessor workflows—has been critical. She isn't just making screens; she is translating the complex language of compliance into a product that empowers our customers to conquer the RMF process.\n\n**Alden Davidson:**\nAlex is an outstanding designer and teammate. She works hard to understand our domain deeply and to extract as much value as possible from our stakeholders and subject matter experts in order to validate and explore Tracer's ideas and features. She works closely with our PM to ensure the overall product strategy is strong and well-vectored, and isn't afraid to speak up when she has concerns about something. Alex is a true company leader in so many areas, always creating incredible impact in company-wide initiatives, and I've seen exemplary growth in balancing her time spent on those efforts against Tracer's needs. Alex helps foster a collaborative, high-trust environment in the team and is a great teammate to work with.\n\n**Justin Reynolds:**\nAlex is the absolute goat. She performs at an incredibly consistent level. She actively listens, proactively seeks feedback, and has completely invested herself in the Tracer domain. She influences at a commensurate level with product without overstepping.\n\n\n\n\nShe's the epitome of Rise8 values and an A-player that the company got lucky finding so early in our life cycle. She is beyond ready for increased responsibility and influence.\n\n\n\n\nThe offsite swag is a perfect example of her character: she went out of her way to ensure all of it maintained design excellence. Nobody asked her to, and she went incredibly overlooked for her effort. It shows she just cares beyond herself, regardless of the street cred on the table.\n\n\n\n\nNote: putting haven't observed for outcomes since Tracer doesn't yet have the capacity to achieve them.\n\n**Paul Nieto:**\nI would enthusiastically rehire Alex because of her excellent command of the domain and her ability to integrate deeply with the team to drive design direction. She works closely with Dave to understand expectations and make informed design decisions, while also understanding and researching the domain, working with key people and teams. Alex also steps up when the team needs her. While Dave was on parental leave, Alex did a great job empowering our interim product manager, Mary, helping her get caught up on the domain so she could lead effectively. Alex is also highly skilled at design and proactive in seeking feedback and responding to questions. Recently the team was discussing Organization Defined Parameters (ODPs) and as the team debated potential changes, Alex was very receptive and skillfully adjusted the designs on the fly in Figma so we could immediately visualize the options. Alex has shown to be flexible and skillful, her designs change and respond as our we define our design direction more and more. Alex proactively shares domain findings with the team, has great experience, and collaborates very effectively; she is a key asset to this team.\n\n**Michael Maye:**\n**Without question — yes.**\nI would enthusiastically rehire Alex every time. Over the past year, we worked extremely closely on the internal website, and she consistently demonstrated exceptional ownership, user-centered thinking, and deep commitment to delivering outcomes that genuinely improve the user experience and actually solve problems. \n\n\n\n\nShe approaches problems with both creative insight and structured rigor, and she never hesitates to pair during planning, investigation, or refinement. Every sync is productive because she shows up fully—curious, collaborative, and focused on aligning on the “why” as much as the “what.”\n\n\n\n\nBeyond her design excellence, she is a cultural leader. She supports teammates with kindness, patience, and clarity, and she consistently elevates the quality of the work and the people around her. She pushes herself to continuously improve while actively improving processes, communication, and delivery. She’s the rare kind of teammate who multiplies the effectiveness of everyone she works with. An A-player through and through — I would rehire her in a heartbeat.\n\n**Nick Mendiola:**\nAlexandra has been amazing to work with. The way she is able to see and understand things at a higher level, both in scope and impact, is such an inspiration to my own work. I have already learned so much from her and look forward working with her in the future.\n\n**Drew McFarland:**\nAlexandra is the ideal teammate. She is always open to pair and talk through complex, messy problems. She also shows incredible passion for her work. To me, she's the model for Bias for Action. She sees a problem, finds chances to get involved, and makes sure the problem is solved.\n",
  "start_stop_keep": "**Dave Chapman:**\n**Keep Doing:**\n- **Championing evidence-based innovation:** You have a unique ability to identify original design solutions or market research paths that no one else is seeing. I value how you deeply research these concepts and lobby for them with evidence until the team sees the value. Keep fighting for these ideas.\n- **Cross-functional alignment within the Forge portfolio:** Your proactive scheduling with other designers is critical. Keep ensuring we understand how overlapping compliance and security needs across the portfolio must influence the Tracer experience.\n- **Being \"Allergic to Delay\":** You are incredibly action-oriented. If we need an answer or a second opinion, you immediately say, \"Let's talk to them right now.\" Please keep lifting the team up with this urgency and holding us accountable to move fast.\n**Start Doing:**\n- **Expand User Research into the Forge Cyber Community:** Next year, I’d like to see you wear your \"Researcher Hat\" more aggressively with the Forge program cyber stakeholders. Since the cyber team lacks a PM or Designer, there is a vacuum here that you can fill.\n- **Be the Voice of the User for FORGE (USSF) Cyber Practitioners:** Even though key stakeholders (like the ISSM) are busy, I’d like you to start bringing proposals for how we can observe lower-level practitioners to understand their \"day in the life.\" We need you to generate the artifacts and insights that the cyber team isn't producing themselves.\n**Stop Doing:**\n- **Waiting for full clarity before visualizing:** While you time your designs perfectly 90% of the time, there are moments where you wait for the development team to be \"ready\" before you start designing.\n- **Hesitating to prototype in ambiguity:**  Again, most of the time this is not what you do.  Stop waiting for the lower-level feature direction to be set before you produce high-level wireframes at the concept level. Start using early, low-fidelity prototypes to *help us* establish that direction based on user problems you believe we can solve for. Use your design skills to lead the technical definition rather than waiting for it to be handed to you.\n\n**Mary Pollin:**\nContinue to drive alignment through strategic questioning - her skill in asking the \"right questions\" ensures the team maintains focus on the desired mission/business impact. This keeps the entire team aligned and prevents wasted effort, a critical A Player behavior. Continue demonstrating resilience and mission-first attitude during pivots - Alexandra's commitment to rapidly adapting the design work during the eMASS pivot demonstrated she does the right thing for the customer and the company, prioritizing outcomes over outputs. Seek opportunities to formally coach and mentor junior Risers - given her deep understanding of product strategy and her ability to ask impactful questions, Alexandra is well-positioned to help other Risers become successful. She should translate her design and strategic intuition into structured mentorship or peer leadership opportunities to drive the growth of teammates.\n\n**Michael Silverman:**\nStart: Alex should start prioritizing direct user interviews above all else. I know access is difficult in our environment, but having real feedback is the single biggest lever we have to improve the product. I want to see her push harder to break down those barriers, moving us from 'guessing' to 'validating' so we can ensure our complex designs actually solve the user's problem.\n\n\n\n\nKeep: Alex should keep creating her thorough, implementation-ready designs. One of her greatest strengths is taking abstract, messy requirements and translating them into clean, understandable interfaces that the engineering team can pick up and build without friction. That translation layer is vital for our velocity.\n\n**Alden Davidson:**\n- Keep balancing your time on company initiatives with the needs of Tracer; it's obvious how much effort you've put into rebalancing how you manage your time across the various things you're involved with and Tracer, and you do such a good job now being totally involved with Tracer that I'm often a bit shocked when I find out you're involved with practically every company initiative still. Keep up the great work!\n- Start getting more comfortable with taking educated guesses in our product strategy; I know how hard you work to validate hypotheses our team has against information from stakeholders and users, but it isn't always a bad thing to take a leap and try something even if it goes belly up in the end. These can still provide valuable data, and often it's important to simply keep moving when we're in such an uncertain domain.\n\n**Justin Reynolds:**\nHonestly, there is no 'improvement' feedback on her current performance. She is operating at a level significantly beyond her current role. My only feedback is that she needs to be given the increased responsibility and influence she is already demonstrating she's ready for. This isn't shying from critical feedback, but I really have none for her at my current scope; I haven't seen a designer do it better.\n\n\n\n\nShe should keep sharing her lessons learned with the other designers and raising her level of influence within the company. She is incredibly inclusive and is always actively listening, and I think that it makes her team better.\n\n**Paul Nieto:**\nStart: Providing a bit more detail in some designs so that engineering doesn't have to come ask questions. This is extremely minor and rarely happens, but in those rare cases, having that extra detail upfront would be helpful. I recognize this is also on engineers or product to proactively ask for this during IPM.\n\n\n\n\nStop: There is nothing that comes to mind that Alex should stop doing; her work with the team has been great.\n\n\n\n\nKeep: Investigating domain and creating great designs that address our products' direction. Alex has done an amazing job at using her experience and skills this year and ought to continue doing so.\n\n**Nick Mendiola:**\nFor the next year, I would recommend that you...\n... **start** teaching more. I think of you as a leader in our practice and greatly value your perspective. Probably difficult with your super busy schedule, but I feel like everyone else in our practice can also benefit from your insights.\n... **keep** up all the amazing work you do on all your various projects! You're killing it!\n\n**Drew McFarland:**\n**START:** Giving more direct feedback to everyone you work with. You have great perspective on what's working and what's not, and we'd benefit from hearing it more openly from you!\n**STOP:** Holding back in meetings when you clearly have something valuable to add. It can sometimes feel like you're hesitant to share thoughts. Whatever voice in your head is telling you to wait or self-edit, ignore it.\n**CONTINUE:** Challenging all of us to see things from different angles. You balance that critical thinking with positive reinforcement in a way that makes feedback actually land. And honestly, your initiative is what every Riser should aspire to. You're the model of bias for action. You don't wait to be asked, you just jump in and make shit happen!\n",
  "generation_timestamp": "2025-12-04 17:12:00"
}