{
  "employee_name": "Anthony Zubia",
  "accomplishments": "1. **Accelerating Mission Outcomes via OSIT and Securing Contract Renewal at SpOC HQ**\nMy first accomplishment was accelerating mission value delivery by personally deploying the on-site build and successful launch of the OSIT MVP at SpOC Headquarters. This direct engagement with the client environment resulted in a highly valuable product that not only earned an internal mission award but also established the necessary trust and operational momentum to secure our contract renewal. This effort perfectly embodies Rise8’s mission by demonstrating rapid Continuous Delivery of Valuable Software that the customer clearly loves and needs.\n\n\n\n\n2. **Delivering Critical Operational Tracking Capability for 10 SOPS and 7 SWS**\nMy second key accomplishment was delivering critical operational visibility to two major squadrons. For 10 SOPS, I single-handedly developed and launched a specialized OSIT tracking page, providing the organization with its first-ever capability to monitor the status of their systems. I further leveraged this expertise by creating two additional data-tracking resources for 7 SWS to monitor crucial, previously untrackable data points of their systems. This work is a direct example of Rise8’s mission to deliver Valuable Software that significantly improves the user's operational effectiveness, ensuring they have the necessary tools to succeed, and further expanding the fidelity of OPSCAP/SYSCAP data collection for enterprise visibility and decision making purposes.\n\n\n\n\n3. **Designing and Implementing an Integrated Training Mode Feature for Operational Risk Reduction** \nMy third key accomplishment was designing and implementing the Training Mode feature, which is a significant step toward Rise8's goal to ensure 'fewer bad things happen because of bad software.' Previously, users relied on low-fidelity PowerPoint slides or paper printouts for training. By delivering this integrated mode, we now allow users to safely practice complex workflows within a realistic operational simulation. The overwhelmingly positive reception, highlighted by a 7 SWS trainer's approval, confirms that this feature significantly improves user proficiency and confidence, directly reducing the risk of costly operational errors in production.",
  "enps_comments": "**Sagar Akre:**\nI would enthusiastically rehire Anthony Zubia because he consistently demonstrates a willingness to do whatever it takes to make ship happen. He is always eager to learn, quick to adapt, and incredibly easy to work with across every part of the team. Anthony is an asset not only because of his design capability, but because he works equally well with clients, engineers, and delivery managers. \n\n\n\n\nHe helps drive work forward, builds strong relationships, and contributes positively to team dynamics. There is very little I would critique about Anthony; he consistently shows up, delivers, and makes the entire team better.\n\n**Abel A A Hernandez:**\nIt’s been a difficult and challenging time on this project. Very little “classic” designing to be done and despite the restrictions Zubes has made the best of the opportunity by becoming proficient in Warpcore workshop building and adjusting his role and skills accordingly.\n\n**Evan Mladinov:**\nAnthony Zubia is a pro-active designer and an absolute asset to have on your team. He does solid work and contributes key points to meetings that help us stay focused and on point for our mission. I think Anthony's engagement overall with the team and customers is solid. He helps the team balance user needs with mission impact when developing features. He keeps it real and isn't afraid to ask hard questions.\n\n**Mases Krikorian:**\nZubes perfectly embodies the ideal designer: honest, helpful, straightforward, and receptive to feedback. Despite operating within extremely limited frameworks, he consistently collaborates with engineers to explore all potential solutions, ultimately delivering the best and most efficient design flow.\n\n**Roshni Bhanderi:**\nZubes has been a pleasure to work with. He brings a positive, thoughtful presence to the team and consistently shows openness to feedback and iteration. He is receptive to design input from engineering and product partners, and adjusts his work without defensiveness. His collaborative nature, paired with his kindness and professionalism, helps create a respectful and inclusive working environment.\n",
  "start_stop_keep": "**Sagar Akre:**\n## **Start Doing**\n- Speaking up more and taking greater leadership and ownership in meetings, especially when he has strong opinions or valuable insights to add.\n- Leaning into product and strategy conversations to broaden his impact and grow his career beyond design and technical contributions.\n\n**Abel A A Hernandez:**\nI understand it's challenging when shifting priorities and having to learn new systems impact your ability to focus on pure Product Design work. However, **Start** being more proactive in understanding and aligning with the product and organizational strategy. I recommend you utilize this alignment to suggest and lead user research initiatives, pushing for more methods to get us in front of users (e.g., user interviews, usability testing, and insights synthesis). I believe the current heavy load of requirements and customer directives has inadvertently limited your focus on leading these critical, high-impact user experience activities, but the opportunities are there. Don't lose sight of them!\n\n**Evan Mladinov:**\nKeep doing - He understands the product well and he does great collaborating with the customers. He understands the user needs and leads efforts very well. I love how he sets up time with the customer to go over design decisions and creates engaging conversations with them to make sure the team understands operational needs.\n\n**Mases Krikorian:**\nStart: Seek Leadership Roles and Leverage Customer Interaction Skills\n\n\n\n\nYou should actively pursue leadership roles within the team and wider organization. Your natural aptitude for leadership is evident, particularly in your highly effective interactions with customers and your engaging product demonstrations. We encourage you to leverage these strengths—your exceptional communication and ability to articulate product value—to step into formal leadership positions and guide team strategy.\n\n\n\n\nStop: Being So Awesome\n\n\n\n\nKeep: Continue Delivering Exceptional Interfaces and Collaborative Solutions\n\n\n\n\nYou must continue helping the team design awesome interfaces and maintain your high level of collaborative effectiveness. Your ability to quickly find workable solutions, even in difficult circumstances, makes pairing with you an extremely enjoyable and productive experience. Your consistent talent for bridging design challenges with practical execution is a critical asset to the team's success.\n\n**Roshni Bhanderi:**\n**Keep**: Bringing a kind, collaborative presence to the team, and staying open to feedback. Zube's adaptability and willingness to work across disciplines makes him an effective teammate.\n**Stop**: Nothing to add. Zube's open and flexible design process is appreciated.\n",
  "generation_timestamp": "2025-12-04 17:12:00"
}