{
  "employee_name": "Darla McGraw",
  "accomplishments": "1. As the designer on the MOSS team, we achieved success by delivering nearly a third of the entire company’s 38 outcomes for the first half of the year. The measurable output of this single team was a significant contribution to Rise 8's mission success. This consistent delivery and cultural leadership were primary factors in the team earning the prestigious Dream Team Award at this year's company offsite, honoring us \"For Exemplifying What It Means to Rise Up!\" Furthermore, our team made Rise 8 history by successfully executing the first-ever prospect pairing with a Rise 8 software team in collaboration with Growth, establishing a crucial new model for future cross-organizational collaboration and learning. \n2. I partnered with a small team to conceptualize, plan, and execute an offsite event for both the Design and Project Management disciplines, demonstrating leadership in growing organizational capability. This initiative was strategically designed to foster collaboration, build culture, and deliver practical education. The offsite was deemed a significant success, directly contributing to our shared team culture and ensuring that participants gained actionable, relevant skills that they have since successfully incorporated into their daily projects\n3. I contributed critical initiative, in collaboration with two other Rise 8 designers, focused on organizational transformation and external influence. Our work moved beyond single-product scope to directly influence 3rd party design contractors and establish new standards within a highly restrictive mandatory system. We achieved significant early progress in setting a unified, high-quality design standard that will streamline delivery for the remainder of this contract. This effort required actively engaging with and persuading key decision-makers, resulting in measurable progress in shifting mindsets and opening the door for future systemic design investment and change across the broader organization.",
  "enps_comments": "**Ian Sperry:**\nI would enthusiastically rehire Darla because she's a fantastic, high-impact Senior Designer who immediately elevated our team's strategic focus, execution quality, and health. She's a relentlessly outcome-focused leader whose contributions actively made my job easier.\n\n\n\n\nDarla successfully navigated the difficult dynamics of designing within the complex Kahless system, showing the poise and organizational savvy needed to drive design decisions even when facing resistance to simple changes. This confirms her ability to handle L6-level ambiguity and complexity.\n\n\n\n\nShe immediately stepped into a leadership role by introducing high-leverage practices, such as engaging engineers in the outcome submission process and initiating the rotating retro host idea. These actions demonstrate her ability to coach others and lead initiatives across teams.\n\n\n\n\nHer great curiosity and strong organizational skills significantly improved the quality of outcome documentation and made life much easier for the developers through organized design handoffs.\n\n**Vin Foregard:**\nIn the short time I’ve worked with Darla, she’s consistently stood out as a high impact contributor and a strong example of what it means to be a senior designer and A Player. She communicates with clarity, surfaces risks early, and brings focus to discussions. Her stakeholder alignment, design craft, and team oriented mindset make her a trusted, outcome driven riser. I’d gladly work with her again.\n\n**Nick Eissler:**\nI strongly agree that I would enthusiastically rehire this Riser for their role on my team.  Darla joined our team at an unusual phase, with a lot of stop-gap work and a design group from Kahless that isn't always user-centric or decisive.  Despite this, she immediately brought clarity and value by asking great user-focused questions and pushing conversations toward real outcomes in conversations with the design team.  Her ability to work effectively with the Kahless design team, advocate for users, and even help guide their decision process has made a huge difference.  She has also made an effort to further include engineers in outcome planning, ensuring design, product, and engineering are aligned early and working together as a true balanced team.  She’s been collaborative, thoughtful, and outcome-driven from day one.\n\n**Cason Brinson:**\nWhile I haven't had much direct collaboration with Darla, she provides valuable insight and design experience that would definitely lead me to rehire her. Darla is transparent with teammates and stakeholders, and is able to ask the tough—or even obvious—questions that allow us to make decisions and move fast. She demonstrates Rise8 ideals and is clearly passionate about the mission. Even though I mostly observe her in team meetings and workshops, her value to the team is evident in the way she moves quickly and takes ownership of everything she does.\n\n**Peter Duong:**\nDarla made significant and immediate contributions to the team's processes and quality as soon as she joined.\n\n\n\n\nShe quickly integrated herself by seeking out current team preferences and proactively suggested targeted improvements where processes felt disorganized or inefficient.\n\n\n\n\nHer direct experience with production outcomes (gained from her time on the Prod Patrol) has been invaluable. She has directly helped the team significantly improve our quality and reliability metrics in production.\n\n\n\n\nDarla excels at fostering a healthy and inclusive team communication environment. She provides clear, direct feedback to teammates and is never afraid to voice her opinions or raise potential concerns, contributing to high-quality discussions. She is highly skilled at noticing when teammates are quiet and actively gives them the floor, creating opportunities for less vocal individuals to contribute their insights.\n\n\n\n\nDarla actively represents Rise8's core values, helping to instill a culture of moving fast, experimenting, and prioritizing continuous feedback. She acts as a mentor for customers and other vendors, demonstrating and encouraging a bias for action and learning quickly, rather than waiting for lengthy approval chains.\n",
  "start_stop_keep": "**Ian Sperry:**\nKeep driving strategic process improvements across the cross-functional team, such as her work on the outcome submission and retros. She must also maintain her high level of organizational excellence and clarity in her handoffs, especially as the team embarks on the new project. She should continue to demonstrate poise while navigating organizational complexity—that is the key to her strategic impact.\n\n\n\n\nStart planning and coordinating research share outs to the rest of the team as we embark on the discover work for Protected Band Workup.\n\n\n\n\nThere is nothing Darla should stop doing at this time. She is operating as an exceptional Senior Designer and should continue applying her organizational, design, and coaching skills.\n\n**Vin Foregard:**\n**Start:**\nKeep deepening collaboration with engineers. You already engage proactively with stakeholders, and extending that same energy into the development side can strengthen team alignment and delivery.\n\n\n\n\n**Stop:**\nNothing specific stands out. Your direct and focused communication style is a strength. \n\n\n\n\n**Continue:**\nKeep focusing on outcomes and asking thoughtful questions. Your ability to raise important concerns, propose solutions, and advocate for the user makes a real difference. Continue bringing ideas that support both product direction and team morale.\n\n**Nick Eissler:**\n**Keep:**\nYour outcome focused approach and the way you anchor conversations in user needs.  You've been great at collaborating with devs and navigating the often unclear handoffs from the Kahless design system and advocating for outcomes during our stop-gap work.\n\n**Cason Brinson:**\nFor next year I recommend Darla to continue to ask questions and make decisions to that keep the team moving and agile. I also recommend she start giving feedback to other team members after workshops or other times we all work together.\n\n**Peter Duong:**\nKeep that facilitator hat going; you are great at keeping discussions efficient and making sure everyone is voicing their opinions.\n\n\n\n\nWe haven't had real opportunities yet since we are not assigned to our next project within EM&C, but I'm curious to see your strategic focus applied to our user discovery efforts through the use of AI. It would be great for user discovery to be summarized, tagged, and organized in a searchable manner that enables any team member (Product, Design, or Engineering) to easily find the information they need without digging through extensive original notes.\n",
  "generation_timestamp": "2025-12-04 17:26:37"
}