{
  "employee_name": "Drew McFarland",
  "accomplishments": "**Driving early alignment for key FORGE decisions**\nWhen the portfolio was spinning without a clear customer or path to outcomes, I stepped up to lead stakeholder conversations with government stakeholders (I was really comfortable navigating these conversations). I became an expert on the current Forge deployment process, mapped where friction existed, and worked with our gov stakeholders that to identify Nova as our pathfinder. This work gave the portfolio direction based on real user pain points, and we're now onboarding Nova and working toward actual outcomes.\n\n\n\n\n**Designed and aligned the portfolio on Forge's complete tenant experience from first contact through first deployment.** \nI led the design work covering account creation, onboarding, environment provisioning, and deployment workflows, using service blueprints, journey maps, and friction logs as tools to facilitate alignment conversations across engineering, PM, and leadership. The result is a cohesive, well-thought-out tenant journey that the entire portfolio understands and is building toward. This experience is already yielding impact, as we're onboarding internal apps in under a week and actively using these workflows to onboard our first external tenant.\n\n\n\n\n**Contributions to Rise8 Culture and Design Practices**\nI paired with designers to teach them vibe coding and AI tools. I think theres a world where users get access to impactful UX improvements sooner because designers are able to use tools like Claude Code to commit design cleanups and front-end changes, and I'm really excited to keep helping Rise8 work toward that. Separately, I've been pairing with designers on platform design approaches, helping them see what impact design can have on these teams. I'm extremely passionate about the impact a designer can have on a platform team (I've seen it both on the platform side and on the tenant side) so I'm also eager to continue enabling folks on that front. On FORGE, I'm leading the company's first experiment with a centralized design agency model to sense and respond to tenant needs more effectively. We're documenting lessons learned so other projects can adapt this approach when it makes sense. I also served on Prod Patrol vetting outcomes, ensuring that the company is not only tracking outcomes, but communicating our impact in the most effective way possible.",
  "enps_comments": "**Pooja Jhaveri:**\nI would enthusiastically rehire Drew. He consistently demonstrates the hard work and resilience expected of a top performer. He is a highly effective designer and teammate who is not only proactive but embodies the principle of ‘do what works’ by rapidly prototyping, iterating, and failing fast to generate value. His ability to communicate well with stakeholders and customers puts people at ease and makes him a vital Riser for maintaining healthy customer relationships. He is a high-impact contributor and A Player aligned with our mission. It's a pleasure working with Drew!\n\n**Jesse Wilkins:**\nI would rehire Drew for his role on our team. I really enjoy collaborating with Drew and find that I am learning a lot from him. He brings a deep understanding of design thinking and is always advocating for the user and ensuring that we are solving real problems for real users that drive mission outcomes.\n\n**David Alvarado:**\nAndrew has been great to work with.  I think exemplary team player that expresses his opinions honestly, is a cool and kind individual and produces great work.  The team is better with him in it.\n\n**Jacobi Ayala:**\nAndrew brings a positive demeanor and energy as well as clearly being an expert in his domain. He takes initiative on projects and tasks and delivers quality work. He collaborates and communicates very effectively. Would love to have him as a designer on any future projects.\n\n**Alexandra Brierton:**\nI would enthusiastically rehire Drew. He has had one of the most impressive re-entries into Rise8 that I’ve seen—he hit the ground running within his first couple of weeks and immediately became a driving force in the FORGE portfolio. His ability to conduct meaningful discovery, connect with users and stakeholders, and translate complex domain insights into actionable direction has been invaluable. Drew consistently shows a strong bias for action, filling gaps without waiting to be asked—whether that’s leading research, vibe-coding full apps, or demoing work confidently to high-level stakeholders. He is also incredibly collaborative, kind, and easy to work with. He leads distributed design efforts across the portfolio, prepares clear goals for every workshop, and elevates the quality of both research and strategy conversations. I always feel like I can depend on him, and I consistently learn from his approach. Drew is a huge asset to Rise8 and embodies our values on a daily basis.\n",
  "start_stop_keep": "**Pooja Jhaveri:**\nPlease keep demonstrating your initiative to explore possibilities and different avenues for team success, keep voicing your concerns & opinions, and being a fun & easy-going team member. Your courage to communicate feedback/frustrations/challenges directly while putting people at ease is a perfect example of ‘Always Be Kind’ and ‘Keep it Real’ in practice. To make an even bigger impact, I recommend you start making a more concerted effort to share context from your wider involvements at Rise8 (e.g., Prod Patrol, Tracer, FORGE Design) to ensure the team benefits from your broader visibility across the company. Additionally, I’d like to see you start pairing more frequently with engineers (when it makes sense to) during prototyping and other design activities, as this will facilitate technical input and accelerate the dissemination of knowledge and context throughout the team, fostering stronger team health and growth.\n\n**Jesse Wilkins:**\n- Start: bringing more structure to conversations and defining what we want to accomplish during any given meeting.\n- Stop: taking on more than you can handle, it's great that you want to do all the things, but not great to burn out and unable to give your all to everything you signed up for.\n- Keep: taking our work up a notch, always taking action and advocating for the best user experience.\n\n**David Alvarado:**\nKeep doing what you're doing, it has been great working with you\n\n**Jacobi Ayala:**\nStart working closely with engineers when designing mocks to see if there can be overlap in tooling to allow them to easily run with it. I only say this because previous mocks were html files in google drive and it was hard to see what was changed and extract it into a repo that follows best practice. To be fair, I did not communicate this to him, so this is a bit nit picky on my part and could have been addressed easily with a short conversation.\n\n\n\n\nI don't not have any stop recommendations.\n\n\n\n\nKeep up the energy and initiative. It is much appreciated and motivating.\n\n**Alexandra Brierton:**\n**Start:**\nStart giving yourself even more credit for the level of influence you’ve built across the entire FORGE portfolio. You stepped in and quickly became a key leader in research, platform understanding, distributed design, and stakeholder alignment—and I’d love to see you continue embracing those strategic moments. You have sharp instincts about tenant onboarding, platform UX, and the broader ecosystem, and sharing those perspectives even more confidently with leads and teams will amplify your impact even further.\n\n\n\n\n**Stop:**\nStop letting the excitement of new ideas pull your attention away from getting some of your strongest experiments into the world. You’ve created incredibly valuable things (like the platform learning simulation tool) and even a very lightweight MVP version would make a huge difference for the company. You already know this about yourself, but defining a clear “minimum releasable” version for your side projects will help you close the loop, ship, and learn in prod. Your ideas are too good to not be used!\n\n\n\n\n**Keep:**\nKeep being the fast-moving, thoughtful, and deeply collaborative designer and strategist that you are. Your facilitation skills are some of the best I have seen, and your ability to set clear goals, manage time, guide discussion, and ensure workshops deliver exactly what they are meant to is exceptional. Keep showing up with the same bias for action and cross-portfolio ownership you have demonstrated since your first weeks on FORGE, consistently stepping into whatever gaps need to be filled. Your contributions to Prod Patrol also speak volumes about how much you care about Rise8’s mission and outcomes. And your work on the internal site homepage was another great example, where you took high-level design concepts and vibe-coded them into a functioning experience with impressive speed and care.\n",
  "generation_timestamp": "2025-12-04 17:26:50"
}