{
  "employee_name": "Erica Chang",
  "accomplishments": "1. Contributed to Help Desk/Knowledge Hub and Improved Onboarding for Rise8 \nI completed user interviews of new Risers and their onboarding experiences, generated insights and suggestions for improvements for the Onboarding team to prioritize. I helped with the implementation of the knowledge hub canvases by parsing a backlog of FAQs scraped from Slack to display company policies and FAQs, and with the new helpdesk work flows. This was an effort to make it all around easier for Risers to find information that's generally publicly available, and easing some administrative burden on leadership.\n\n\n\n\n2. Expand sphere of influence in the S31 portfolio as a design leader \nI facilitated workshops for another S31 team (Starfox) to help them get their team norming practices in place, as well as create a service blueprint as the team didn't have a designer, in order to help them understand the working of the app. I was also contacted by other designers in the portfolio to go over ways of working with Warp Core/Foundry. I facilitated Damon's onboarding onto the team - with his feedback being \"The pairing and rapport-building with you and Abbie was really valuable - exactly what I needed to get into the groove. I definitely take ownership of my own onboarding process, and honestly you did a great job facilitating it. The organic approach worked well for me as I'm backfilling and finding my rhythm with Abbie\"\n\n\n\n\n3. Develop and share learnings in service design - \nAs mentioned above I've been working on technical knowledge documentation. I created and shared with the Bifrost team a user journey map and service blueprint, 2 artifacts that not everyone has interacted with before. On team Malibu, the engineers had not seen a service blueprint before, and the one I created helped us all figure out how we want to move the Vue app over to Warp Core. I also joined a This is Service Design Thinking book club session and shared how I've applied some of the book's methods to my current project.",
  "enps_comments": "**Kenny Slater:**\nErica's role on the team is unique. Being that it's unique, she contributes and helps her teammates outside of her mission requirements. She is constantly assisting with ATO matters, traveling to meet the ISSMs, and does face to face with the customer. Erica is a great teammate.\n\n**Tiyyiba Zahid:**\nI would enthusiastically rehire Erica because she consistently shows initiative, curiosity, and a genuine desire to learn. She’s stepped in to support others when needed and has taken the time to deepen her understanding of RMF and compliance processes. Her positive attitude, adaptability, and growing expertise make her a strong asset to the team and a great teammate to collaborate with.\n\n**Dan Sanker:**\nWhat has been most impressive about Erica is the immense value she has provided *despite* our team's heavy focus on platform and infrastructure, which has offered limited opportunities for traditional design work.\nEven without direct design requirements, she has been incredibly proactive. She consistently shows up, delivers valuable consultation to teammates, and works regularly with the Cyber team and our Product Manager. Her contribution has been critical in ensuring that our technical solutions are always viewed through the intended product and user lens, which is an invaluable service to the team.\n\n**Delaney Coveno:**\nErica is doing a good job helping product and infosec on a contract without a lot of traditional design work. I appreciate when Erica will jump into my breakout room to talk through recent architectural decisions, ATO strategies, or roadblocks. I would like to hear Erica's voice more often in team discussions.\n\n**Chris Johns:**\nErica Chang is an indispensable asset who excels at bridging complex strategic and compliance requirements with actionable product design and implementation planning. She consistently takes the initiative to clarify ambiguous political situations, define crucial user experiences, and facilitate effective planning for the engineering team.\n- Erica demonstrates a strong understanding of the high-level political constraints and actively contributes to communication and strategic planning related to the project's most critical challenge: the Authority to Operate (ATO).\n- Erica translates high-level customer and compliance needs into defined, usable artifacts for the engineering team, ensuring the product meets both functional and regulatory requirements.\n\n**Bryce Nguonly:**\nIt has been great having someone like yourself working on Bifrost since you know and have had previous contact with our client. Those small insights into their organization goes a long way.\n\n**Jeremy Viray:**\nErica has been an exceptional teammate, bringing not only her design expertise but also her background working with S31 apps and Warpcore, experience that has been truly invaluable to the team. She collaborates seamlessly with product and our security specialists, ensuring we cover all angles and proactively surface gaps we might otherwise miss. Her ability to bridge design, product, and security concerns strengthens the quality of our work and helps the entire team move with more confidence and alignment.\n\n**Steven Souto:**\nThis is difficult to write but I sincerely have not been in conversations where Erica is taking a large enough role in the conversation to fully understand her role and value-add to the team. It's difficult for me to know what Erica's priorities are as there is minimal description of the tasks she is delivering on in our backlog nor are the reports in standup offering enough context to see meaningful delivery.  I can fully understand that perhaps the Bifrost team simply is not offering the right opportunities for Erica to make valuable contribution.\n\n**Jennifer Van Hove:**\nErica has extremely valuable person to have on the Bifrost team, not just for her design skills, but all the other things she brings to the project: e.g., collaboration, knowledge sharing, and context.  She brought a wealth of knowledge about Surefire that was instrumental in onboarding them and driving the ATO conversations.  She dives into client communications by helping build decks.  She communicates across disciplines, bridging cyber security, engineering and product. She knows all the things and she helps keep everyone aligned, in addition to building design assets and advancing the overall product vision.\n",
  "start_stop_keep": "**Kenny Slater:**\nStart: Maybe communicate what her specific role does and ways that it could help the team. I don't know if the team has a great understanding of what the role provides. However, she assists greatly in the day-to-day operations of Bifrost.\nStop: NA\nKeep Doing: Keep helping and learning as much as you can. Keep taking the initiative to volunteer for tasks that help the team as a whole.\n\n**Tiyyiba Zahid:**\n**Keep:** Building on curiosity and proactive engagement, thoughtful questions, and readiness to help others strengthen team collaboration and knowledge sharing. Erica is a great team player to have and has been supportive to everyone on their projects.\n\n**Dan Sanker:**\nStart:\n- \"Start proactively defining the design foundation for our upcoming feature work. As we pivot from infrastructure, the team will desperately need the user personas, journey maps, and design principles that you are uniquely qualified to build. I'd love to see you start creating those assets *now*, so you can lead the product vision instead of just responding to it.\"\nStop:\n- I would encourage you to stop *waiting* for a 'design requirement' to get involved. Your proactive consultation with the PM and Cyber teams is already so valuable, so please continue to inject yourself into those conversations.\nKeep:\n- Keep acting as the user-centric conscience for the team. It's so important.\n- Keep showing up and staying engaged, even when the work isn't directly in your wheelhouse. Your resilience and proactiveness are noticed and valued.\n- Keep collaborating across teams (like Cyber and Product). It ensures we are all building in the same, intentional direction.\n\n**Delaney Coveno:**\n- Start: Speak up more in architectural discussions to make sure she has the understanding she needs to be effective. Her perspective and experience are valuable, and would help to get the whole team on the same page. Take the lead on more tasks.\n- Continue: Jumping in to breakout rooms to talk over the team strategy and architecture. Being willing to take on a wide range of challenges.\n\n**Chris Johns:**\nKeep Doing:\n- Keep driving strategic clarity by defining and visualizing complex workflows and user journeys.\n- Keep applying structure and rigor to architectural discussions and engineering processes.\nStart Doing:\n- Start translating architectural outputs into automated ticket generation and documentation.\n- Start actively driving the definition of the GitLab-based Service Desk workflow.\nStop Doing:\n- I can not think of any\n\n**Bryce Nguonly:**\nContinue: Keep comparing the release processes (bifrost and previous s31 apps) as you know it. I think that having your insight onto how previous apps such as surefire used to deploy and their process really helps us compare what we have, and what we need to do. It really puts into perspective where Bifrost is/is going. \n\n\n\n\nContinue: When our team has larger discussions, you are always one to reference back to our stakeholder meetings. Like if we have a question and get stuck, just move on and take note to ask our stakeholder. It really helps our team stay on track to what we really wanted answered, and not spiral into hypothetical what if's.\n\n**Jeremy Viray:**\nYour focus on user needs ensures we build solutions that genuinely make sense for our customers. Keep bringing that perspective into your cross-functional work with product and security, it’s incredibly valuable. As the team’s sole designer, your point of view carries a lot of weight, and I’d love to see you take an even more active role in shaping early direction. Your influence at that stage would have a meaningful, team-wide impact.\n\n**Steven Souto:**\nStart finding more opportunities to assist the team in ways adjacent to the skill of designer, such as: facilitation of value stream maps, revisiting of team documents for maintaining their quality, providing high fidelity visualizations of our security domain or proposed system architecture. Start engaging more in team discussion and look for opportunities to get spun up on complicated topics if you feel you might not have context.\n\n**Jennifer Van Hove:**\nStart: Driving the overall design process for the team.  This is hard/weird on a platform team, but for things like observability dashboards or other interfaces we control, don't wait for anyone to specify how that process is going to work.  Put your suggestions out there, pick up feedback as needed and move it forward.  If you're in charge, take charge :)\n\n\n\n\nContinue: Bringing your knowledge, sensibility and good ideas into every conversation.  You are always there with helpful information, relevant context, and solid next next steps.  You helped out a lot in areas that didn't have an obvious designer take, which makes you super valuable as a teammate well beyond your role.\n",
  "generation_timestamp": "2025-12-04 17:27:05"
}