{
  "employee_name": "Hannah Cheng",
  "accomplishments": "I moved beyond individual contribution to co-author the 12-month outcome roadmap for Satcom's Mission Workup. By establishing a clear vision backed by user data, I aligned the Nebula team and stakeholders on shared outcomes, directly influencing the long-term product strategy and ensuring we built the right things, not just more things.\n\n\n\n\nI designed and shipped critical validation safeguards that reduced planner review time by 50% and reduced request rework from 95% to 75%. This work directly solved the user's most painful friction points, proving that my designs result in measurable outcomes in production.\n\n\n\n\nI proactively mentored EM&C designers on atomic design and psychology within EM&C. I facilitated an internal design workshop on Accessibility within Rise8. This contributed to a stronger design culture and ensured we are meeting high standards for inclusivity and quality inside and outside of Rise8 organization.",
  "enps_comments": "**Roshni Patel:**\nHannah is such a joy to work with. She’s always on top of her game, consistently delivering thoughtful, high-quality designs that keep the team moving forward. I’m constantly impressed by how quickly she iterates—she takes feedback in stride and turns around updates with speed and clarity, ensuring we always have what we need to make progress. Her reliability, creativity, and responsiveness make an incredible difference for the team.\n\n**Minh Nguyen:**\nYour performance in product discovery and stakeholder engagement is top tier. You excel at ensuring our customers are truly heard, consistently framing questions in a polite yet highly effective manner that expertly guides them toward articulating their deepest needs. You are a genuine embodiment of **Keep It Real**: you never fail to voice your informed opinion and disagreement, but you do so politely and always with the customer's best interests central to the discussion. Furthermore, your comfortable and approachable demeanor has been vital in elevating the team's comfort level and fostering an open, honest collaboration environment.\n\n**Edwin Karaya:**\nI would enthusiastically rehire Hannah. She is an exceptional designer who brings clarity, structure, and professionalism to every part of the mission. She communicates effectively with both planners and stakeholders, rapidly translates user needs into high quality designs, and collaborates effortlessly with engineers and PMs. Her leadership in design conversations and her ability to simplify complex workflows make her invaluable to the team and the mission.\n\n**Riya Patel:**\nN/A\n",
  "start_stop_keep": "**Roshni Patel:**\n**Start:**\n- Start giving yourself space to explore bigger-picture ideas during discovery—your instincts are strong, and leaning into them even earlier could unlock even more elegant solutions.\n**Stop:**\n- Stop being so hard on yourself when timelines are tight. You always deliver excellent work, even under pressure, and the team deeply trusts your process.\n**Keep:**\n- Keep iterating quickly and proactively—your ability to turn feedback into polished updates so fast is a huge asset for the team.\n- Keep your incredibly organized and dependable workflow. It ensures we stay aligned and never lose momentum.\n- Keep bringing your calm, kind, and collaborative energy. It truly elevates the team and makes working together seamless and fun.\n\n**Minh Nguyen:**\n**Start**\nAs our company embodies AI, I wonder if we have had support for using Claude with Figma. If so, I think you should get a hang of it to boost your productivity and have more time influencing the Kahless Design Team :)\nAs we get to know our stakeholder and develop a better connection and trust, pushing back and voicing your disagreement when their vision doesn't align with what you have gathered from the users\n**Keep**\nVoicing your opinions within the team and sharing your family stories. I love to hear those and it helps foster the safe working environment for our team :)\nDoing a great job at user engagement meetings and synthesizing information for development work\nInfluencing the Kahless Design Team with your awesome expertise so we can deliver a better product and the best UX for our customers\n\n**Riya Patel:**\nHannah has gotten great feedback from our EM&C customers and I appreciate that isn't afraid to shy away from feedback or have the tough conversations! \n\n\n\n\nThe only area I think Hannah could strengthen is comfort in speaking to large crowds. It's clear she gets nervous and I think that unintentionally conveys a lack of confidence. I will caveat and say it's a fairly nerve wracking group to present to on EM&C - like 40 people who just stare at you and provide no feedback, so I think any normal person would find it a daunting experience!\n",
  "generation_timestamp": "2025-12-04 17:27:17"
}