{
  "employee_name": "Matt O'Donnell",
  "accomplishments": "I'm really happy with what Nina and I built together: creating transparency and a smoother process for helping our CDD contract partners navigate team security clearances. On G8way, I'm proud I could jump into a fast-moving team with minimal context and quickly deliver what was needed. And with the enablement initiative, I'm genuinely excited I got to listen deeply to my fellow practitioners, understand their real needs, and translate those into insights that can help both our people and our organization grow together.",
  "enps_comments": "**Tom Anastasio:**\nMatt is a highly **positive and enthusiastic** team member whose **curiosity** is contagious. He excels at sharing what he learns, generating excitement within the team. His placement in leading the **design enablement** effort was an excellent fit, leveraging these strengths effectively.\n\n\n\n\nMatt possesses strong instincts for using **research and evidence** to inform his decisions, which is a valuable asset. However, he sometimes over-optimizes for the *optimal* path, which can slow down progress. I recommend he temper this tendency slightly to maintain momentum.\n\n\n\n\nHe's a pleasure to work with, known for being a **good sport** and for asking **excellent, thoughtful questions**. He also provides good feedback when prompted and has the valuable ability to state the **uncomfortable truth** when necessary for the team's progress.\n\n**Brian Jennings:**\nMatt is a strong practitioner that brings a wealth of experience to teams. He is kind and cares about humans and maintaining strong relationships. He has a growth mindset and reaches out for feedback around how he can improve and be better at his job. He's helped bring energy to those that he works with and can jump into a challenging situation such at the G8way team and deliver in a tough setting.\n\n\n\n\n There are a couple of areas that would push me from Agree => Strongly Agree.\n1. Being more bold: I'd like to see Matt be more transparent with his work and share work and progress more widely to get feedback. I have seen a tendency for Matt to rely on the folks he's built close relationships with to get their feedback and I'd like to see Matt put his work out in the open to get feedback from folks that he hasn't built as close of relationships with. Right now, keeping things close is hiding the work and the progress he's making; from the outside, folks don't see the progress and can question performance.\n2. More proactivity: I'd like to see Matt be more proactive in a couple of areas: communication and putting in the effort to stay aligned with the direction Rise8 is heading. On the communications front, I observed a couple of instances where lack of proactive communication from Matt led to surprises or confusion. It's an area I'd focus on to make sure that you are reaching out to the necessary people early and making sure folks are on the same page (one example was around clearly communicating your availability around time off, another around a line of work Matt was owning that had ambiguity around it). On the aligned to Rise8 area, there were a couple of instances where I observed Matt wasn't tracking big Rise8 initiatives that were announced on Slack. In those scenarios, it can reflect poorly on Matt if peers notice he isn't tracking something that is a big company priority.\n\n**Jonathan Van Dalen:**\nI've not worked with Matt directly on a team, so my survey responses are mostly about my perception of his character, based on working with him on some Beach initiatives.\n\n**Sharon Hamilton:**\nIn the short time I had the opportunity to work with Matt, he impressed me with his ability to jump in, align himself with the mission and his team, and start making valuable contributions. His willingness to give feedback in a constructive manner is commendable. Matt works to create team cohesion and connectedness, even in tricky situations and his insights combined with his approach help to quickly move the team to producing outcomes that matter to the customer.\n\n**Jeff Rodanski:**\nKeep up the good work!\n\n**Jacobi Ayala:**\nI enjoyed working with Matt as a person and his design work was very good. Would gladly have him back on a future team.\n",
  "start_stop_keep": "**Tom Anastasio:**\n**Keep Doing:****Keep being the positive and curious presence,** your enthusiasm is a significant motivator.**Keep asking thoughtful questions** and stating uncomfortable truths when needed for the benefit of the project or team.**Keep leveraging your passion** and knowledge to lead the design enablement initiative.\n**Stop Doing:****Stop allowing the search for the absolute optimal path** to overly delay action. While your instinct for research is good, we need to transition to a mindset where a well-researched, educated guess is often sufficient to move forward and gain positive impact more quickly.\n**Start Doing:**\n- **Start demonstrating a stronger bias for action** in your decision-making, favoring forward momentum over prolonged optimization.\n- **Start aggressively and proactively seeking and providing feedback**. While you are already good at engaging in feedback discussions, making this a more frequent and ingrained part of your weekly routine will significantly accelerate both your personal growth and the team's developmental pace.\n\n**Brian Jennings:**\nStart: Taking initiative to grow in the areas you need to grow - I heard you mention on a few occasions how you wanted to get better with Claude, wanted to ramp up in OOUX. Being on the beach is a perfect time to do that, there is no better time to ramp up on those skills than not being on a project.\n\n\n\n\nStop: (More of a warning) Trust but verify what you get out of what you put into AI. While AI let's you build things quickly, a lot of the fine details can get lost and still needs a human to fine-tune them. Don't lose the details that matter in exchange for speed/ease.\n\n\n\n\nContinue: Continue to ask folks for feedback! Really appreciated how you asked for feedback after a meeting you hosted or when you ask how you can do things better. Keep doing that and everything else will fall into place!\n\n**Jonathan Van Dalen:**\nI do not have enough project context with Matt to make recommendations on start or stop.\n\n\n\n\nKeep: being kind and curious, learning new approaches and ideas\n\n**Sharon Hamilton:**\nStart: sharing more of your approach to team development with other Risers\nStop: \nContinue: bringing your positive attitude and skills to every engagement. Continue giving feedback and looking for ways to improve\n\n**Jeff Rodanski:**\nStart going faster on leveling yourself on Platform Design and AI Design process (and provide learnings back to the team)\nStop showing up like a L6 and start showing up like a L7 (if L7 is still your goal)\nKeep being curious, kind and helpful to all risers. You're facilitation skills are good but can be better. Keep offering to facilitate any and all things and get feedback to improve.\n\n**Jacobi Ayala:**\nI don't have an adequate start recommendation for Matt as it has been several months since we worked together.\nI don't have an adequate stop recommendation for Matt as it has been several months since we worked together.\n\n\n\n\nKeep cross collaborating with engineers. Matt was always mindful of what was feasible given constraints and maintainability and I feel that's a good balancing act for a designer to have.\n",
  "generation_timestamp": "2025-12-04 17:27:36"
}