{
  "employee_name": "Nick Mendiola",
  "accomplishments": "1. **Getting a supporting outcome for the USPTO cATO project**. While this achievement took longer than expected, I was really happy with the path I found to build up this outcome. Developing and executing a research plan that led to quantifiable results and speaks to the perseverance we had all the way up til the end of our time on the project.\n2. **Being a major part of the DotWork rollout**. I've been able to get some great user research experience and get to know our leadership team and their day-to-day processes. I also believe that this tool has the capability to solve some significant visibility issues for the company and am proud that I was chosen to help put it in the hands of my fellow risers.\n3. **Contributing in the planning of the PM/Designer Offsite**. This was a lot of fun to be a part of. I was part of the SWAG coordination effort, which included creating logo variations, selecting meaningful items, and offering any further assistance to the planning team. I would absolutely love to be a part of future events like this in the future.",
  "enps_comments": "**Alexandra Brierton:**\nI would rehire Nick. He is kind, respectful, steady, and willing to take direction, and those qualities make him easy and pleasant to work with. I have appreciated his reliability and follow-through on the tasks and research work I have given him, especially given the fast-moving nature of our current Dotwork effort. He asks clarifying questions when needed, listens well, and genuinely tries to produce the best work he can. I also appreciate that he handled the bulk of our leadership interviews after initial guidance, and that he has been taking more ownership as we transition into the Dotwork setup and KPI/VSM data work. I see a lot of potential in him, and I’m glad we were able to collaborate.\n\n**Jeff Rodanski:**\nSee Start/Stop/Keep comments below\n\n**Derek Dombek:**\nWorking with Nick all last year was truly a great experience, since we were both on a sub where each component of the team was more decoupled our scopes of work were mostly different. Nick is an absolute master when it comes to design and graphics work. He was extremely valued on our team for giving our team a pleasant upfront presence with customer value mapping, metrics tracking and our overall image. With all that being said Nick is an incredible person to others and I really do and will miss working with him!\n\n**Ashley Pearce:**\nNick is an absolute A Player 100% of the time. He is always willing to do what's necessary to get the mission done and he puts in maximal effort into even the smallest of tasks.\n",
  "start_stop_keep": "**Jeff Rodanski:**\nStart contributing more to the design community of practice. Be proactive about finding way to contribute. Love the bookclub.\nStop (I dont have feedback here)\nKeep upscaling yourself (and others). Go faster if you can!!\n\n**Derek Dombek:**\nStart: On our last contract Nick began working with the team on. Customer value mapping and everybody really started to gravitate to that and I would imagine they kept doing so after we left. I would say implement that everywhere end up. Not does it help you with domain knowledge on the customers needs but it always helps the team easily visualize those concepts as well.\n\n\n\n\nStop: I noticed Nick is super interested in learning and loves finding out about how new thing work which is great for his design work and the overall customer success. Avoiding silence and asking as many questions as possible goes so far!\n\n\n\n\nKeep: I'm pretty sure nick would never be the opposite of this but always keep being a great person! I feel thats really whats going to keep you doing successful things. You care deeply for whats right and you deserve nothing but the best.\n\n**Ashley Pearce:**\nKeep killing it at everything you do! I love your drive and passion for your work and that you're always willing to step up when someone needs something\n",
  "generation_timestamp": "2025-12-04 17:27:52"
}