{
  "employee_name": "Riya Patel",
  "accomplishments": "1. Transitioning in flight accounts from a part-time CL to myself: This has been a year in the making but probably one of the toughest experiences at Rise8 was taking on accounts in flight, which meant establishing a new kind of working relationship with delivery members who weren't used to having full time support or understood the value CS could bring to the table. It also meant building strong and effective relationships with customers who already had a POC within leadership or with the delivery teams and were hesitant to commit time to a new person and a role they are unfamiliar with. While I don't think JJ will ever stop texting Carlo ;), I am proud of how far I have come and Rise8 has come into turning CS into a highly valued function within the company and for our customers. I think this was a foundational year building trust and winning hearts/minds to really give CS the autonomy to guide account strategies with customers next year. \n2. In that vein, I am proud of piloting leadership alignment sessions with customers this year and building a muscle with customers on aligning business value and openly discussing whether Rise8 and the customer are on the same page about the value we bring. \n3. Account strategies and piloting account strategic discussions bringing together delivery teams, delivery leadership, and growth so we can have active conversations on renewal, expansion, and risks.",
  "enps_comments": "**Becca James:**\nRiya is an excellent teammate who I can trust to be competent in anything she does. I immensely value her on the CFC account, not just for what she does internally with Rise8, but for her built, strong relationships with stakeholders.\n\n**Alex Berner:**\nI was inclined to put \"Best in Grade\" for every answer, but then felt a little dramatic. But for real Riya is an absolute joy to work with in every way. She is remarkably sharp, communicative, organized, and driven to achieve results. I felt like from day 1 I could talk to her about anything, and her ability to pick up a complex domain full of wack interpersonal challenges so quickly has been extremely impressive. She has such a strong ability to balance grit and determination with respect and lightheartedness, making her not only the ideal CSM, but coworker in general.\n\n**Ian Sperry:**\nI would not just enthusiastically rehire Riya; I would fight to keep her. She is an absolutely critical, mission-enabling asset and we would be lost without her. Riya consistently operates far above the expectations of her role, serving as our team's political navigator, strategic shield, and primary driver for customer growth.\n\n\n\n\nRiya's deep expertise in DoD contracting and budgeting has been key to our success, most notably in navigating the political stakeholder dynamics with EM&C and playing a key role in the new contract signing. She established herself as a leader in helping us understand these critical functions.\n\n\n\n\nShe is the master of preventing problems. Her ability to spot a \"yellow flag\" before it turns red—like proactively securing PI9 work—is a massive strategic win. Furthermore, her strong advocacy for engineering needs, such as securing the dedicated Botany Bay namespace, directly benefits the speed and efficiency of all our engineering teams.\n\n\n\n\nShe ensures we are always aligned with the customer by meticulously organizing touch points and actively seeking feedback. Her commitment ensures we remain in good standing and maximizes our chances for long-term growth and renewal.\n\n**Kevan Mordan:**\nRiya is a foundational support of all her Rise8 accounts. Her communication and ability to get stakeholder and team alignment, even on core problems outside of her experience/domain, are commendable. Definite rehire and team enabler.\n\n**Rachel Del Vecchio:**\nRiya is a joy to work with!  Open & collaborative, asks questions, mission-focused, hell yeah 😎\n",
  "start_stop_keep": "**Becca James:**\nStart: Leaning into executing account growth strategy for CFC as we enter renewal season, own that strategy, and share with the team how they can support it.\nContinue: Somehow you know how to balance where you need to get into the details and where you should stay high-level. That's such a rare quality that I admire a lot! You're well balanced.\n\n**Alex Berner:**\nKeep riding that awesome balance of finding humor and ridiculousness in our stakeholder situations while respecting and mastering the ecosystem to achieve results with difficult people. Having somebody we can be real and commiserate with internally while also knowing they will harness and morph that into the utmost diplomacy externally is so huge for our team\n\n**Ian Sperry:**\nKeep leveraging her strategic foresight and deep customer relationships to maintain our excellent standing with EM&C. She should continue to identify and neutralize those \"yellow flag\" risks that could derail our program's progress. That is her superpower, and it is a critical component of our success\n\n\n\n\nStart shifting her focus to strategic expansion and influence. Riya should work closely with the Delivery Lead to formally develop a comprehensive strategy for Rise8 to gain more influence and grow our footprint within the EM&C program. This should include identifying key program gaps and developing proposals to fill them.\n\n\n\n\nThere is nothing Riya should stop doing at this time. She is already operating at a high level and effectively balancing delegation with direct contribution.\n\n**Kevan Mordan:**\nStart - Providing more proactive feedback about ICs, you may not have a SWE/Designer/PM/etc background but you can see problems across teams very well.\n\n\n\n\nKeep - Everything else, and hopefully the new Delivery Lead structure can provide a great balance\n\n**Rachel Del Vecchio:**\nStart: Collaborating with marketing more! Let's make awesome customer experiences! \n\n\n\n\nStop: got nothin!\n\n\n\n\nKeep: Looping me in on USSF intel - re-orgs/target accounts / stakeholders. It's so appreciated!\n",
  "generation_timestamp": "2025-12-04 17:48:04"
}