{
  "employee_name": "Sharon Hamilton",
  "accomplishments": "Managed stakeholder relationships across nine accounts and 11 teams, supporting delivery teams ability to focus on delivering outcomes and working to develop potential growth opportunities. \nSupported the TAK competition. Helped the team through a short, high-stakes engagement, navigating a new customer relationship and internal team development. \nGave a lightning talk on feedback which suggested different frameworks to help people feel comfortable in giving and receiving feedback.",
  "enps_comments": "**Riya Patel:**\nn/a - hit max cap\n\n**Art Tovar:**\nI would **enthusiastically rehire** Sharon for her role on my team. She embodies how an A-Player Customer Success Manager can fundamentally impact a team's ability to achieve its mission. \n\n\n\n\nSharon consistently takes the 50,000-foot view to anticipate customer needs and keep us aligned on the biggest outcomes. Her ability to navigate a challenging stakeholder environment, providing clear and actionable context, is invaluable. She helps the team **Do The Right Thing** by protecting us from noise and enabling us to successfully meet—and exceed—customer demands. She achieves this strategic impact while always demonstrating **Always Be Kind**, making working with her a source of strength and cohesion.\n\n**Brent Baumann:**\nSharon's professional conduct is a shining example of **Always be Kind**. She approaches every conversation with genuine kindness and positivity, maintaining her composure and effectiveness even under the most challenging circumstances. This makes her a highly trusted partner across the team. I always appreciated her willingness to jump on a call to discuss concerns or challenges; her consistent availability and dedication speak volumes about her commitment to colleagues and to our shared goal of achieving outcomes.\n\n\n\n\nShe is guided by the principle to **Do the Right Thing** in her commitment to customer service. Sharon takes a proactive, relationship-driven approach, frequently initiating outreach to stakeholders. This effort has cultivated strong, productive relationships that foster open dialogue and honest feedback. Her success in aligning program efforts to the specific needs of our stakeholders is a direct result of this focus. Her ability to **Keep it Real** through transparent communication is a significant benefit to overall program health.\n\n**Luke Strebel:**\nI think Sharon has done an awesome job in a pretty complex environment with a ton of moving parts. The most important thing is that everyone is where they need to be now, and I think a lot of that is due to her ability to work with different individuals at Rise8. She’s gotten shout-outs from all the VA PMs are recently as this week when Max asked if there was any help the VA teams needed, which shows the trust that we have in her. She has a ton of context on the problem and has to understand not just what Rise8 needs, but also what the VA needs, so she can provide value to both. My one concern is that she's not a naturally confrontational person (which is a good thing), but I want to make sure that she stands up for herself when she's between stakeholders, because she does really good work and makes the teams feel supported.\n\n\n\n\nThere have been times in the past where information did not seem to be reaching the teams at the same place, and some engineers moved to and from the team more than they should have without clear direction. I always prefer radical transparency over waiting until we know things are 100% true, and this has been a really positive improvement in the last couple of transitions—she's pulling me in earlier. I also really liked when she shared the artifact she put together for pitching VA resourcing; it was cool to see the proof in writing, and that's something she could demo more often.\n\n\n\n\nSharon is an amazing contributor and a **Team Leader - Top 5%**. She is a very **'Bold'** Riser with our values in mind, though her growth path is to be just as comfortable putting her foot down with external stakeholders. She is **'Best in Grade'** at **'Always Be Kind'**; she's an exceptionally kind individual who is always giving good feedback and sharing what she's hearing. She **'Does the Right Thing'** 100% of the time. She's also very good in an ambiguous environment (**'No Unnecessary Rules'**), doing what makes sense to get the job done. The main growth area is to focus more on **'Outcomes in Production'**—not just the soft, human resources angle, but also keeping an eye on how the team is performing output-wise. I would **'Strongly Agree'** to enthusiastically rehire Sharon for this role.\n\n**Marc Fishman:**\nI'll denote, I am not specifically on Sharon's team, so my assessment is strictly from what few observations and interactions I've had with her. As far as I'm considered? She is a stalwart team player who isn't afraid to ask for help when needed, and certainly has her druthers when considering what is needed to reach her goals.\n\n**Shanna Chen:**\nI really love working with Sharon. She’s extremely collaborative and an excellent communicator. She’s super fun to work with, and I really appreciate that I can give her feedback openly without it ever feeling awkward; she takes it constructively and professionally every time.\n",
  "start_stop_keep": "**Riya Patel:**\nn/a - hit max cap\n\n**Art Tovar:**\n**Start** actively communicating and building relationships with senior leadership at the VA beyond our direct stakeholder group. Leverage your current success in navigation and communication to influence our mission footprint for the better and identify new, high-impact opportunities for Rise8.\n\n\n\n\n**Keep doing** an amazing job helping us navigate our tricky stakeholder environment. Your ability to provide clear, actionable feedback allows the team to prioritize and execute effectively. Please continue to maintain radical candor—letting us know immediately if we need to change and, just as importantly, letting the stakeholder know how the team feels and what we need from them.\n\n\n\n\n**Stop:**  Carrying the mental load for all senior stakeholder conversations.  Try to leverage the team where possible.\n\n**Brent Baumann:**\nI strongly recommend Sharon continue leading the weekly status meetings with the team. This process is highly effective for relaying important information from our stakeholders and ensures the team remains aligned with shifting priorities. Her commitment to maintaining this cadence is crucial for operational transparency.\n\n\n\n\nI recognize that program transitions can be extremely difficult, and the last transition presented significant challenges due to frequently changing details that weren't always relayed promptly.\nWhile Sharon has demonstrated grit in navigating these changes, I recommend she focus on refining the process for disseminating time-sensitive updates during periods of high flux. Ensuring individuals receive requisite and timely updates, even when details are uncertain, will minimize confusion and maximize team effectiveness during turbulent transitions.\n\n**Luke Strebel:**\nFor next year, the path from \"amazing\" to \"Best in Grade\" is clear. Please **keep** being that kind, bold, and supportive leader for the teams. **Keep** leaning into that radical transparency and pulling me into resourcing conversations early; it's a huge improvement. **Start** demoing or sharing those artifacts that show how our product is doing; it's great to see that proof in writing. **Start** keeping an eye on team *outputs* as well as their health, as that's a key part of the puzzle. Finally, to get to that \"Best in Grade\" level, **start** building your own independent lines of feedback within the organizations you support, so you're not solely reliant on our time-constrained stakeholders.\n\n**Marc Fishman:**\nDefinitely continue to partner with Marketing to ensure Rise8 puts forth the best looking / useful information to our customers. \n\n\n\n\nPlease consider partnering even more with Marketing in order to ideate opportunities to \"surprise and delight\" our customers with useful information, and/or unexpected outcomes and impacts. Simply put: the more real-world impacts we can glean, the better the relationship with be between the customer and Rise8. And ideally these outcomes can be maneuvered with proper permission to become useful communications from the marketing team — including case studies, pull quotes, and Subject Matter Expert participating in future events.\n\n\n\n\nContinue to be kind, open-minded, and energetic with all Rise8 does daily to effect mission impact!\n\n**Shanna Chen:**\n**Start:**\n- Letting more of your personality shine through; your personality is really cool, and sharing it more openly can make your presence even more impactful\n**Stop:**\n- Being *too* nice sometimes; your kindness is a strength, but don’t be afraid to push back or assert your perspective when needed.\n**Keep:**\n- Being collaborative, supportive, and approachable, which helps teammates solve problems and grow.\n",
  "generation_timestamp": "2025-12-04 17:48:05"
}