{
  "employee_name": "Clayton Spakes",
  "accomplishments": "1. Expanded knowledge of Rise8 in IRS, which was a new agency. There is a lot of work that needs to be done to get things on contract, but brand recognition is stronger than before.\n2. Refined proposal process by implementing feedback from past opportunities. SPRUCE and others have been a constant learning opportunity and have completely changed the way we approach the proposal process. \n3. Helped the Growth department scale by leading the implementation of AI tools and helping enable other members of the team.",
  "enps_comments": "**Shanna Chen:**\nClayton is a friggin great teammate who always has my back. He keeps me accountable, helps me stay on track, and pushes me to grow. I really appreciate how he’s always willing to share advice, offer feedback, and support me when things get challenging; it makes working together easy and helps me do my best.\n\n**Rachel Del Vecchio:**\nClayton is the real deal. Mission-oriented with a growth mindset!\n\n**Rob Monroe:**\nI truly haven't had many opportunities to work with Clayton in 2025, so I don't believe it's appropriate for me to respond to questions 1-10. However, for the two activities I worked on with Clayton, I can confidently say I would like to work with him again (rehire). I didn't experience anything that would signal Clayton isn't an A-player at Rise8\n\n**Sagar Akre:**\nI would enthusiastically rehire Clayton Spakes because he has been one of the most hardworking, supportive, and enabling partners I have ever worked with. In his role supporting the Growth team, he consistently demonstrates respect for the time and capacity of those he collaborates with, especially when asking for part-time support. He goes out of his way to ensure he is not overburdening others and always brings clarity, context, and thoughtfulness to every request.\n\n\n\n\nClayton has also been a leader in helping other team members grow, including myself. His presence, communication style, and steady leadership make every interaction more productive and enjoyable. He is an extremely valuable member of the Growth team, and his work ethic and collaborative approach strengthen every initiative he touches.\n\n**Ron Golan:**\nIn an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year\n",
  "start_stop_keep": "**Shanna Chen:**\n**Start:** \n- Taking on more visible leadership opportunities within projects to expand influence and impact.\n**Stop:**\n- Doubting your own contributions; your input is consistently valuable and appreciated.\n- Overloading yourself with too many simultaneous tasks; focus on high-impact priorities.\n**Keep:**\n- Being a reliable, supportive teammate who elevates others and strengthens team collaboration.\n- Delivering high-quality work with attention to detail and consistency.\n- Providing thoughtful feedback and mentorship to help others grow.\n\n**Rachel Del Vecchio:**\nStart: Giving more feedback! Your opinion matters. Let's hear it! \n\n\n\n\nStop: Letting things bottle up. If there's a blocker, let's talk about it and collaborate on a solution. \n\n\n\n\nKeep: Showing up every day ready to make ship happen. Your can-do attitude and willingness to take things on is part of what makes you awesome!\n\n**Rob Monroe:**\n**Start**\n- Exploring forward looking, or futurespective, practices with new projects and teams to help proactively address risks\n**Stop**\n- None at this time\n**Continue**\n- Tuning and leveraging your continuous improvement practices\n\n**Sagar Akre:**\n## **Start Doing**\n- Being more direct with the support team about his perspective on the client and what to expect. Sharing opinions and context up front will help the team prepare more effectively for proposals, scoping sessions, and early conversations.\n\n**Ron Golan:**\nIn an effort to balance customer needs with completing a large number of reviews, I am prioritizing written feedback for the people I worked most closely with this year\n",
  "generation_timestamp": "2025-12-04 17:48:00"
}