{
  "employee_name": "Shanna Chen",
  "accomplishments": "1. **Initial TAK Award Efforts**\n*Impact:* Assisted with the groundwork for Rise8’s initial down select award by helping articulate solutions, coordinate inputs, and ensure alignment. Played a key role in drafting select portions of the white paper, bringing in SMEs to help bring end-user feedback that supported Rise8’s successful $280K award. \n2. **Supported VA SPRUCE Efforts**\n*Impact:* Contributed to the VA SPRUCE initiative by assisting with technical analysis & documentation. Coordinated several VA SPRUCE RTEP submissions by managing timelines, consolidating inputs from multiple teams, and ensuring compliance with submission requirements. This support improved the quality and consistency of our proposals, directly contributing to Rise8’s ability to secure funding and expand its impact within the VA ecosystem.\n3. **Expanding Contract Pipeline through Multiple Submissions**\n*Impact:* Supported the submission of six proposals to bid on contracts across the VA, Space Force, and Air Force. My coordination and contributions helped ensure high-quality, timely submissions, directly expanding Rise8’s business pipeline and creating opportunities for new mission work.",
  "enps_comments": "**Clayton Spakes:**\nShanna works incredibly hard and it shows. She show up with A Player intentions every day and you are always ready to take something on. She care about doing great work and you pour a lot of energy into everything you touch. Where I want to see you grow is in how you prioritize. Not everything is a fire and not everything deserves the same level of intensity. When she tries to treat everything as urgent, she burns a lot of energy without always creating the right impact. Slow down to move fast. Take a breath, sort the work, and put effort where it truly matters. She has everything she needs to be great.\n\n**Sharon Hamilton:**\nShanna is an excellent teammate to work with. Her ability and willingness to research the customer to fully understand the mission is impressive and has been very helpful in developing artifacts for growth opportunities. She is professional and relatable, focused on the right things, willing to go the extra mile and work the extra hours, and is always there to cheer the team on.\n\n**Ron Golan:**\nShanna is simply awesome. While I don't have a full time role on growth, from what I can tell whenever she gets a customer opportunity thrown at her, she will do whatever it takes to have it go well. Pulling in the right people, having side convos with her contacts, setting up meetings and pushing people to attend so that we're all prepared. I really feel like I can count on Shanna, which might be the highest compliment you can give a coworker. She's great. \n\n\n\n\nOne area of improvement, and the only place I put solid performer - I want to see her take more of a growth mindset to facilitation. I know thats not in her current skillset which is absolutely fine, but it is a great skill to have on the Rise8 growth team, with how we as a company do sales. The resources are there for her to learn and improve - and I'll be there for her to help her do so!\n\n**Sagar Akre:**\nI would enthusiastically rehire Shanna. In the time I’ve worked with her, she’s consistently shown empathy for the needs and concerns of the delivery teams while supporting the growth team through things like scoping. She’s taken real initiative in stepping into facilitation and has grown a ton in that area. Even though she’s mentioned before that it’s not her favorite thing, she’s still fully owned it and become a leader in that space.\n\n\n\n\nShe also maintains strong relationships with potential clients and regularly steps into work that isn’t technically in her job description, simply because it needs to get done. That level of ownership and growth mindset is exactly what Rise8 needs. Overall, she’s been crushing it.\n\n**Marc Fishman:**\nAs I am not on the same team as Shanna, I don't feel I have an ability to speak as to her specific performance in coordination to any specific team-goals she may be a part of. That being said: from the work of hers I have seen, and the projects I have partnered with her on, I see an exemplary Riser who is focused on the success of the company in support of our larger mission.\n\n\n\n\nWith that in mind, I would rehire her without question were my opinion to hold specific weight in that decision.\n\n**Rachel Del Vecchio:**\nShanna is a joy to work with!\n",
  "start_stop_keep": "**Clayton Spakes:**\n**Start:**\nStart stepping into more lead roles on calls and opportunities. You are ready, and the only way to grow your reach is to put yourself out front more often. Also start sharing your ideas earlier in conversations. You usually have good thoughts, and speaking up sooner helps everyone.\n**Stop**\nStop waiting for everything to be perfectly clear before moving. You know enough to take the first step, and trusting yourself will help you move faster and build confidence.\n**continue**\nKeep showing up with strong effort and solid follow through. Your reliability and hard work make a big difference for the team, and those strengths give you a great base to grow from.\n\n**Sharon Hamilton:**\nKeeping showing up the way you do! Keep thinking outside the box when it comes to ways to help give the company a leg up on a contract bid. I encourage you to start sharing your feedback more actively. You have a strong understanding of what needs to be accomplished and an excellent sense for identifying when something is not meeting the mark.\n\n**Ron Golan:**\nKeep being your awesome self, doing whatever it takes to win the right business for Rise8.\nStart recognizing you can be a great meeting facilitator, and do the work to get there. You can 100% do it.\n\n**Sagar Akre:**\n**Start:**\nBe more explicit in demonstrating your expertise around what clients want and need, especially when collaborating with delivery teams. Clearly articulating expectations during different growth activities will help everyone supporting internally at rise8 stay aligned.\n\n\n\n\n**Stop:**\nFeeling like the burden is solely on you or hesitating to involve delivery because you don’t want to interrupt their work. Keep reaching out. We want to support you.\n\n\n\n\n**Keep:**\nEverything you are already doing. Filling gaps when you see them, taking initiative, continuing to learn, and being an easy, reliable partner to work with.\n\n**Marc Fishman:**\nKeep seeking to put the best foot forward in all that Rise8 presents to would-be customers.\n\n\n\n\nKeep seeking to improve your soft-skills around the role to improve overall performance. This includes things like learning some basics in graphic design to better expedite proposals and ppts. \n\n\n\n\nStop apologizing for asking for help on project work; accept that we are a \"pair partner\" style office, therefore pairing with Risers can only lead to the greater good!\n\n\n\n\nStart partnering more with the marketing team to potentially brainstorm new and unexpected ways to present to customers; as there may be opportunities we as a company can take in the marketplace we are missing by adhering *just* to the GovTech norms.\n\n**Rachel Del Vecchio:**\nStart: \n- Seek out formal sales training if you have pro dev budget for it, you have all the domain context currently to crush at your job but need to keep strengthening the sales muscle. \n- Offering your opinion and giving more feedback. \n\n\n\n\nStop: I got nothin \n\n\n\n\nKeep: Looping marketing into your initiatives early and often so we can help identify ways to help!\n",
  "generation_timestamp": "2025-12-04 17:48:05"
}