{
  "employee_name": "Darrell Mudd",
  "accomplishments": "1) Built strong working relationships with the internal customers I support.  This has established a foundation for trust and open/honest dialogue.  It's added to my credibility as a strategic advisor to them\n\n\n\n\n2) As of Nov, 18th I have 47 offers accepted (PE=12, CICD=3, SWE=11, Cybersec=6, Marketing=3, Growth=1, 1099=5, Paid Intern=2, Skillbridge Intern=4) - has enabled by and large the Delivery org to deliver on contractual obligations and bill/capture revenue\n\n\n\n\n3) Beyond supporting my primary Engineering customers, have leaned-in and supported our Marketing organization this past summer.  Hired three (3) new additions to the team effectively doubling the size of the department.  One of which (Brand & Content Lead) I direct sourced off of LinkedIn (outreach).  Fulfilling these roles allows our Marketing team to move quicker (eliminating bottlenecks; time constraints a small team has managing multiple priorities working with outside agencies) and propels the team's ability to scale demand generation/in-bound lead programs and extending our brand to the market.",
  "enps_comments": "**Joseph Andrews:**\nYes. Darrell brings exceptional reliability, strong process discipline, and domain expertise that materially improves our recruiting outcomes. With a bit more initiative-taking and concise communication in meetings, he will be an even stronger leader on the team. I’d rehire him without hesitation.\n\n**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\nI love working with Darrell and would gladly rehire him for the current role he plays. He is great at communicating and providing context of what's going on with hiring and allocations, and is a vital part of making the team successful. Darrell cares about his team, the candidates that he's screening, and wants the mission to be impacted by bringing in the best possible candidates to the the Rise8 team. Keep up the great work and let's push for making our teams and hires even better!\n\n**Jeff Wills:**\nDarrell is great and has saved me several times by keeping a close eye on allocation openings and timing.  He's open to feedback and always reaches out when he needs clarification, making sure we're getting the best candidates.\n\n\n\n\nI'm interested in seeing more metrics around the engineering pipelines. It was a busy year, so there wasn't likely time to dig in on creating metrics, but it would be great to see more in the future. The spreadsheet is a good start, and am excited to see what's in 2026.\n\n**Carlo Viray:**\nMost of my interactions with you have been around the Growth roles and some of the delivery roles where we’ve had to navigate tricky situations with partners and poaching. You’re always super quick to respond, easy to communicate with, and on top of the pipeline. When we first started figuring out the Growth Manager and Proposal Manager roles, I know it was rough in the beginning. Those weren’t really roles you had sourced for before, and there was a lot of learning and recalibration along the way. I also know I can be a pretty tough customer when it comes to Growth hires, and I really appreciate your patience with me through all of that.\n\n\n\n\nEven though we haven’t quite nailed the candidate quality yet, I get that my criteria are different from most hiring managers and the talent pool is limited. I would love to collaborate on how we can find a better way to bring in stronger candidates because the pipeline has felt a little slow and thin. Overall, I’ve appreciated your responsiveness, your willingness to learn and adapt, and how open you are to feedback.\n\n**Jordan Dilworth:**\nI've had very limited exposure working with Darrell outside of 2 job reqs and those experiences were strained by Delivery side hiring rushes, which is reflected in my ratings above.  I think Darrell would agree that there is room for improvement in our process, communication and alignment through the hiring experience as it relates to that moment in time and specific support.\n\n**Kevan Mordan:**\nDarrell does a great job of engaging proactively with candidates and providing clear communications and feedback. Additionally, he oversees hiring for many different unique client needs for specific backgrounds, experience, and creative positions. That diversity is very impressive, definite rehire!\n",
  "start_stop_keep": "**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\n**Keep**\n- communicating as frequently as you do (especially in this transition from PLs to DLs and ELs)\n- getting to know your team and investing your time in them. Your care for your team is one of your biggest assets and don't forget that it means a lot to the team how you treat them\n**Stop**\n- focusing on the details in the context of a large group setting. There were several times that some of the details brought up were irrelevant to the group and would have made more sense in a smaller setting, to have conversations later and not distract the group.\n**Start**\n- doing referrals of referrals, i.e. asking for referrals and then for those that the candidate wouldn't have referred and see how they see the candidate (possibly for positions Senior and above)\npicking up on the context of the meeting and know when to share and when not to share (see \"Stop\" above)\n\n**Jeff Wills:**\nKeep reaching out to get clarification when needed.\nStart: Feel free to suggest a way for us to better help you screen,  even if that means creating a new tool to sync so you don't have to in Slack.\n\n**Carlo Viray:**\n**Start:**\nBeing more aggressive with sourcing candidates or partnering with Marketing to create a campaign that attracts stronger talent. Think about poaching from companies that are similar to Rise8 or operate in our services space. Right now, the approach feels a bit more passive and reliant on who comes to us, and I think we could be more proactive.\n\n\n\n\n**Stop:**\nFeeling like you need to wait on me or others before moving forward if something’s blocking you. From a sourcing standpoint, if you have a good enough understanding, just move. Keep the pipeline active and healthy, and we can adjust along the way. Time matters a lot, especially as we scale.\n\n\n\n\n**Keep:**\nBeing communicative and open to feedback. You’re great at staying in touch and making the process collaborative. Keep being honest with me if you’re struggling or need more clarity, because that helps me be a better customer to you and make sure you have what you need to find the right people.\n\n**Jordan Dilworth:**\nI would recommend that Darrell starts having more frequent communications with the hiring manager on all open reqs.  We had one that was getting attention and one that unfortunately did not get the same level of attention.  In this particular case, as the hiring manager, we were not able to source an interview through our recruiting efforts and the experiences in roles was very inconsistent.\n\n**Kevan Mordan:**\nKeep - Everything he is currently doing\n\n\n\n\nOther feedback but think that is more specific to the allocations process while transitioning from Practice to Delivery Leads, so don't want to conflate it.\n",
  "generation_timestamp": "2025-12-04 17:48:01"
}