{
  "employee_name": "Jeff Wills",
  "accomplishments": "Built out the Engineering Documentation Starter Kit.  I have had great feedback from teams saying that it is helping them better implement XP practices and Rise8 values.\n\n\n\n\nFormalizing Engineering Anchor allocations and clearly articulating what they're responsible for and accountable for. This has really helped teams perform better.  Teams have provided lots of positive feedback around this.  Working on better delivery and DORA metric rigor in CY 2026 to better understand how guidance and changes like this impact delivery performance.\n\n\n\n\nImproving Software Engineering Community via higher value meetings such as Community of Practice with relevant topics, Architecture Design Crit Workshops, and (s)WeRise 15-minute topics that can improve an engineer's experience and productivity on teams.\n\n\n\n\nI know this is a fourth. I put a lot of effort into getting the SpOC team re-staffed after trying to get the first team running.  The new team is crushing it. Delivery has increased dramatically, errors are down, and customer relations have improved.  It was super gratifying to hear we're now on track. I believe this one fell under Do what is required. in this case, for customer success\n\n\n\n\nAlso, I was pleased that I set the standard and template for announcing Riser promotions this summer. Its being used by all practices and now DLs too.",
  "enps_comments": "**Kevan Mordan:**\nJeff brings a stabilizing presence to delivery, and has stepped into his new role quickly and is driving much needed observability for team delivery performance. Rather than letting the complexity of the new role slow Jeff down, he has displayed significant growth and command in a short time. Jeff is a true foundational pillar of Rise8 and doesn't ask for any credit, but does it for the drive to deliver. There is no one else at Rise8 I trust as much to act on behalf of me or on behalf of Rise8.\n\n**Matt Pacione:**\nFrom Matt Pacione\n\n\n\n\nI would enthusiastically rehire Jeff in a heartbeat! He is a great engineer and leader in the company. I have loved working with him over the past couple of years and he's always been a good colleague and teammate. He cares about his team and he wants what's best for the team, Rise8, and the customer. He is very focused on doing the right thing when it comes to software, metrics, best practices, and has great ideas on how to implement these strategies to the various teams across the company. I love hearing what Jeff comes up with and the analysis he shares about his insights on the company. He's got a special eye on the high level perspective and picking up on trends and patterns.\n\n**Minh Nguyen:**\nYour leadership as Practice Lead has been helpful in  and upholding technical standards. I found your push for  DDD EventStorming incredibly helpful; it clarified my project understanding and created a useful artifact for onboarding new team members. I thoroughly enjoy our bi-weekly catchups. You act as a great coach, always providing timely and actionable advice. I appreciate your push for DORA metrics, which really helps our team evaluate our code delivery, while still being flexible and understanding when certain metrics didn't apply due to our release cadence. Finally, you embody a Growth Mindset by consistently updating the engineering practice toolkit based on our direct team feedback.\n\n**Brian Jennings:**\nI haven't had the opportunity to work as closely with Jeff as others, especially in the new role as Deputy Director. I appreciate Jeff's rigor for defining metrics and trying to put processes in place to make us better. I also appreciate Jeff's ability to build trusting relationships with his engineering anchors.\n\n**Rob Monroe:**\n- I can count on Jeff to always gets the job done, no matter what the situation is\n- I Admire his persistence and tenacity to make drumbeat consumption more scalable\n- Finding a way to help all delivery teams standardize and extract DORA metrics will help us gauge performance more objectively, and improve our value proposition confidence by actually demonstrating delivery results for our customers\n\n**Ainsilie Hibbard:**\nJeff would be a strongly encouraged rehire due to his exceptional knowledge, strong work ethic, and consistent commitment to teamwork. He brings a deep understanding of our operations, routinely goes above and beyond in his responsibilities, and actively supports colleagues to ensure collective success. His professionalism, reliability, and collaborative approach make him an invaluable asset to the organization.\n\n**Max Reele:**\nYou are an excellent Engineering Leader and absolutely essential to making the Delivery Department a credible engineering organization.\n",
  "start_stop_keep": "**Kevan Mordan:**\nStart - Being more proactive in holding Risers to the set standards, and feeling confident to speak directly about feedback across the company.\n\n\n\n\nKeep - Relentless pursuit of engineering excellence. You not only preach it, but you live it and demonstrate it.\n\n**Matt Pacione:**\nThis is from Matt Pacione\n\n\n\n\n**Keep**\n- paying attention to detail and doing excellent work, across all the practices. Jeff's knowledge of software, platform, and cyber, put him in a place to support all facets of engineering\n- doing amazing work, being a thoughtful, caring, responsive teammate\n- investing time in your team, figuring out where we can improve as a company and how we can better implement best practices across the teams\n\n\n\n\n**Stop**\n- nothing that I can think of. I have absolutely loved working with Jeff and he's been a great partner over the last 2 years in engineering. If there's anything, it would be stop taking on so much and share out when he needs help (see \"Start\" below as well)\n\n\n\n\n**Start**\n- asking for help. If he needs anything, ask for help from others.\n\n**Minh Nguyen:**\n**Start**\nI'm not sure if it's you or Mike that are running the weekly sWE Rise meeting and the monthly Software engineering practice meeting, but someone mentioned demoing, guest speakers, and I really like that idea so we should start pushing for that\n**Keep**\nOur biweekly meetings\n\n**Brian Jennings:**\nStart: With the re-org, designers were concerned feeling like they \"lost a seat at the table\" at the Delivery Leadership table. I believe it would go a long way if in your new role you could connect with the designers in the org and help advocate and elevate their voices/needs.\n\n\n\n\nContinue: Being the representative of institutional knowledge. Your institutional knowledge will be immensely valuable with so many new delivery leads around you in the delivery organization. Continue to do as you do with helping teams understand historical context and avoid pitfalls.\n\n\n\n\nNot sure how best to frame this in start/stop/continue - I think you and I are pushing for a lot of initiatives that have a good amount of cross-over. As you are pushing for and documenting delivery consistency, I'm also trying to document expectations and consistency in RiseU. I think there are opportunities for us to work closely on these things, right now it feels like our work is more silo'ed than it likely should be. - Brian\n\n**Rob Monroe:**\n**Start**\n- Tying delivery performance conversations with teams, back to mission impact performance\n**Stop**\n- None at this time\n**Continue**\n- Coaching and holding engineers accountable for giving direct feedback to all teammates\n\n**Ainsilie Hibbard:**\nPlease keep demonstrating your deep knowledge, strong work ethic, and supportive, team oriented approach. Your reliability and willingness to jump in wherever needed greatly benefit the entire delivery team. Sometimes I worry that you're taking on so much yourself that it limits delegation or team development opportunities. Consider sharing more of your strategic insights proactively with the broader team. Your perspective is highly valued, and more visibility into your thinking could help strengthen alignment and decision making.\n\n**Max Reele:**\nStart: (1) Working with me to prioritize all of the work-steams that you currently operate within. Identifying areas that can be delegated elsewhere or cut out completely. Making room for deeper focus on the higher priorities. (2) Relying on the Enablement Department to help you/us with areas of support we need in Delivery. That is what they exist for and we can be a demanding customer.\n\n\n\n\nStop: Relying on published policy or guidance as a motivator for Riser/team performance. At times, I've heard you reference templates, guidance, checklists, Slack posts with the expectation that Risers are adequately informed. When signals are there that Risers aren't following that guidance, we need to seek out other ways of communicating the expectation or making compliance an easier path for them.\n\n\n\n\nKeep: (1) Objectively telling us all how performance is going. You're exceptional at this. (2) Keep digging in deeper where you see we have a gap in process or product, like you've done with the engineering starter kit and the DORA report.\n",
  "generation_timestamp": "2025-12-04 17:48:02"
}